[
  {
    "name": "Saint Francis of Assisi",
    "birthYear": 1181,
    "deathYear": 1226,
    "feastDay": "--10-04",
    "biography": "Saint Francis of Assisi, born in 1181 or 1182 in the town of Assisi, Italy, was the son of a wealthy cloth merchant. As a young man, he enjoyed a life of comfort, parties, and ambition. He dreamed of becoming a knight and gaining glory in battle. However, a series of events — including imprisonment, illness, and a growing sense of spiritual emptiness — led him to rethink his life’s purpose.\n\nAround the age of 25, Francis underwent a profound spiritual conversion. He began to live in radical poverty, renouncing his inheritance and embracing a life of simplicity, prayer, and service. He dedicated himself to following Christ literally, caring for the poor and lepers, and preaching repentance.\n\nOne of the most defining moments in his journey occurred when he heard the voice of Christ from the crucifix in the church of San Damiano, telling him: \"Rebuild my Church.\" Francis first took this literally, repairing broken chapels, but he soon understood his mission was spiritual renewal within the broader Church.\n\nIn 1209, he founded the Order of Friars Minor, better known as the Franciscans, who embraced poverty, humility, and preaching. He later founded the Poor Clares with Saint Clare, and the Third Order of Saint Francis for laypeople. His joyful love of creation, deep humility, and commitment to peace and compassion earned him admiration across all walks of life.\n\nFrancis is also remembered for his mystical connection with nature. He called animals his \"brothers and sisters\" and composed the famous \"Canticle of the Sun\", a hymn praising God for creation. Legend holds that he received the stigmata — the wounds of Christ — two years before his death, a rare and profound sign of union with Jesus’ suffering.\n\nHe died in 1226, at the age of 44, and was canonized just two years later. In 1979, he was declared the patron saint of ecology and animals, and his legacy has only grown stronger in modern times, especially as a symbol of peace, care for creation, and humble discipleship.",
    "patronage": "Animals, environment, merchants",
    "canonizationYear": 1228,
    "imageUrl": "/images/saint_francis.jpg"
  },
  {
    "name": "Saint Thérèse of Lisieux",
    "birthYear": 1873,
    "deathYear": 1897,
    "feastDay": "--10-01",
    "biography": "Saint Thérèse of Lisieux, also known as \"The Little Flower of Jesus\", was born on January 2, 1873, in Alençon, France, into a deeply devout Catholic family. Her parents, Saints Louis and Zélie Martin, raised Thérèse and her four surviving sisters in an atmosphere of strong faith and loving discipline.\n\nFrom a young age, Thérèse showed a sensitive spirit, a deep love for God, and a desire for holiness. After the early death of her mother when Thérèse was just four years old, she became even more emotionally dependent on her family, especially her sister Pauline, who later entered the Carmelite convent. Thérèse longed to follow in her footsteps.\n\nDespite being only 15, she pleaded with Church authorities — and even personally appealed to the Pope during a pilgrimage to Rome — for permission to enter the Carmelite Monastery of Lisieux. Her persistence was granted, and she joined the convent in 1888.\n\nInside the cloister, Thérèse lived a hidden life of prayer, sacrifice, and spiritual simplicity. She never traveled far or did anything publicly heroic, but it was in her quiet, everyday acts of love that her sanctity blossomed. Thérèse developed what she called \"the Little Way\" — a spiritual path based not on grand deeds, but on trusting in God's mercy and doing small things with great love.\n\nStruggling with physical frailty and spiritual dryness, Thérèse endured much suffering — especially in the final years of her life when she battled tuberculosis, which eventually led to her death at the age of 24 in 1897. Yet she remained filled with joy, love, and unwavering trust in God.\n\nBefore her death, at the request of her superiors, she wrote her spiritual autobiography, \"Story of a Soul\", which became one of the most beloved spiritual classics in the world. In it, she expressed her belief that “My vocation is love.” Her words continue to inspire millions with their clarity, humility, and warmth.\n\nThérèse was canonized in 1925, just 28 years after her death, and in 1997 she was declared a Doctor of the Church — one of the few women to receive this title. Despite her short and hidden life, her influence on Catholic spirituality is immense.\n\nShe is the patron saint of missionaries, florists, and those who seek to grow in faith through simple acts of love. Her \"little way\" remains a powerful reminder that holiness is accessible to all, not through extraordinary feats, but by trusting God and loving Him in the ordinary moments of daily life.",
    "patronage": "Missionaries, florists, AIDS sufferers",
    "canonizationYear": 1925,
    "imageUrl": "/images/saint_therese_de_lisieux.jpg"
  },
  {
    "name": "Saint Augustine of Hippo",
    "birthYear": 354,
    "deathYear": 430,
    "feastDay": "--08-28",
    "biography": "Saint Augustine of Hippo was born in 354 in Tagaste (modern-day Algeria), in North Africa. He was raised by a devout Christian mother, Saint Monica, and a pagan father. Despite his mother's influence, Augustine lived much of his early life distant from the Christian faith. As a young man, he pursued worldly pleasures, fame, and intellectual achievement, studying rhetoric and philosophy in Carthage and later teaching in Rome and Milan.\n\nFor years, Augustine explored various philosophies and religions in search of truth, including Manichaeism and Neoplatonism. However, he remained restless and unfulfilled. His journey toward Christianity culminated in a powerful moment of personal conversion in 386, inspired by the preaching of Saint Ambrose and the prayers of his mother. Soon after, he was baptized in 387 and began to live a radically different life.\n\nAugustine returned to Africa, sold his possessions, and founded a monastic community. In 395, he was made Bishop of Hippo, where he would serve for over three decades. As bishop, he became a brilliant and passionate defender of Christian doctrine during a time of theological division and political upheaval.\n\nA prolific writer and deep thinker, Augustine authored numerous influential works that continue to shape Christian thought. His most famous writings include \"Confessions\", a personal and spiritual autobiography, and \"The City of God\", a sweeping theological reflection on the relationship between Christianity and society. His teachings on grace, free will, original sin, and the nature of God laid foundational stones for both Western Christianity and philosophy.\n\nAugustine died in 430 during the siege of Hippo by the Vandals. Though never formally canonized (as canonization wasn’t a formal process at the time), he is honored as a Doctor of the Church and one of its greatest theologians.\n\nHe is the patron saint of theologians, brewers, and those seeking conversion. His life is a powerful testament to the mercy of God and the transformation that grace can bring to even the most restless of hearts.",
    "patronage": "Theologians, brewers, printers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_augustine.jpg"
  },
  {
    "name": "Saint Joan of Arc",
    "birthYear": 1412,
    "deathYear": 1431,
    "feastDay": "--05-30",
    "biography": "Saint Joan of Arc, also known as the Maid of Orléans, was born in 1412 in the small village of Domrémy in northeastern France. From a young age, she claimed to receive visions and hear the voices of saints such as Michael the Archangel, Saint Catherine, and Saint Margaret, who urged her to support Charles VII and help free France from English domination during the Hundred Years’ War.\n\nAt just 17 years old, Joan convinced Charles and his court of her divine mission. Dressed in armor and leading troops into battle, she played a crucial role in lifting the siege of Orléans in 1429, a pivotal victory that led to Charles's coronation at Reims. Her courage, faith, and leadership inspired the French army and shifted the momentum of the war.\n\nHowever, in 1430, Joan was captured by Burgundian forces allied with the English. She was handed over to the English and put on trial for charges including heresy, witchcraft, and dressing as a man. After a politically motivated and deeply unjust trial, she was condemned and burned at the stake in Rouen in 1431, at the age of 19.\n\nTwenty-five years later, a posthumous retrial ordered by the Pope declared her innocent and a martyr. Joan of Arc was canonized in 1920 and is now one of the most revered saints of the Catholic Church. She is the patron saint of France, soldiers, and those facing persecution. Her story remains a powerful symbol of faith, conviction, and bravery in the face of overwhelming odds.",
    "patronage": "France, soldiers, martyrs",
    "canonizationYear": 1920,
    "imageUrl": "/images/saint_joan_of_arc.jpg"
  },
  {
    "name": "Saint Teresa of Ávila",
    "birthYear": 1515,
    "deathYear": 1582,
    "feastDay": "--10-15",
    "biography": "Saint Teresa of Ávila, also known as Saint Teresa of Jesus, was born in 1515 in Gotarrendura, near Ávila, Spain. From a young age, she displayed a deep religious sensitivity and an active imagination. After a period of personal struggle and spiritual searching in her early life, she entered the Carmelite Convent of the Incarnation at the age of 20.\n\nInitially, the convent life was not very strict, and Teresa herself admitted to being distracted by social visits and conversations. However, a serious illness in her late twenties became a turning point. During this time, she experienced profound moments of prayer, mystical visions, and inner transformation, leading her to a deeper commitment to God.\n\nTeresa became convinced that the Carmelite order needed reform. Facing resistance from both within and outside the convent, she courageously began establishing new communities focused on prayer, simplicity, and contemplative life. These communities became part of what is now called the Discalced Carmelites (meaning \"barefoot\" or “shoeless”), symbolizing a return to a more austere and humble way of life.\n\nA gifted writer and thinker, Teresa described her spiritual experiences in several profound works, including \"The Interior Castle\" and \"The Way of Perfection\". These writings have become classics of Christian mysticism and spiritual theology, emphasizing the soul’s journey toward union with God through prayer, humility, and detachment from worldly things.\n\nTeresa was known not only for her holiness and mystical experiences, but also for her intelligence, wit, and administrative skill. Despite frequent illnesses and opposition, she founded over a dozen reformed convents across Spain.\n\nShe died in 1582 at the age of 67. In 1614, she was beatified, and in 1622 she was canonized by Pope Gregory XV. In 1970, she was declared a Doctor of the Church — one of the first two women to receive that title — in recognition of her theological contributions.\n\nToday, Saint Teresa of Ávila is venerated as the patron saint of headache sufferers, Spanish Catholic writers, and those seeking deeper prayer. Her life continues to inspire those seeking spiritual depth, reform, and courage rooted in faith.",
    "patronage": "Headache sufferers, Spanish Catholic writers",
    "canonizationYear": 1622,
    "imageUrl": "/images/saint_teresa.jpg"
  },
  {
    "name": "Saint Anthony of Padua",
    "birthYear": 1195,
    "deathYear": 1231,
    "feastDay": "--06-13",
    "biography": "Saint Anthony of Padua was born in Lisbon, Portugal, in 1195. Originally named Fernando Martins, he joined the Augustinian Canons but later entered the Franciscan Order, inspired by the martyrdom of five Franciscan missionaries. Taking the name Anthony, he became a gifted preacher and theologian known for his powerful sermons, deep scriptural knowledge, and tireless care for the poor and marginalized. Anthony traveled extensively across Italy and France, drawing large crowds wherever he preached. He was also known for miraculous events during his lifetime and after his death, including the famous legend of him preaching to fish when people refused to listen. Saint Anthony died in Padua, Italy, in 1231 at the age of 36. He was canonized just 11 months later by Pope Gregory IX, one of the quickest canonizations in Church history. In 1946, Pope Pius XII declared him a Doctor of the Church for his profound theological insight.",
    "patronage": "Lost items, the poor, travelers, pregnant women, the elderly, fishermen",
    "canonizationYear": 1232,
    "imageUrl": "/images/saint_anthony_of_padua.jpg"
  },
  {
    "name": "Saint Thomas Aquinas",
    "birthYear": 1225,
    "deathYear": 1274,
    "feastDay": "--01-28",
    "biography": "Saint Thomas Aquinas was a brilliant Italian Dominican friar and theologian born around 1225 in Roccasecca, in what is now Italy. Despite noble family expectations, he joined the Dominican Order and studied under Albertus Magnus. Aquinas went on to teach at leading universities such as Paris and Naples, where he shaped his groundbreaking synthesis of Aristotelian philosophy and Christian theology.\n\nHe authored towering works like the Summa Theologiae and Summa Contra Gentiles, exploring topics such as the existence of God, natural law, morality, and the nature of reality. In 1273, near the end of his life, he received a mystical vision during Mass that deeply moved him and left him saying: “All I have written seems like straw.” He passed away in 1274 en route to the Second Council of Lyon.\n\nCanonized in 1323 and honored as a Doctor of the Church, Aquinas remains a paramount figure in theological education. He is the patron saint of scholars, students, philosophers, universities, and Catholic schools, a testament to his enduring impact on faith and reason.",
    "patronage": "Scholars, students, philosophers, Catholic schools, universities, academics",
    "canonizationYear": 1323,
    "imageUrl": "/images/saint_thomas_aquinas.jpeg"
  },
  {
    "name": "Saint Joseph",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--03-19",
    "biography": "Saint Joseph, spouse of the Blessed Virgin Mary and earthly father of Jesus Christ, is one of the most revered figures in Christianity. Though Scripture gives few details about his life, his role is monumental in salvation history. A humble carpenter living in Nazareth, Joseph was a man of deep faith and integrity. When he learned of Mary's pregnancy, he initially planned to quietly divorce her to spare her public shame, but an angel appeared to him in a dream and reassured him of the divine origin of her child. Joseph obediently accepted God’s will and took Mary as his wife, becoming the protector and guardian of the Holy Family.\n\nJoseph’s actions throughout the Gospels show a man of decisive courage and silent strength. He led the family to Egypt to escape King Herod's persecution, returned them safely to Nazareth, and provided for them through honest labor. His fidelity to divine guidance, often received in dreams, marks him as a model of contemplative listening and faithful action. Though he never speaks a word in Scripture, his silence communicates his humility, obedience, and trust in God's providence.\n\nThroughout Church history, Saint Joseph has been venerated as the patron of fathers, workers, and the universal Church. In 1870, Pope Pius IX declared him Patron of the Universal Church, and in 2021, Pope Francis dedicated a whole year in his honor. Joseph is also considered the patron of a happy death, as tradition holds he died in the loving presence of Jesus and Mary. His example continues to inspire Christians to live with integrity, serve quietly, and trust deeply in God’s plan.",
    "patronage": "Universal Church, workers, carpenters, fathers, families, a happy death, immigrants, travelers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_joseph.jpeg"
  },
  {
    "name": "Saint Joseph the Worker",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--05-01",
    "biography": "Saint Joseph the Worker is a title of Saint Joseph that highlights his dignity as a laborer and his sanctification of ordinary work. This feast was established by Pope Pius XII in 1955 as a direct response to the rise of communism and to affirm the value of human labor through a Christian lens. Celebrated on May 1st—International Workers' Day—the Church presents Saint Joseph not only as a protector of the Holy Family but also as a spiritual patron for all workers around the world.\n\nAs a carpenter by trade, Joseph's life was marked by manual labor, discipline, and dedication. He worked not for wealth or recognition, but to provide for his family with integrity and to glorify God through his craftsmanship. Through the daily toil of his hands, Joseph shows that work is not merely a necessity but a vocation and a path to holiness. His silent perseverance and attention to duty reflect the spiritual value of labor when done with love and responsibility.\n\nThis feast day reminds the faithful that all honest work, whether physical or intellectual, is an act of co-creation with God and contributes to the building of a just society. Saint Joseph the Worker stands as a powerful example for those who labor in obscurity, struggle to support families, or seek dignity in employment. He remains an enduring model of humility, purpose, and faithful work offered in service to others.",
    "patronage": "Workers, laborers, fathers, families, craftsmen",
    "canonizationYear": null,
    "imageUrl": "/images/saint_joseph.jpeg"
  },
  {
    "name": "Saint Catherine of Siena",
    "birthYear": 1347,
    "deathYear": 1380,
    "feastDay": "--04-30",
    "biography": "Saint Catherine of Siena was a Dominican tertiary, mystic, theologian, and one of the most influential women in the history of the Catholic Church. Born in 1347 in Siena, Italy, during the time of the Black Death, she was the 25th of 25 children. From a young age, Catherine experienced profound mystical visions and developed a deep spiritual life rooted in prayer, penance, and service.\n\nDespite family pressure to marry, she chose a life of consecrated virginity and eventually joined the Third Order of Saint Dominic. Living a life of austerity and humility, she ministered to the sick and poor while continuing to receive extraordinary visions of Christ. One of her most famous mystical experiences was her 'mystical marriage' to Jesus, symbolizing her total union with God.\n\nCatherine’s influence extended far beyond her hometown. Through her letters—over 300 of which survive—she advised popes, cardinals, and political leaders, urging reform within the Church and promoting peace among warring states. She played a vital role in convincing Pope Gregory XI to return the papacy from Avignon to Rome, a significant moment in Church history.\n\nHer major work, *The Dialogue of Divine Providence*, is a theological masterpiece that explores God's love, virtue, and the soul’s journey toward unity with Him. Despite her lack of formal education, her spiritual insights earned her the title of Doctor of the Church in 1970, one of only a few women to receive this honor.\n\nSaint Catherine died at the age of 33 in Rome, worn out by her intense spiritual and physical efforts. She is venerated as a patron saint of Italy and Europe and remains a model of courage, holiness, and uncompromising dedication to truth.",
    "patronage": "Italy, nurses, people ridiculed for their faith, fire prevention, miscarriages, bodily ills, and Europe",
    "canonizationYear": 1461,
    "imageUrl": "/images/saint_catherine_of_siena.jpg"
  },
  {
    "name": "Saint Patrick",
    "birthYear": 385,
    "deathYear": 461,
    "feastDay": "--03-17",
    "biography": "Saint Patrick, the 'Apostle of Ireland,' was a 5th-century missionary and bishop who played a pivotal role in the Christianization of Ireland. Born around 385 in Roman Britain—likely in modern-day Wales or Scotland—Patrick was the son of a deacon and the grandson of a priest. Despite his Christian upbringing, he did not embrace the faith deeply in his early years.\n\nAt the age of sixteen, Patrick was kidnapped by Irish raiders and enslaved in Ireland. He spent six years tending sheep in captivity, during which time he underwent a profound spiritual transformation. According to his own writings, he turned to prayer and developed an intense relationship with God. Guided by a vision, he escaped captivity and returned to his family.\n\nAfter returning home, Patrick entered religious training and was eventually ordained a priest and later consecrated as a bishop. He received another divine calling in a dream—this time to return to Ireland and bring the Gospel to its people. Around 432 AD, Patrick began his mission in Ireland, preaching, baptizing, and converting both commoners and chieftains across the island.\n\nPatrick is credited with establishing churches, monasteries, and schools, laying the foundation for Ireland’s transformation into a deeply Christian society. He famously used the three-leafed shamrock to explain the mystery of the Holy Trinity—Father, Son, and Holy Spirit—which became a lasting symbol of Irish Christianity.\n\nThough much of his story has been embellished with legend—such as driving snakes out of Ireland—his two authentic writings, the *Confessio* and *Letter to the Soldiers of Coroticus*, provide insight into his humility, faith, and missionary zeal.\n\nSaint Patrick died around 461 in Saul, County Down, where he had built his first church. His legacy endures not only in religious tradition but also in cultural celebrations worldwide. His feast day, March 17th, is observed as both a solemn religious occasion and a festive tribute to Irish heritage.",
    "patronage": "Ireland, engineers, Nigeria, and against snakes",
    "canonizationYear": null,
    "imageUrl": "/images/saint_patrick.jpg"
  },
  {
    "name": "Saint Peter the Apostle",
    "birthYear": null,
    "deathYear": 64,
    "feastDay": "--06-29",
    "biography": "Saint Peter, originally named Simon, was one of Jesus Christ’s closest disciples and is considered the first Pope of the Catholic Church. A fisherman from Bethsaida, he was called by Jesus to become a 'fisher of men' and quickly emerged as a leader among the Twelve Apostles. Jesus gave him the name Peter (meaning 'rock') and declared that upon this rock He would build His Church.\n\nPeter’s journey was marked by bold faith as well as human frailty. He famously walked on water but sank in fear, and he declared unwavering loyalty to Jesus only to deny Him three times before the crucifixion. After Christ’s resurrection, Peter was forgiven and reaffirmed as the shepherd of the early Church.\n\nHe preached boldly in Jerusalem, performed miracles, and ultimately traveled to Rome, where he was martyred during Nero's persecution around 64 AD. Tradition holds that he was crucified upside down by his own request, not feeling worthy to die as his Lord had. Saint Peter is often depicted holding keys, symbolizing the authority given to him by Christ.\n\nHis legacy as leader, preacher, and martyr solidified his role as a foundational figure in Christianity.",
    "patronage": "Popes, fishermen, net makers, shipbuilders, and Rome",
    "canonizationYear": null,
    "imageUrl": "/images/saint_peter.jpg"
  },
  {
    "name": "Saint Nicholas of Myra",
    "birthYear": 270,
    "deathYear": 343,
    "feastDay": "--12-06",
    "biography": "Saint Nicholas of Myra, also known as Nicholas of Bari, was a 4th-century bishop in the region of Lycia (modern-day Turkey). Renowned for his charity, miracles, and defense of Christian doctrine, he is one of the most beloved saints in both Eastern and Western Christianity. \n\nBorn into a wealthy Christian family, Nicholas inherited his parents’ fortune at a young age and chose to give it away to help the poor and needy. One of the most famous legends tells of how he secretly provided dowries for three impoverished sisters by tossing bags of gold into their home at night—an act that inspired the tradition of gift-giving.\n\nNicholas became Bishop of Myra and was known for his fearless leadership, even during Roman persecutions. He was imprisoned for his faith under Emperor Diocletian but released under Constantine. He also reportedly attended the Council of Nicaea in 325, where he defended orthodox Christian doctrine against heresy.\n\nHis legacy inspired centuries of devotion and led to the transformation of his image into Santa Claus in Western culture. But beyond legend, Saint Nicholas remains a powerful symbol of selfless generosity and pastoral care.",
    "patronage": "Children, sailors, merchants, pawnbrokers, and students",
    "canonizationYear": null,
    "imageUrl": "/images/saint_nicholas.jpg"
  },
  {
    "name": "Saint Padre Pio",
    "birthYear": 1887,
    "deathYear": 1968,
    "feastDay": "--09-23",
    "biography": "Saint Padre Pio, born Francesco Forgione in Pietrelcina, Italy, was a Capuchin friar renowned for his deep spirituality, mystical gifts, and compassionate ministry. From an early age, he displayed a profound love for God and joined the Capuchin order as a young man. Padre Pio is most famously associated with bearing the stigmata—the wounds of Christ—which he received in 1918 and bore for fifty years until his death.\n\nThroughout his life, he experienced visions, bilocation, and prophetic insights, becoming a beacon of hope for countless people. Padre Pio spent many hours hearing confessions, offering spiritual guidance and consolation. Despite skepticism and investigation by Church authorities, his holiness was ultimately affirmed.\n\nHe founded the 'Home for the Relief of Suffering' hospital, underscoring his care for both the spiritual and physical needs of others. Canonized in 2002 by Pope John Paul II, Padre Pio’s legacy endures through his message of prayer, suffering, and divine love, inspiring millions worldwide.",
    "patronage": "Civil defense volunteers, adolescents, stress relief, and the sick",
    "canonizationYear": 2002,
    "imageUrl": "/images/saint_padre_pio.jpeg"
  },
  {
    "name": "Saints Joachim and Anne",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--07-26",
    "biography": "Saints Joachim and Anne are traditionally recognized as the parents of the Virgin Mary and grandparents of Jesus Christ. Though not mentioned explicitly in the canonical Gospels, their story is celebrated in Christian tradition, especially based on apocryphal texts such as the 'Protevangelium of James.'\n\nAccording to tradition, Joachim and Anne were a devout, elderly couple who longed for a child but remained childless for many years. After fervent prayer and divine promise, Anne conceived Mary, marking a pivotal moment in salvation history.\n\nThey are honored for their faith, perseverance, and role in preparing the way for the Incarnation. Their example encourages married couples and those struggling with infertility, symbolizing hope and trust in God’s timing.",
    "patronage": "Fathers, grandfathers, grandparents, married couples, and infertile couples",
    "canonizationYear": null,
    "imageUrl": "/images/saints_joachim_anne.jpg"
  },
  {
    "name": "Saint Monica",
    "birthYear": 331,
    "deathYear": 387,
    "feastDay": "--08-27",
    "biography": "Saint Monica was born in Thagaste (present-day Algeria) and is widely revered for her persistent prayers and unwavering faith in the conversion of her son, Augustine, who later became one of Christianity’s greatest theologians and saints. Monica’s life was marked by personal trials, including a difficult marriage to a pagan husband who was often harsh, and the wayward behavior of her children.\n\nDespite these challenges, Monica remained steadfast in her Christian faith, exhibiting great patience, humility, and charity. She is most remembered for her tearful prayers and determination that eventually led Augustine to embrace Christianity.\n\nSaint Monica is often invoked by mothers and families facing difficult relationships or struggling with the faith of their loved ones. Her example is one of hope, perseverance, and the power of prayer.",
    "patronage": "Married women, mothers, difficult marriages, disappointing children, and conversion of relatives",
    "canonizationYear": null,
    "imageUrl": "/images/saint_monica.jpg"
  },
  {
    "name": "Saint Paul the Apostle",
    "birthYear": 5,
    "deathYear": 64,
    "feastDay": "--06-29",
    "biography": "Saint Paul the Apostle, born Saul of Tarsus, was a pivotal figure in the spread of Christianity beyond its Jewish roots. Initially a zealous persecutor of Christians, Paul's dramatic conversion on the road to Damascus transformed him into one of Christianity’s most ardent missionaries and theologians.\n\nHe traveled extensively across the Roman Empire, founding churches and nurturing new Christian communities. Paul's epistles, many of which became part of the New Testament, offer profound theological insights on grace, faith, and the nature of Christ.\n\nDespite facing imprisonment, beatings, and ultimately martyrdom in Rome, Paul’s unwavering dedication to his mission helped shape Christianity’s identity as a universal faith. He is honored as the patron saint of missionaries, writers, and theologians.",
    "patronage": "Missionaries, theologians, evangelists, writers, and Malta",
    "canonizationYear": null,
    "imageUrl": "/images/saint_paul.jpg"
  },
  {
    "name": "Saint Valentine",
    "birthYear": 225,
    "deathYear": 269,
    "feastDay": "--02-14",
    "biography": "Saint Valentine was a Christian priest or bishop in the Roman Empire during the 3rd century, who became widely recognized as a symbol of love and devotion. Though historical details about his life are somewhat scarce and often mixed with legend, Valentine is traditionally believed to have ministered to persecuted Christians and secretly performed marriages for young couples during a time when Emperor Claudius II had banned marriages to strengthen his army. \n\nValentine was arrested and executed around the year 269 AD for his defiance and faith. Over time, his legacy grew, and he became associated with courtly love and the celebration of romantic affection. The feast day of Saint Valentine on February 14th evolved into what is now recognized as Valentine’s Day, a day dedicated to love and affection worldwide. He is considered a patron saint of lovers, young people, and happy marriages.",
    "patronage": "Lovers, young people, happy marriages, epilepsy, and beekeepers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_valentine.jpg"
  },
  {
    "name": "Saint Jude Thaddeus",
    "birthYear": 10,
    "deathYear": 65,
    "feastDay": "--10-28",
    "biography": "Saint Jude Thaddeus, often simply called Saint Jude, was one of the twelve apostles of Jesus Christ. He is traditionally identified as the brother of Saint James the Less and a relative of Jesus. Jude is remembered for his faithful witness to Christ, even in the face of great adversity and martyrdom.\n\nHe is famously known as the patron saint of hopeless causes and desperate situations, as many believers turn to him in times of great need. Tradition holds that Saint Jude preached the Gospel extensively, including in regions like Syria and Persia, where he was martyred around 65 AD. The Letter of Jude in the New Testament is attributed to him, offering encouragement to Christians to persevere in faith.\n\nHis symbol is often a flame around his head, representing his zeal, or an image of him holding an image of Jesus, called the Image of Edessa.",
    "patronage": "Lost causes, desperate situations, hospitals, and desperate cases",
    "canonizationYear": null,
    "imageUrl": "/images/saint_jude_thaddeus.jpeg"
  },
  {
    "name": "Saint Sebastian",
    "birthYear": 255,
    "deathYear": 288,
    "feastDay": "--01-20",
    "biography": "Saint Sebastian was a Christian martyr and Roman soldier who lived during the late 3rd century. He is most famously remembered for his unwavering faith and courage in the face of persecution under Emperor Diocletian. Sebastian served as a captain in the Praetorian Guard but secretly ministered to Christians persecuted by the empire.\n\nDiscovered to be a Christian, Sebastian was sentenced to death by being tied to a tree and shot with arrows. Miraculously, he survived this execution attempt and was later healed by Saint Irene. However, he continued to openly profess his faith and was eventually martyred by beating.\n\nSaint Sebastian is venerated as a protector against plagues and is often depicted pierced by arrows in Christian art. His feast day on January 20th honors his bravery, faith, and role as a spiritual warrior.",
    "patronage": "Soldiers, athletes, archers, plague victims, and those suffering from illness",
    "canonizationYear": null,
    "imageUrl": "/images/saint_sebastian.jpg"
  },
  {
    "name": "Saint Philomena",
    "birthYear": 291,
    "deathYear": 304,
    "feastDay": "--08-11",
    "biography": "Saint Philomena is celebrated as a young virgin martyr whose story surfaced in the early 19th century following the discovery of her tomb in the Catacombs of Priscilla in Rome. Although little is known from historical records, Christian tradition and devotion have filled in her legacy. She is believed to have been a noble-born Christian who vowed to live a life of chastity and faith during a time when the Roman Empire aggressively persecuted Christians. According to accounts derived from the inscriptions and artifacts found at her tomb, Philomena was arrested for her faith and subjected to brutal tortures. Legends speak of miraculous interventions—such as arrows that failed to harm her and chains that fell off—that ultimately led to her martyrdom by beheading around the age of 13.\n\nHer steadfastness in faith and refusal to renounce Christianity made her a symbol of purity, courage, and divine protection. After the rediscovery of her tomb in 1802, reports of miraculous healings and answered prayers attributed to her intercession spread rapidly, especially among parents praying for sick children and those in desperate need of help. Devotion to Saint Philomena grew quickly, with many considering her a powerful advocate for healing, protection of infants and youth, and even those seeking divine aid in seemingly impossible circumstances. Today, her image is often depicted holding arrows and an anchor, which reflect both her martyrdom and hope. Though not formally canonized by the Vatican, she is widely venerated as a saint in popular devotion and by many religious communities.",
    "patronage": "Infants, babies, youth, babies with illnesses, and treasure hunters",
    "canonizationYear": null,
    "imageUrl": "/images/saint_philomena.jpeg"
  },
  {
    "name": "Mary the Blessed Virgin (Theotokos)",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--01-01",
    "biography": "Mary, the Blessed Virgin, revered as Theotokos (“God-bearer” in Greek), holds an unparalleled position in Christianity as the mother of Jesus Christ, the Son of God. Her life, while only briefly described in the Gospels, has inspired an immense theological, devotional, and cultural tradition throughout Christian history. Born into a humble Jewish family, Mary was chosen by God to conceive Jesus through the Holy Spirit, an event known as the Annunciation, marking her as uniquely pure and obedient to God’s will.\n\nMary’s \"fiat\" — her willing acceptance of God's plan — epitomizes perfect discipleship and faith. She journeyed with Jesus through his earthly life, witnessing his ministry, suffering, and death, showing unparalleled maternal love and compassion. She is also present with the early Christian community after the Resurrection, underscoring her role as a spiritual mother to all believers.\n\nThroughout history, Mary has been honored with numerous titles such as Our Lady, Queen of Heaven, and Mother of Mercy, reflecting her multifaceted role as intercessor and protector. Devotion to Mary spans across denominations and cultures, with countless feasts dedicated to her, including the Solemnity of Mary, Mother of God on January 1. She is also traditionally believed to have been assumed bodily into heaven at the end of her earthly life, a dogma declared in the Catholic Church in 1950. Mary’s influence extends beyond religion into art, music, and social justice, where she symbolizes compassion, hope, and the profound dignity of human life.",
    "patronage": "All humanity, mothers, women, sailors, and many nations and cities worldwide",
    "canonizationYear": null,
    "imageUrl": "/images/saint_mary.jpeg"
  },
  {
    "name": "Our Lady of Lourdes",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--02-11",
    "biography": "Our Lady of Lourdes refers to the Marian apparitions reported by Saint Bernadette Soubirous in 1858 in Lourdes, France. Mary appeared to Bernadette as a young woman dressed in white with a blue sash, inviting prayers and penance. The site of the apparitions quickly became a place of pilgrimage, known for miraculous healings and spiritual renewal. Our Lady of Lourdes symbolizes hope, healing, and the compassion of Mary as a mother who intercedes for those suffering. The feast day celebrates these events and honors Mary’s message of faith and trust in God.",
    "patronage": "Lourdes, sickness, healing, pilgrims, the sick",
    "canonizationYear": null,
    "imageUrl": "/images/lady_of_lourdes.jpg"
  },
  {
    "name": "Our Lady of Fatima",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--05-13",
    "biography": "Our Lady of Fatima is based on a series of Marian apparitions reported by three shepherd children in Fatima, Portugal, in 1917. Mary appeared to Lucia, Francisco, and Jacinta, delivering messages urging prayer, repentance, and devotion to the Immaculate Heart. The apparitions included prophetic visions and calls for world peace. Our Lady of Fatima is a powerful symbol of hope, conversion, and the importance of prayer, especially the Rosary. The feast day commemorates these appearances and Mary’s call for peace and faithfulness.",
    "patronage": "Peace, the sick, pilgrims, the Catholic Church",
    "canonizationYear": null,
    "imageUrl": "/images/lady_of_fatima.jpg"
  },
  {
    "name": "Our Lady of Guadalupe",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--12-12",
    "biography": "Our Lady of Guadalupe refers to the Marian apparition to Saint Juan Diego in 1531 on the hill of Tepeyac near Mexico City. Mary appeared as a young indigenous woman and left an image miraculously imprinted on Juan Diego’s tilma. She is a powerful symbol of cultural identity, faith, and compassion for the marginalized. Our Lady of Guadalupe is venerated as the Patroness of the Americas and a unifying figure for diverse peoples. Her feast day celebrates this profound event and her enduring presence as a mother to millions.",
    "patronage": "The Americas, indigenous peoples, Mexico, mothers, unborn children",
    "canonizationYear": null,
    "imageUrl": "/images/our_lady_of_guadalupe.jpg"
  },
  {
    "name": "The Assumption of Mary",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--08-15",
    "biography": "The Assumption of Mary is the belief that at the end of her earthly life, Mary was taken body and soul into heavenly glory. This dogma was solemnly defined by Pope Pius XII in 1950 and reflects the Church’s honor for Mary as the Mother of God and her unique role in salvation history. The feast celebrates Mary’s entry into eternal life and her ongoing intercession for the faithful. It is a major solemnity in the Catholic Church and is celebrated with great reverence worldwide.",
    "patronage": "The sick, happy death, the Christian faithful",
    "canonizationYear": null,
    "imageUrl": "/images/assumption_of_mary.jpg"
  },
  {
    "name": "The Immaculate Conception",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--12-08",
    "biography": "The Immaculate Conception is the doctrine that Mary was conceived without original sin, preparing her to be a pure vessel for the birth of Jesus Christ. This dogma was officially proclaimed by Pope Pius IX in 1854 and highlights Mary’s unique holiness and grace from the very beginning of her life. The feast celebrates her purity and special role in God’s plan of salvation, inspiring the faithful to seek holiness and trust in God’s grace.",
    "patronage": "The United States, the Catholic Church, seafarers, and purity",
    "canonizationYear": null,
    "imageUrl": "/images/immaculate_conception.jpg"
  },
  {
    "name": "Saint Bernadette",
    "birthYear": 1844,
    "deathYear": 1879,
    "feastDay": "--02-18",
    "biography": "Saint Bernadette Soubirous was born into a poor family in Lourdes, France, and experienced a life marked by hardship and humility. At the age of 14, Bernadette began experiencing a series of Marian apparitions at the Grotto of Massabielle in 1858. Over the course of eighteen visions, the Virgin Mary appeared to her, identifying herself as the Immaculate Conception and urging repentance and prayer. These apparitions were initially met with skepticism, but Bernadette’s unwavering sincerity and humility won the trust of the local church authorities and the faithful.\n\nDuring the apparitions, Mary instructed Bernadette to dig in the ground, revealing a spring of water that soon became renowned for its miraculous healing properties, attracting pilgrims from around the world. Bernadette herself never sought personal fame; she entered the Sisters of Charity at Nevers and lived a life of quiet service and illness, often suffering from tuberculosis. Her deep humility, acceptance of suffering, and devotion to prayer exemplified Christian virtues.\n\nCanonized in 1933 by Pope Pius XI, Saint Bernadette remains a symbol of faith, simplicity, and perseverance. Lourdes today is one of the most important pilgrimage sites globally, a testament to her profound impact on Catholic spirituality. She is invoked particularly by those who are ill or marginalized, embodying the message of hope and healing that underlies her visions. Her life teaches that holiness can be found in ordinary circumstances through faithfulness and trust in God.",
    "patronage": "Lourdes, shepherds, bodily illness, and the poor",
    "canonizationYear": 1933,
    "imageUrl": "/images/saint_bernadette.jpg"
  },
  {
    "name": "Saint Dominic",
    "birthYear": 1170,
    "deathYear": 1221,
    "feastDay": "--08-08",
    "biography": "Saint Dominic (Dominic de Guzmán) was a Spanish priest and founder of the Order of Preachers, more commonly known as the Dominicans. Born in Caleruega, Spain, in 1170, he was educated in theology and became a canon regular. Deeply moved by the spiritual needs of the Church and the widespread presence of heresies in southern France, Dominic committed himself to preaching orthodox doctrine and living a life of poverty and humility.\n\nHe founded the Dominican Order in 1216 with the mission of promoting truth through study, teaching, and preaching. Unlike monastic communities, the Dominicans were a mendicant order, moving among the people rather than remaining cloistered. Dominic emphasized intellectual formation, which led the Dominicans to become leading theologians and scholars, many serving in universities and papal courts.\n\nSaint Dominic was known for his fervent prayer life, devotion to the Virgin Mary, and compassionate heart. Tradition attributes to him the promotion of the Rosary as a powerful form of meditative prayer. He died in 1221 and was canonized in 1234 by Pope Gregory IX. His legacy endures through the Dominicans’ ongoing contributions to education, theology, and missionary work.",
    "patronage": "Astronomers, natural sciences, Dominican Republic, Santo Domingo",
    "canonizationYear": 1234,
    "imageUrl": "/images/saint_dominic.jpg"
  },
  {
    "name": "Saint Benedict of Nursia",
    "birthYear": 480,
    "deathYear": 547,
    "feastDay": "--07-11",
    "biography": "Saint Benedict of Nursia is widely regarded as the father of Western monasticism. Born around 480 AD in Nursia, Italy, during a time of great social and political upheaval, he sought a life of solitude and spiritual discipline. He first lived as a hermit in a cave near Subiaco, attracting followers drawn to his example of prayer and asceticism.\n\nBenedict eventually founded a monastic community at Monte Cassino, where he composed his famous 'Rule of Saint Benedict.' This guide for monastic life emphasized balance, prayer, work ('ora et labora'), humility, obedience, and community. The Rule became a foundational text for Western monastic communities and influenced Christian spiritual formation for centuries.\n\nSaint Benedict's vision of a disciplined, prayerful life rooted in communal living offered stability and spiritual nourishment in a fragmented world. His monasteries became centers of learning, agriculture, hospitality, and evangelization. He died in 547 and was later named the patron saint of Europe by Pope Paul VI.\n\nToday, the Benedictine motto “Peace” and his enduring Rule continue to guide monks, nuns, and laypeople alike in the pursuit of holiness through ordered daily living.",
    "patronage": "Europe, monasticism, against poison",
    "canonizationYear": null,
    "imageUrl": "/images/saint_benedict.jpg"
  },
  {
    "name": "Saint Luke the Evangelist",
    "birthYear": null,
    "deathYear": 100,
    "feastDay": "--10-18",
    "biography": "Saint Luke the Evangelist is one of the four Gospel writers and the author of both the Gospel of Luke and the Acts of the Apostles in the New Testament. Thought to have been born in Antioch (modern-day Syria) in the 1st century, Luke was a physician by profession and a Gentile by birth, making him unique among the Evangelists.\n\nLuke is traditionally believed to have been a companion of Saint Paul on his missionary journeys, as indicated in the Pauline letters. His Gospel is notable for its detailed narrative of Christ’s infancy, its emphasis on mercy, compassion, and the inclusion of the marginalized, especially women and the poor. The Gospel of Luke also highlights the role of the Holy Spirit and presents a universal vision of salvation.\n\nThe Acts of the Apostles, also attributed to Luke, provides the earliest history of the Christian Church, chronicling the spread of the Gospel after Jesus' resurrection. Saint Luke is also regarded as the patron saint of artists and iconographers, as early tradition claims he painted portraits of the Virgin Mary.\n\nHe is believed to have died a martyr's death, although historical details are uncertain. Saint Luke’s legacy lives on through his writings, which offer a vivid and compassionate portrait of Jesus Christ and the early Church.",
    "patronage": "Physicians, artists, notaries, brewers, butchers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_luke.jpg"
  },
  {
    "name": "Saint John Bosco",
    "birthYear": 1815,
    "deathYear": 1888,
    "feastDay": "--01-31",
    "biography": "Saint John Bosco, affectionately known as Don Bosco, was an Italian priest, educator, and founder of the Salesian Order. Born in a poor rural family, he overcame hardship to become a priest deeply committed to the spiritual and practical welfare of young people. In 19th-century Turin, he witnessed the struggles of abandoned and neglected youth and responded by creating homes and schools where they could receive education, learn trades, and grow in their faith.\n\nDon Bosco believed in the power of kindness and reason over punishment, developing what became known as the 'preventive system' of education, which emphasized love, presence, and encouragement. He used storytelling, games, and even magic tricks to reach children, teaching them that holiness could be found in everyday life. His founding of the Salesians and later the Salesian Sisters helped carry this mission across the globe. He died in 1888, leaving behind a legacy of love, innovation, and faithful service.",
    "patronage": "Youth, apprentices, editors, publishers, magicians, juvenile delinquents",
    "canonizationYear": 1934,
    "imageUrl": "/images/saint_john_bosco.jpg"
  },
  {
    "name": "Saint Matthew",
    "birthYear": 1,
    "deathYear": 74,
    "feastDay": "--09-21",
    "biography": "Saint Matthew, also known as Levi, was a tax collector before he answered the call of Jesus to become one of the Twelve Apostles. Though tax collectors were generally despised by Jewish society, Matthew left his profession to follow Christ and witness His ministry. His transformation from public sinner to apostle is a powerful testimony of redemption and grace.\n\nHe is traditionally recognized as the author of the first Gospel, written to show Jesus as the fulfillment of Old Testament prophecy. After Christ’s resurrection, Matthew is believed to have preached the Gospel in distant lands, possibly including Ethiopia or Persia. Though the details of his martyrdom are uncertain, he is honored as a faithful witness to Christ. His life is a reminder that no one is beyond God’s call to holiness.",
    "patronage": "Accountants, bankers, tax collectors, civil servants, perfumers, Salerno, Italy",
    "canonizationYear": null,
    "imageUrl": "/images/saint_matthew.jpg"
  },
  {
    "name": "Saint John the Apostle",
    "birthYear": 6,
    "deathYear": 100,
    "feastDay": "--12-27",
    "biography": "Saint John the Apostle, the son of Zebedee and the brother of James, was one of Jesus’ closest companions and part of His inner circle. Often referred to as 'the beloved disciple,' John witnessed many pivotal moments in Christ’s life, including the Transfiguration, the Last Supper, and the Crucifixion, where he stood at the foot of the Cross with the Virgin Mary.\n\nJohn is traditionally credited with writing the Gospel that bears his name, which emphasizes the divinity of Christ and the depth of divine love. He is also associated with three epistles and the Book of Revelation, reflecting a deep theological insight and mystical vision. Unlike the other apostles, John is believed to have died of natural causes after a long life, making him a symbol of enduring faith and love. His teachings continue to inspire Christians to live lives rooted in truth and charity.",
    "patronage": "Love, loyalty, friendships, authors, booksellers, editors, publishers, scholars, theologians, poison-victims, art-dealers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_john.jpg"
  },
  {
    "name": "Saint Thomas the Apostle",
    "birthYear": null,
    "deathYear": 72,
    "feastDay": "--07-03",
    "biography": "Saint Thomas, one of the twelve apostles of Jesus, is famously known as \"Doubting Thomas\" because of his initial skepticism regarding the Resurrection. However, his doubt turned to profound faith when he personally touched the wounds of the risen Christ and proclaimed Jesus as his Lord and God. After Pentecost, Thomas embarked on missionary journeys, traditionally believed to have traveled as far as India, where he established Christian communities and was martyred around 72 AD. His legacy continues through the Christian faith in India and beyond, symbolizing a journey from doubt to belief and the courage to spread the Gospel.",
    "patronage": "Architects, builders, India, Sri Lanka, those struggling with doubt",
    "canonizationYear": null,
    "imageUrl": "/images/saint_thomas.jpg"
  },
  {
    "name": "Saints Perpetua and Felicity",
    "birthYear": null,
    "deathYear": 203,
    "feastDay": "--03-07",
    "biography": "Saint Perpetua, a young noblewoman, and Felicity, her pregnant slave companion, were early Christian martyrs who died in Carthage during Roman persecutions around 203 AD. Despite imprisonment and trials, they refused to renounce their faith. Perpetua kept a diary during her imprisonment, providing a vivid account of their courage and spiritual strength. Felicity gave birth while in prison and faced martyrdom alongside Perpetua in the arena. Their steadfast faith and courage under persecution have made them enduring examples of devotion, particularly inspiring to mothers and those facing adversity.",
    "patronage": "Mothers, expectant mothers, Carthage",
    "canonizationYear": null,
    "imageUrl": "/images/saint_perpetua_felicity.jpg"
  },
  {
    "name": "Saint Catherine of Bologna",
    "birthYear": 1413,
    "deathYear": 1463,
    "feastDay": "--03-09",
    "biography": "Saint Catherine of Bologna was a 15th-century Italian Poor Clare nun known for her deep spirituality, humility, and artistic talents. She devoted her life to prayer, charity, and creating religious art, including illuminated manuscripts and devotional paintings. Catherine founded a convent in Bologna dedicated to strict observance and compassionate ministry. She wrote extensively on mystical theology and the contemplative life. Renowned for her holiness and miracles, she was canonized for her life of dedication and creative devotion. Her legacy continues to inspire artists and religious communities worldwide.",
    "patronage": "Artists, miniaturists, those resisting temptation",
    "canonizationYear": 1712,
    "imageUrl": "/images/saint_catherine_bologna.jpg"
  },
  {
    "name": "Saint Martha",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--07-29",
    "biography": "Saint Martha is best known as a devoted follower of Jesus Christ and the sister of Mary and Lazarus. She appears in the New Testament as a figure who balances active service with faith. Martha welcomed Jesus into her home and is remembered for her practical care and hospitality. In one of the Gospel accounts, she is contrasted with her sister Mary, who chose to listen to Jesus’ teachings, highlighting the importance of combining action with spiritual attentiveness. Saint Martha is honored for her example of service, faithfulness, and dedication to the needs of others.",
    "patronage": "Cooks, homemakers, servants, hospitality workers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_martha.jpg"
  },
  {
    "name": "Saint James the Greater",
    "birthYear": null,
    "deathYear": 44,
    "feastDay": "--07-25",
    "biography": "Saint James the Greater was one of Jesus’ twelve apostles and the brother of John the Evangelist. He was part of Jesus’ inner circle, witnessing significant moments such as the Transfiguration and the Agony in the Garden. After the Resurrection, James is believed to have traveled to preach the Gospel, with tradition placing him in Spain. He was one of the first apostles to be martyred, executed by King Herod Agrippa I around 44 AD. Saint James is closely associated with pilgrimage, especially the famous Camino de Santiago, reflecting his role as a spiritual guide and protector of travelers.",
    "patronage": "Pilgrims, Spain, laborers, surgeons",
    "canonizationYear": null,
    "imageUrl": "/images/james_greater.jpg"
  },
  {
    "name": "Saint Jerome",
    "birthYear": 347,
    "deathYear": 420,
    "feastDay": "--09-30",
    "biography": "Saint Jerome was a prominent Christian scholar and priest known chiefly for his translation of the Bible into Latin, called the Vulgate. Born in the Roman province of Dalmatia, Jerome devoted much of his life to study, asceticism, and writing. He lived as a hermit for some years, seeking spiritual discipline and deepening his understanding of scripture. Jerome’s scholarly work made the scriptures more accessible to the Western Church and has had a lasting impact on Christian theology and biblical studies. He is often portrayed with a lion, referring to a popular legend about his compassionate care for an injured lion during his hermitage.",
    "patronage": "Librarians, translators, scholars, students, archaeologists",
    "canonizationYear": null,
    "imageUrl": "/images/saint_jerome.jpg"
  },
  {
    "name": "Saint Barbara",
    "birthYear": null,
    "deathYear": 290,
    "feastDay": "--12-04",
    "biography": "Saint Barbara is believed to have been a young Christian woman living during the Roman Empire, whose story, though largely legendary, highlights steadfast faith in the face of persecution. According to tradition, she was confined to a tower by her pagan father to protect her from the outside world. During her imprisonment, Barbara converted to Christianity, embracing the faith despite the risks involved. Upon learning of her faith, her father handed her over to Roman authorities, and she was tortured and eventually beheaded by her own father. Afterward, he was struck by lightning and killed, which led to Barbara becoming a symbol of protection against sudden death and natural disasters such as lightning and fire. She became a beloved saint among those working with explosives and artillery, especially miners and soldiers.",
    "patronage": "Artillerymen, miners, architects, and others who work with explosives",
    "canonizationYear": null,
    "imageUrl": "/images/saint_barbara.jpg"
  },
  {
    "name": "Saint Helena",
    "birthYear": 246,
    "deathYear": 330,
    "feastDay": "--08-18",
    "biography": "Saint Helena, mother of the Roman Emperor Constantine the Great, is credited with significant contributions to early Christianity through her devout faith and charitable works. Born in humble origins, she later married Constantius Chlorus, and after his death, her son Constantine rose to power, becoming the first Christian Roman Emperor. Helena herself converted to Christianity and embarked on a pilgrimage to the Holy Land, where she is traditionally said to have discovered the True Cross—the cross upon which Jesus was crucified. She ordered the construction of churches at significant Christian sites, including the Church of the Nativity in Bethlehem and the Church of the Holy Sepulchre in Jerusalem. Saint Helena's legacy is remembered for fostering Christianity within the Roman Empire and her influence on Christian architecture and relic preservation.",
    "patronage": "Empresses, converts, archaeologists, and difficult marriages",
    "canonizationYear": null,
    "imageUrl": "/images/saint_helena.jpg"
  },
  {
    "name": "Saint Bridget of Sweden",
    "birthYear": 1303,
    "deathYear": 1373,
    "feastDay": "--07-23",
    "biography": "Saint Bridget of Sweden was a mystic, visionary, and founder of the Bridgettine Order, one of the first monastic orders for women. Born into Swedish nobility, Bridget was married and had children before dedicating herself fully to religious life after the death of her husband. Known for her profound spiritual visions and prophecies, Bridget undertook pilgrimages to Rome and the Holy Land, advocating for Church reform and peace in Europe. She also dictated a series of revelations called the 'Revelations of St. Bridget,' which had a lasting influence on Christian spirituality. Canonized in 1391, she was later named one of the six patron saints of Europe by Pope John Paul II in 1999. Her legacy includes both her spiritual writings and the Bridgettine monastic community she founded, which endures to this day.",
    "patronage": "Sweden, Europe, widows, childbirth, and against famine",
    "canonizationYear": 1391,
    "imageUrl": "/images/saint_brigitte.jpg"
  },
  {
    "name": "Saint Anne",
    "birthYear": null,
    "deathYear": 4,
    "feastDay": "--07-26",
    "biography": "Saint Anne is traditionally recognized as the mother of the Virgin Mary and grandmother of Jesus Christ. While she does not appear in the canonical texts of the Bible, her story is told in apocryphal writings such as the Protoevangelium of James. According to tradition, Anne and her husband Joachim were childless for many years before Mary’s miraculous conception. She is revered as a model of motherhood, faith, and patience, especially by women hoping for children. Throughout history, Saint Anne has been a popular figure in Christian art and devotion. Many churches and chapels bear her name, and her veneration is particularly strong among Catholics and Orthodox Christians, who honor her as a powerful intercessor and protector of families.",
    "patronage": "Mothers, women in labor, miners, and cabinetmakers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_anne.jpg"
  },
  {
    "name": "Saint Lawrence",
    "birthYear": 225,
    "deathYear": 258,
    "feastDay": "--08-10",
    "biography": "Saint Lawrence was a deacon of the early Christian Church in Rome, renowned for his charitable work and his courageous martyrdom. During the persecution under Emperor Valerian, Lawrence was tasked with distributing the Church's wealth to the poor and needy. When ordered by Roman authorities to surrender the treasures of the Church, he presented the poor and sick as the true treasures of the Church, famously declaring, 'Here are the treasures of the Church.' For this act of defiance, he was sentenced to death by being roasted alive on a gridiron. His wit and faith during his torture inspired many, and he became one of the most venerated martyrs of the early Church. Saint Lawrence is often depicted holding a gridiron and is the patron saint of cooks, librarians, and comedians.",
    "patronage": "Archivists, librarians, cooks, comedians, and the poor",
    "canonizationYear": null,
    "imageUrl": "/images/saint_lawrence.jpg"
  },
  {
    "name": "Saint James the Lesser",
    "birthYear": null,
    "deathYear": 62,
    "feastDay": "--05-03",
    "biography": "Saint James the Lesser, also called James the Just, was one of the twelve apostles of Jesus and is traditionally identified as the first bishop of Jerusalem. He is often distinguished from James the Greater by his epithet 'the Lesser,' possibly due to his younger age or stature. Known for his strict adherence to Jewish law, James played a key role in the early Church's debates about the relationship between Jewish customs and the Christian faith. He presided over the Council of Jerusalem, which decided that Gentile converts did not need to fully observe Mosaic Law. According to tradition, James was martyred by being thrown from the pinnacle of the Temple and then beaten to death. His wisdom and leadership earned him the title 'the Just,' and he is venerated especially in the Eastern Orthodox and Catholic traditions.",
    "patronage": "Pharmacists, dying people, and Jews",
    "canonizationYear": null,
    "imageUrl": "/images/saint_james_lesser.jpg"
  },
  {
    "name": "Saint Athanasius",
    "birthYear": 296,
    "deathYear": 373,
    "feastDay": "--05-02",
    "biography": "Saint Athanasius was the Bishop of Alexandria and one of the most important Church Fathers, remembered chiefly for his defense of Trinitarian Christianity against the heresy of Arianism, which denied the divinity of Christ. His theological works, including the seminal 'On the Incarnation,' laid the foundation for orthodox Christian doctrine. Athanasius faced multiple exiles due to his steadfast opposition to Arianism but remained a central figure in shaping Christian thought during the 4th century. He was instrumental in the development of the Nicene Creed and is revered as a Doctor of the Church. His writings and leadership were crucial in affirming the doctrine of the Trinity and the full divinity of Jesus Christ.",
    "patronage": "Theologians and against desecration of the Eucharist",
    "canonizationYear": null,
    "imageUrl": "/images/saint_athanasius.jpg"
  },
  {
    "name": "Saint Longinus",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--10-16",
    "biography": "Saint Longinus is traditionally identified as the Roman centurion who pierced the side of Jesus with a spear during the crucifixion. According to Christian tradition, Longinus was blind or had impaired vision and was healed at the moment Christ’s blood touched him, leading to his conversion to Christianity. He later became a martyr for the faith, though details of his life and death vary by tradition. Longinus symbolizes the transformation from skeptic to believer and serves as a reminder of the power of faith and redemption. He is often depicted in art holding the Holy Lance (or Spear of Destiny) and is venerated in both Eastern Orthodox and Western Christian churches.",
    "patronage": "Blind people, soldiers, and lance-men",
    "canonizationYear": null,
    "imageUrl": "/images/saint_longinus.jpg"
  },
  {
    "name": "Saint Bonaventure",
    "birthYear": 1221,
    "deathYear": 1274,
    "feastDay": "--07-15",
    "biography": "Saint Bonaventure was an Italian Franciscan friar, theologian, and philosopher known as the 'Seraphic Doctor' for his deep spirituality and scholarly work. He studied and taught at the University of Paris, where he combined Aristotelian philosophy with Christian theology. Bonaventure became the Minister General of the Franciscan Order, guiding it through difficult times while emphasizing poverty and humility. His major works include the 'Journey of the Mind to God,' an influential mystical treatise. He played a key role in the intellectual life of the Church during the 13th century and was canonized in 1482 by Pope Sixtus IV. He remains a Doctor of the Church and a model for integrating faith and reason.",
    "patronage": "Theologians and philosophers",
    "canonizationYear": 1482,
    "imageUrl": "/images/saint_bonaventure.jpg"
  },
  {
    "name": "Saint Bartholomew",
    "birthYear": null,
    "deathYear": 69,
    "feastDay": "--08-24",
    "biography": "Saint Bartholomew, also traditionally identified with Nathanael, was one of the Twelve Apostles of Jesus Christ. He appears in the apostolic lists in the Synoptic Gospels and is associated with Nathanael in the Gospel of John, introduced to Jesus by Philip. Tradition holds that Bartholomew carried the Gospel to regions such as India, Mesopotamia, Armenia, and possibly Ethiopia, preaching boldly and winning converts. Ultimately, he met a brutal martyrdom—often described as being flayed alive and then beheaded—during his mission in Armenia. His unwavering faith, missionary zeal, and dramatic martyrdom made him a revered figure in the early Church and among the faithful.",
    "patronage": "Armenia, leatherworkers, tanners, butchers, plasterers, bookbinders, shoemakers, neurological and skin diseases, salt merchants, and others",
    "canonizationYear": null,
    "imageUrl": "/images/saint_bartholomew.jpg"
  },
  {
    "name": "Saint Matthias",
    "birthYear": null,
    "deathYear": 80,
    "feastDay": "--05-14",
    "biography": "Saint Matthias was chosen by lot to replace Judas Iscariot as one of the Twelve Apostles after Jesus’ Ascension. He had been a follower of Jesus from the time of His baptism through to His Ascension, qualifying him for this unique apostolic appointment. Historical and apocryphal traditions place him preaching the Gospel in Judea, Cappadocia, and Colchis (modern-day Georgia), where he is said to have suffered martyrdom—either by beheading following stoning or crucifixion. Despite the sparse details, Matthias’s faithful witness and his selection by the early Christian community demonstrate his steadfastness and fidelity to Christ’s mission.",
    "patronage": "Carpenters, tailors, those suffering from alcoholism, smallpox sufferers, the Diocese of Gary (Indiana), the Diocese of Great Falls‑Billings (Montana), hope, perseverance",
    "canonizationYear": null,
    "imageUrl": "/images/saint_matthias.jpg"
  },
  {
    "name": "Saint John Henry Newman",
    "birthYear": 1801,
    "deathYear": 1890,
    "feastDay": "--10-09",
    "biography": "Saint John Henry Newman was born on February 21, 1801, in London, England. Originally an Anglican priest and a leading figure in the Oxford Movement, he sought to revive the Catholic elements within Anglicanism. Through extensive theological study and personal reflection, he converted to Catholicism in 1845, a move that caused controversy and admiration alike. Newman was later ordained a Catholic priest and founded the Oratory of Saint Philip Neri in Birmingham.\n\nAn influential thinker, preacher, and writer, Newman emphasized the development of doctrine, the role of conscience, and the importance of a well-formed laity. His major works include 'Apologia Pro Vita Sua' and 'The Idea of a University.' In 1879, he was made a cardinal by Pope Leo XIII. Newman died on August 11, 1890, in Birmingham. He was canonized in 2019 by Pope Francis and is widely regarded as one of the most important Catholic intellectuals of the 19th century.",
    "patronage": "Seekers of truth, educators, converts",
    "canonizationYear": 2019,
    "imageUrl": "/images/saint_newman.jpg"
  },
  {
    "name": "Saint Agatha",
    "birthYear": 231,
    "deathYear": 251,
    "feastDay": "--02-05",
    "biography": "Saint Agatha was a young Christian woman from Catania, Sicily, who lived during the mid‑3rd century. Known for her beauty and piety, she made a vow of chastity and refused the advances of a Roman official, Decius or Quintianus. He subjected her to horrific torture—including the mutilation of her breasts—but she remained steadfast in her faith. Agatha is particularly invoked for protection against fire, volcanic eruptions (notably Mount Etna), breast cancer, and sexual assault. Her courage and purity have made her an enduring symbol of strength in adversity and protector of those suffering from illness or assault.",
    "patronage": "Breast cancer patients, rape survivors, nurses, Catania, Sicily, volcanic eruptions, fire, wet nurses",
    "canonizationYear": null,
    "imageUrl": "/images/saint_agatha.jpg"
  },
  {
    "name": "Saint Maximilian Kolbe",
    "birthYear": 1894,
    "deathYear": 1941,
    "feastDay": "--08-14",
    "biography": "Saint Maximilian Maria Kolbe was a Polish Conventual Franciscan friar and priest born in 1894. He founded the Militia Immaculatae movement and published a significant religious periodical promoting devotion to the Virgin Mary. During World War II, he was imprisoned at Auschwitz for harboring refugees and members of the resistance. In July 1941, when a prisoner escaped, Kolbe volunteered to die in the place of a condemned man selected for starvation, demonstrating extraordinary sacrifice and love. He perished on August 14 after being injected with carbolic acid. Beatified in 1971 and canonized in 1982, Maximilian Kolbe is honored as a martyr of charity and is a potent symbol of selfless compassion.",
    "patronage": "Drug addicts, prisoners, families, journalists, the pro‑life movement, survivors of concentration camps",
    "canonizationYear": 1982,
    "imageUrl": "/images/saint_kolbe.jpg"
  },
  {
    "name": "Saint Teresa of Calcutta",
    "birthYear": 1910,
    "deathYear": 1997,
    "feastDay": "--09-05",
    "biography": "Born Anjezë Gonxhe Bojaxhiu on August 26, 1910, in Skopje (then Ottoman Empire), she moved to India as a young nun and founded the Missionaries of Charity, serving the poorest of the poor in Kolkata and beyond. Her compassion and humility made her a global symbol of charity and human dignity. She received the Nobel Peace Prize in 1979 and continued her work until her death on September 5, 1997. Canonized on September 4, 2016, by Pope Francis, her feast is celebrated each year on September 5. She remains one of the most beloved modern saints of the Catholic Church.",
    "patronage": "World Youth Day, Missionaries of Charity, Archdiocese of Calcutta",
    "canonizationYear": 2016,
    "imageUrl": "/images/saint_mother_theresa.jpg"
  },
  {
    "name": "Saint Michael the Archangel",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--09-29",
    "biography": "Saint Michael the Archangel is revered as the leader of heaven’s armies in the cosmic struggle against evil. Mentioned in the Book of Daniel and Revelation, he is seen as a defender of God’s people and protector of the Church. Christians honor him for his role in guarding the faithful, aiding souls at the hour of death, and administering divine justice. His feast day, known as Michaelmas, is celebrated on September 29 in many Christian traditions.",
    "patronage": "Military, police, bankers, grocers, the Church, dying people, poor souls",
    "canonizationYear": null,
    "imageUrl": "/images/archangel_michael.jpg"
  },
  {
    "name": "Saint Raphael the Archangel",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--09-29",
    "biography": "Saint Raphael the Archangel first appears in the Book of Tobit, guiding the young Tobias and healing his father’s blindness. Associated with divine healing and protection, Raphael is venerated as a guardian of travelers, the young, and those seeking healing or guidance. Christian tradition honors him alongside Michael and Gabriel on September 29, the shared feast of the archangels.",
    "patronage": "Travelers, young people, the sick, nurses, shepherds, pharmacists, healing, finding one's spouse",
    "canonizationYear": null,
    "imageUrl": "/images/archangel_raphael.jpg"
  },
  {
    "name": "Saint Elizabeth of Hungary",
    "birthYear": 1207,
    "deathYear": 1231,
    "feastDay": "--11-17",
    "biography": "Saint Elizabeth of Hungary was born in 1207 and widowed young. After her husband’s death, she renounced her wealth to care for the poor and sick. She founded a hospital at Marburg, personally serving the needy. Her deep charity endeared her to commoners and royalty alike. Despite dying at 24, she was canonized within four years in 1235 and remains a powerful symbol of Christian compassion.",
    "patronage": "Hospitals, nurses, widows, brides, bakers, homeless people, exiles, dying children, falsely accused people, lace‑makers, Teutonic Order, Third Order of St. Francis",
    "canonizationYear": 1235,
    "imageUrl": "/images/saint_elizabeth_hungary.jpg"
  },
  {
    "name": "Saint Gabriel the Archangel",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--09-29",
    "biography": "Saint Gabriel the Archangel is known in Christian tradition as God’s messenger, appearing in the Book of Daniel and most famously delivering the Annunciation to the Virgin Mary. His role highlights divine communication and revelation. Gabriel is deeply revered across Christian denominations as one who brings clarity, guidance, and hope, especially at pivotal moments of salvation history.",
    "patronage": "Messengers, communication workers, postal and telecommunications workers",
    "canonizationYear": null,
    "imageUrl": "/images/archangel_gabriel.jpg"
  },
  {
    "name": "Saint Mary Magdalene",
    "birthYear": 8,
    "deathYear": null,
    "feastDay": "--07-22",
    "biography": "Saint Mary Magdalene is one of the most significant female figures in the Gospels. Healed by Jesus, she became a devoted follower, remained present at the Crucifixion, and was the first witness to the Resurrection. Honored as the 'Apostle to the Apostles,' her life has been the subject of changing interpretations over the centuries, but her role as a faithful disciple remains central in Christian tradition.",
    "patronage": "Penitents, women, converts, contemplative life",
    "canonizationYear": null,
    "imageUrl": "/images/saint_mary_magdalene.jpg"
  },
  {
    "name": "Saint Brigid of Ireland",
    "birthYear": 451,
    "deathYear": 525,
    "feastDay": "--02-01",
    "biography": "Saint Brigid of Ireland is one of the country's patron saints, celebrated for founding several monasteries, including the famous Kildare Abbey. Born into a noble family, Brigid chose a religious life and was renowned for her generosity and miracles. She was a bridge between pagan and Christian traditions in Ireland, promoting education, care for the poor, and peace. Her feast day marks the beginning of spring and is celebrated with many customs rooted in Irish culture.",
    "patronage": "Ireland, dairy workers, blacksmiths, poets",
    "canonizationYear": null,
    "imageUrl": "/images/saint_brigid.jpg"
  },
  {
    "name": "Saint Andrew the Apostle",
    "birthYear": 5,
    "deathYear": 60,
    "feastDay": "--11-30",
    "biography": "Saint Andrew, brother of Saint Peter, was one of Jesus Christ’s first disciples and is known as the 'First-Called.' A fisherman by trade, Andrew played a crucial role in spreading Christianity, preaching in regions around the Black Sea and Greece. He is believed to have been martyred by crucifixion on an X-shaped cross, now called Saint Andrew's Cross. Andrew is honored as the patron saint of Scotland, Russia, and Greece.",
    "patronage": "Scotland, Russia, fishermen, singers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_andrew.jpg"
  },
  {
    "name": "Saint George",
    "birthYear": 275,
    "deathYear": 303,
    "feastDay": "--04-23",
    "biography": "Saint George was a Roman soldier famed for his courage and martyrdom during the Diocletian persecution. According to legend, he slew a dragon to save a town and its princess, symbolizing the triumph of good over evil. George became one of the most venerated saints in Christianity and the patron saint of several countries, including England, Georgia, and Catalonia. His legacy inspires bravery and steadfast faith.",
    "patronage": "Soldiers, scouts, England, Georgia",
    "canonizationYear": null,
    "imageUrl": "/images/saint_george.jpg"
  },
  {
    "name": "Saint Stephen",
    "birthYear": 5,
    "deathYear": 34,
    "feastDay": "--12-26",
    "biography": "Saint Stephen is recognized as the first Christian martyr, known as the Protomartyr. He was a deacon in the early Church, appointed to help with the distribution of charity. His bold preaching led to his arrest and stoning, making him a powerful symbol of faith and sacrifice. Stephen's story is found in the Acts of the Apostles, and his feast day is celebrated the day after Christmas, honoring his unwavering commitment to Christ.",
    "patronage": "Deacons, stonemasons, headache sufferers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_stephen.jpg"
  },
  {
    "name": "Saint Leo the Great",
    "birthYear": 391,
    "deathYear": 461,
    "feastDay": "--11-10",
    "biography": "Saint Leo the Great was Pope from 440 to 461 and is remembered for his theological leadership and diplomatic skills. He played a critical role in defining the doctrine of the Incarnation and asserting the authority of the papacy. Leo famously persuaded Attila the Hun to spare Rome, showcasing his influence beyond spiritual matters. His writings and sermons helped shape the early Church, and he was declared a Doctor of the Church.",
    "patronage": "Popes, teachers, diplomats",
    "canonizationYear": null,
    "imageUrl": "/images/saint_leo_great.jpg"
  },
  {
    "name": "Saint John the Baptist",
    "birthYear": null,
    "deathYear": 30,
    "feastDay": "--06-24",
    "biography": "Saint John the Baptist was a prophetic figure who prepared the way for Jesus Christ through preaching repentance and baptizing followers in the Jordan River. He is recognized as a martyr who was imprisoned and beheaded by King Herod. John’s role as the forerunner of Christ makes him one of the most significant figures in Christian tradition, symbolizing purification and new beginnings.",
    "patronage": "Baptists, converts, journalists, tailors",
    "canonizationYear": null,
    "imageUrl": "/images/saint_john_baptist.jpg"
  },
  {
    "name": "Saint Margaret of Scotland",
    "birthYear": 1045,
    "deathYear": 1093,
    "feastDay": "--11-16",
    "biography": "Saint Margaret of Scotland (c. 1045–1093) was an English princess born in exile in Hungary. She was the daughter of Edward the Exile and granddaughter of King Edmund Ironside of England. After the Norman Conquest of England in 1066, Margaret fled with her family to Scotland, where she married King Malcolm III around 1070. As queen, Margaret became known for her deep piety, charity, and reformative influence on both the Scottish Church and royal court. She promoted religious observance, supported Benedictine monasticism, and worked to align Scottish practices more closely with Roman Catholicism. She was also dedicated to the poor, often serving them with her own hands, and is remembered for her humility and grace. Margaret bore eight children, including future kings Edgar, Alexander I, and David I, and played a key role in raising a devout and educated royal family. She died shortly after the death of her husband and eldest son in battle in 1093. Canonized in 1250 by Pope Innocent IV, she is honored as one of Scotland's greatest saints.",
    "patronage": "Scotland, widows, charity, education",
    "canonizationYear": 1250,
    "imageUrl": "/images/saint_margaret.jpg"
  },
  {
    "name": "Saint Juan Diego",
    "birthYear": 1474,
    "deathYear": 1548,
    "feastDay": "--12-09",
    "biography": "Saint Juan Diego Cuauhtlatoatzin was born in 1474 near present-day Mexico City, in what was then part of the Aztec Empire. A humble indigenous farmer and weaver, he converted to Christianity in his early 50s after the arrival of Franciscan missionaries. On December 9, 1531, the Virgin Mary appeared to him on Tepeyac Hill, identifying herself as Our Lady of Guadalupe. Over the course of several apparitions, she instructed Juan Diego to ask the bishop to build a shrine in her honor. To prove the authenticity of his vision, he presented his tilma (cloak), which miraculously bore her image—a relic still venerated today in the Basilica of Our Lady of Guadalupe. He lived the rest of his life in modest service and prayer. Juan Diego was canonized in 2002 by Pope John Paul II and became the first indigenous saint of the Americas.",
    "patronage": "Indigenous peoples of the Americas",
    "canonizationYear": 2002,
    "imageUrl": "/images/saint_juan_diego.jpg"
  },
  {
    "name": "Saint Ambrose",
    "birthYear": 339,
    "deathYear": 397,
    "feastDay": "--12-07",
    "biography": "Saint Ambrose was born around 340 AD in Trier (present-day Germany) into a Roman Christian family of high rank. Educated in law and rhetoric, he became governor of Milan. In 374, he was unexpectedly chosen as Bishop of Milan by popular acclaim, even before he was baptized. Ambrose quickly embraced his new role with zeal, becoming one of the most influential Church Fathers. A brilliant orator and theologian, he staunchly opposed Arianism, defended Church independence from imperial power, and was instrumental in the conversion of Saint Augustine, whom he baptized in 387. Ambrose was also a prolific writer of hymns, theological treatises, and letters that shaped Western Christianity. He died in 397 and was declared a Doctor of the Church. His feast is celebrated on December 7.",
    "patronage": "Milan, beekeepers, bishops, theologians",
    "canonizationYear": null,
    "imageUrl": "/images/saint_ambrose.jpg"
  },
  {
    "name": "Saint Mark the Evangelist",
    "birthYear": 7,
    "deathYear": 68,
    "feastDay": "--04-25",
    "biography": "Saint Mark the Evangelist is traditionally recognized as the author of the Gospel of Mark, one of the four canonical gospels in the New Testament. Though details of his life are limited, he is believed to have been a companion of the Apostle Peter, whose teachings influenced his gospel. Mark is also associated with the early Christian community in Alexandria, Egypt, where he is regarded as the founder and first bishop. His symbol, the winged lion, represents courage and monarchy. Celebrated for spreading the Christian faith in Egypt and North Africa, Saint Mark is considered the patron saint of Venice, where his relics are enshrined in the famous Basilica di San Marco. His feast day is celebrated on April 25.",
    "patronage": "Venice, notaries, lawyers, glaziers, scribes",
    "canonizationYear": null,
    "imageUrl": "/images/saint_mark.jpg"
  },
  {
    "name": "Saint Gregory the Great",
    "birthYear": 540,
    "deathYear": 604,
    "feastDay": "--09-03",
    "biography": "Saint Gregory the Great was born around 540 AD into a wealthy Roman family. He served as Prefect of Rome before choosing a monastic life, founding several monasteries, and dedicating himself to prayer and scholarship. In 590, he became pope during a time of political turmoil and famine. Gregory is renowned for reforming the Church’s liturgy, promoting missionary work (notably sending Augustine of Canterbury to evangelize England), and organizing the Church’s charitable efforts. He authored numerous theological works, including the 'Dialogues' and pastoral letters that deeply influenced medieval Christianity. Gregory is also credited with initiating the development of Gregorian Chant. Canonized as a saint and declared a Doctor of the Church, his feast day is celebrated on September 3.",
    "patronage": "Musicians, singers, students, teachers",
    "canonizationYear": 604,
    "imageUrl": "/images/saint_gregory_great.jpg"
  },
  {
    "name": "Saint Anastasia of Sirmium",
    "birthYear": 281,
    "deathYear": 304,
    "feastDay": "--12-25",
    "biography": "Saint Anastasia of Sirmium was a Christian martyr from the early 4th century, remembered for her courage and compassion during the Diocletian persecution. Believed to have been born into a noble Roman family, she devoted her life to helping imprisoned Christians and ministering to the sick. Arrested for her faith, she endured torture and was ultimately martyred around 304 AD in Sirmium (modern-day Serbia). Anastasia is venerated as a healer and protector against poison and evil spirits. Her feast day is celebrated on December 22 in the Western Church and on December 25 in the Eastern Orthodox Church.",
    "patronage": "Pharmacists, doctors, apothecaries, healers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_anastasia.jpg"
  },
  {
    "name": "Saint Cyprian",
    "birthYear": 210,
    "deathYear": 258,
    "feastDay": "--09-16",
    "biography": "Saint Cyprian was a bishop of Carthage and an early Christian writer who played a pivotal role in the Church during a time of intense persecution. Originally a pagan and a lawyer, he converted to Christianity in his thirties and was quickly appointed bishop in 249 AD. Cyprian emphasized Church unity, discipline, and the importance of pastoral care, guiding his community through the Decian persecution. His influential writings, such as 'On the Unity of the Church,' continue to impact Christian theology. Arrested and executed during the Valerian persecution in 258, he is remembered as a courageous leader and martyr. His feast day is celebrated on September 16.",
    "patronage": "North Africa, Berbers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_cyprian.jpg"
  },
  {
    "name": "Saint Ignatius of Loyola",
    "birthYear": 1491,
    "deathYear": 1556,
    "feastDay": "--07-31",
    "biography": "Saint Ignatius of Loyola was a Spanish nobleman and soldier whose dramatic conversion after a battlefield injury led him to found the Society of Jesus (Jesuits) in 1534. He devoted his life to spiritual discipline, education, and missionary work, emphasizing the importance of discernment and the Spiritual Exercises—a set of meditations and prayers designed to deepen one's relationship with God. Ignatius played a major role in the Counter-Reformation, influencing Catholic education and global missions. He died in Rome in 1556 and was canonized in 1622. His feast day is celebrated annually on July 31.",
    "patronage": "Society of Jesus, spiritual retreats, soldiers, Gipuzkoa, education",
    "canonizationYear": 1622,
    "imageUrl": "/images/saint_ignatius_loyola.jpg"
  },
  {
    "name": "Saint Martin of Tours",
    "birthYear": 316,
    "deathYear": 397,
    "feastDay": "--11-11",
    "biography": "Saint Martin of Tours was born in Pannonia (modern-day Hungary) around 316 AD. Initially serving as a soldier in the Roman army, Martin famously shared his cloak with a beggar during a cold winter, an act symbolizing his deep compassion and Christian charity. He soon left the military to become a Christian monk and was later appointed Bishop of Tours. Known for spreading Christianity throughout Gaul and founding monasteries, Martin’s leadership helped establish monasticism in Western Europe. He is revered for his humility, generosity, and missionary zeal. Martin died in 397 AD, and his feast day is celebrated on November 11.",
    "patronage": "Soldiers, France, conscientious objectors, beggars",
    "canonizationYear": null,
    "imageUrl": "/images/saint_martin_tours.jpg"
  },
  {
    "name": "Saint John Vianney",
    "birthYear": 1786,
    "deathYear": 1859,
    "feastDay": "--08-04",
    "biography": "Saint John Vianney, also known as the Curé of Ars, was born in 1786 in Dardilly, France. Despite difficulties in his early education, he became a devoted parish priest known for his humility, holiness, and deep commitment to the sacraments, especially confession. Serving a small rural parish in Ars, he transformed it into a spiritual center through his pastoral care and dedication. His austere lifestyle and devotion inspired many, and he is regarded as the patron saint of parish priests worldwide. He died in 1859 and was canonized in 1925. His feast day is celebrated every August 4.",
    "patronage": "Parish priests, confession, priests",
    "canonizationYear": 1925,
    "imageUrl": "/images/saint_john_vianney.jpg"
  },
  {
    "name": "Saint John of the Cross",
    "birthYear": 1542,
    "deathYear": 1591,
    "feastDay": "--12-14",
    "biography": "Saint John of the Cross was a Spanish mystic, poet, and Carmelite friar born in 1542. He played a crucial role in reforming the Carmelite order alongside Saint Teresa of Ávila, emphasizing a return to strict contemplative life. Known for his profound spiritual writings, including *Dark Night of the Soul*, he explored the soul’s journey toward God through purification and union. His poetry and theological works deeply influenced Christian mysticism. John was canonized in 1726 and declared a Doctor of the Church in 1926. His feast day is celebrated on December 14.",
    "patronage": "Mystics, contemplatives, Spanish poets",
    "canonizationYear": 1726,
    "imageUrl": "/images/saint_john_of_cross.jpg"
  },
  {
    "name": "Saint Isabel of France",
    "birthYear": 1225,
    "deathYear": 1270,
    "feastDay": "--02-26",
    "biography": "Saint Isabel of France, also known as Elizabeth of France, was born in 1225 as the daughter of King Louis VIII of France. She married King Louis IX (Saint Louis) and was known for her piety, charity, and dedication to the poor and sick. Isabel was deeply involved in the spiritual and charitable activities of the French court, founding hospitals and religious communities. After the death of her husband, she continued her devout life until her own death in 1270. Canonized in 1696, she is remembered for her humility, compassion, and commitment to justice. Her feast day is celebrated on February 4.",
    "patronage": "The sick, peace, brides, easing jealousy",
    "canonizationYear": 1696,
    "imageUrl": "/images/saint_isabel_france.jpg"
  },
  {
    "name": "Saint Louis IX",
    "birthYear": 1214,
    "deathYear": 1270,
    "feastDay": "--08-25",
    "biography": "Saint Louis IX was King of France from 1226 until his death in 1270. Renowned for his deep Christian faith and sense of justice, Louis implemented reforms that improved the legal system and protected the poor. He led the Seventh and Eighth Crusades in an effort to reclaim the Holy Land, though both campaigns ended unsuccessfully. Louis was also a patron of arts and education, founding institutions such as the University of Paris. He was canonized in 1297 by Pope Boniface VIII, becoming the only French king to be declared a saint. His feast day is celebrated on August 25.",
    "patronage": "France, kings, Christian monarchy, university students, prisoners",
    "canonizationYear": 1297,
    "imageUrl": "/images/saint_luis_ix.jpg"
  },
  {
    "name": "Saint Simon the Zealot",
    "birthYear": 5,
    "deathYear": 65,
    "feastDay": "--10-28",
    "biography": "Saint Simon the Zealot was one of the twelve apostles of Jesus Christ. Very little is definitively known about his life beyond his role as a disciple and witness to Jesus’ ministry. The title 'Zealot' may refer to his passionate zeal for the Jewish faith or a possible affiliation with the Zealot movement opposing Roman rule. Tradition holds that he preached the Gospel in various regions, including Egypt, Persia, and possibly Britain, often facing persecution. He is honored as a martyr, though details of his death are uncertain. His feast day is celebrated on October 28, often together with Saint Jude Thaddeus.",
    "patronage": "Curriers, sawyers, tanners",
    "canonizationYear": null,
    "imageUrl": "/images/saint_simon_zealot.jpg"
  },
  {
    "name": "Saint Charbel Makhlouf",
    "birthYear": 1828,
    "deathYear": 1898,
    "feastDay": "--07-24",
    "biography": "Saint Charbel Makhlouf was born Youssef Antoun Makhlouf in 1828 in Bekaa Kafra, Lebanon. He entered the Maronite monastic order at the Monastery of St. Maron in Annaya, taking the name Charbel. Known for his deep spirituality, asceticism, and humility, Charbel lived a life of solitude and prayer. Despite his quiet monastic life, he became renowned for miracles and healings attributed to his intercession both during and after his life. He died in 1898, and his sanctity was confirmed by numerous miracles. Canonized by Pope Paul VI in 1977, Saint Charbel is venerated especially in Lebanon and among Maronite Christians worldwide. His feast day is July 24.",
    "patronage": "Lebanon",
    "canonizationYear": 1977,
    "imageUrl": "/images/saint_charbel.jpg"
  },
  {
    "name": "Saints Cosmas and Damian",
    "birthYear": null,
    "deathYear": 303,
    "feastDay": "--09-26",
    "biography": "Cosmas and Damian were twin brothers and early Christian martyrs known for their work as physicians who provided healing without accepting payment, earning them the title \"Unmercenary Physicians.\" Living in the 3rd century in the Roman province of Syria, they were renowned for their compassion and miraculous healing powers, which included curing illnesses considered incurable. Their dedication to healing others while spreading the Christian faith made them popular saints throughout the Middle Ages and beyond. They were eventually arrested and martyred for their faith, but their legacy as patrons of medicine and doctors endures.",
    "patronage": "Physicians, surgeons, pharmacists, twins, and those suffering from illness",
    "canonizationYear": null,
    "imageUrl": "/images/saint_cosmas_damian.jpg"
  },
  {
    "name": "Saint Daniel",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--07-21",
    "biography": "Saint Daniel is best known as the Old Testament prophet who was taken captive to Babylon and served in the courts of Babylonian and Persian kings. His story is one of unwavering faith in God amidst exile and persecution. Daniel’s prophetic visions and his famous deliverance from the lions’ den demonstrate his steadfast trust in God’s protection. Celebrated for his wisdom and courage, Daniel symbolizes faithfulness and the power of prayer in difficult times.",
    "patronage": "Protection from danger, against demonic possession, and apocalyptic prophecy",
    "canonizationYear": null,
    "imageUrl": "/images/saint_daniel.jpg"
  },
  {
    "name": "Saint Dorothy",
    "birthYear": 285,
    "deathYear": 311,
    "feastDay": "--02-06",
    "biography": "Saint Dorothy was a young Christian martyr from the early 4th century, remembered for her faith and purity. According to tradition, she was executed during the persecutions of Christians under Emperor Diocletian. Before her death, she is said to have sent a miraculous bouquet of roses and fruits to a judge who mocked her faith, leading to his conversion. Dorothy is often depicted holding roses and a basket of fruits, symbolizing her heavenly reward and steadfastness in faith despite suffering.",
    "patronage": "Gardeners, florists, brides, and those seeking a happy marriage",
    "canonizationYear": null,
    "imageUrl": "/images/saint_dorothy.jpg"
  },
  {
    "name": "Saint Barnabas",
    "birthYear": null,
    "deathYear": 61,
    "feastDay": "--06-11",
    "biography": "Saint Barnabas was an early Christian apostle and missionary, often remembered as a close companion of Saint Paul. He played a key role in spreading Christianity among Gentiles and is credited with encouraging and supporting early Christian communities. Known for his generosity and encouragement, Barnabas helped introduce Paul to the apostles and traveled extensively on missionary journeys. His feast celebrates his dedication to spreading the Gospel and building unity among early Christians.",
    "patronage": "Cyprus, Cyprus missionaries, and the island’s Christian community",
    "canonizationYear": null,
    "imageUrl": "/images/saint_barnabas.jpg"
  },
  {
    "name": "Saint Camilla Battista da Varano",
    "birthYear": 1458,
    "deathYear": 1524,
    "feastDay": "--05-31",
    "biography": "Saint Camilla was a noblewoman turned Poor Clare nun and mystic in 15th-century Italy. Born into a ruling family, she chose a spiritual path despite expectations of a political marriage. After intense personal struggles and mystical experiences, she entered monastic life and became a noted spiritual writer. Her works focus on contemplation, the Passion of Christ, and deep prayer. Camilla’s life is an inspiring story of faith, humility, and devotion to God’s will.",
    "patronage": "Poor Clares, contemplative life, Italy",
    "canonizationYear": 2010,
    "imageUrl": "/images/saint_camilla.jpg"
  },
  {
    "name": "Saint Basil the Great",
    "birthYear": 329,
    "deathYear": 379,
    "feastDay": "--01-02",
    "biography": "Saint Basil was a 4th-century bishop and theologian known for his role in developing Christian monasticism and shaping orthodox Christian doctrine. Born into a wealthy and religious family, he became a strong defender of the Nicene Creed against Arianism and worked tirelessly to care for the poor and sick. Basil wrote influential theological texts and established guidelines for monastic life that emphasize community living, prayer, and service. He is celebrated as a Doctor of the Church and a key figure in early Christianity.",
    "patronage": "Monks, theologians, Russia, and Greece",
    "canonizationYear": null,
    "imageUrl": "/images/saint_basil.jpg"
  },
  {
    "name": "Saint Ignatius of Antioch",
    "birthYear": 35,
    "deathYear": 108,
    "feastDay": "--10-17",
    "biography": "Saint Ignatius was the third bishop of Antioch, succeeding Saint Peter and Saint Evodius, and one of the most important Apostolic Fathers. He is believed to have been a disciple of Saint John the Apostle and may have been among the children Jesus blessed, according to later tradition.\n\nDuring the reign of Emperor Trajan, Ignatius was arrested and transported to Rome under heavy guard to face execution. Along the journey, he wrote seven epistles to various Christian communities, including Ephesus, Smyrna, and Rome. These letters remain vital documents in Christian theology, shedding light on early Church structure, the sacraments, and especially the role of the bishop as a unifying figure.\n\nIgnatius strongly emphasized the Eucharist, the Incarnation, and obedience to bishops as safeguards of true doctrine. He welcomed martyrdom, seeing it as a way to fully unite with Christ, famously writing, “I am God’s wheat... let me be ground by the teeth of the wild beasts, that I may be found the pure bread of Christ.” He was ultimately thrown to the lions in the Roman Colosseum.",
    "patronage": "Antioch, Syria, and the Eastern Orthodox Church",
    "canonizationYear": null,
    "imageUrl": "/images/saint_ignatius_antioch.jpg"
  },
  {
    "name": "Saint Pius X",
    "birthYear": 1835,
    "deathYear": 1914,
    "feastDay": "--08-21",
    "biography": "Born Giuseppe Melchiorre Sarto in a humble Italian family, he rose through the clerical ranks, becoming Pope in 1903. Saint Pius X was a reformer at heart—he promoted frequent Holy Communion, streamlined Church governance by initiating the 1917 Code of Canon Law, and strongly opposed modernist trends. His humble, pastoral approach and liturgical renewal earned him the nickname “Pope of the Eucharist.” He passed away in 1914 and was canonized in 1954.",
    "patronage": "Catechists, first communicants, pilgrims, and emigrants",
    "canonizationYear": 1954,
    "imageUrl": "/images/saint_pius_x.jpg"
  },
  {
    "name": "Saint David",
    "birthYear": 500,
    "deathYear": 589,
    "feastDay": "--03-01",
    "biography": "A Welsh bishop celebrated for his devout simplicity, Saint David founded monastic communities across Wales. At the Synod of Brefi, legend recounts that the ground rose beneath him so he could be seen and heard—symbolized by a dove landing on his shoulder. His monastic rule emphasized self-sufficiency, asceticism, and communal life. He became a beloved national symbol for Wales.",
    "patronage": "Wales, vegetarians, poets",
    "canonizationYear": 1123,
    "imageUrl": "/images/saint_david.jpg"
  },
  {
    "name": "Saint Alexander of Jerusalem",
    "birthYear": null,
    "deathYear": 251,
    "feastDay": "--03-18",
    "biography": "Born in Cappadocia, Alexander became bishop in Jerusalem during a time of persecution. A mentor to the theologian Origen, he supported his leadership even while Origen was still a layman. Alexander founded a notable library and studied deeply under early Christian teaching. He was arrested under Emperor Decius and martyred in Caesarea, believed to have been spared by beasts due to his sanctity—a testament to his enduring faith and spiritual legacy.",
    "patronage": "Bishops, Jerusalem",
    "canonizationYear": null,
    "imageUrl": "/images/saint_alexander.jpg"
  },
  {
    "name": "Saint Polycarp",
    "birthYear": 69,
    "deathYear": 155,
    "feastDay": "--02-23",
    "biography": "Saint Polycarp was a 2nd-century bishop of Smyrna and one of the most significant figures in the early Church. A disciple of the Apostle John, he served as a living link between the apostolic age and the developing Christian tradition. Polycarp was revered for his orthodoxy, humility, and pastoral leadership, especially during a time of doctrinal disputes and external persecution.\n\nHe played a key role in early Church councils, particularly in addressing disagreements over the date of Easter (the Quartodeciman controversy), where he held to the practices passed down from John. His deep commitment to the faith is most famously recorded in the Martyrdom of Polycarp, one of the earliest and most detailed Christian martyrdom accounts. At the age of 86, after refusing to deny Christ before Roman authorities, Polycarp was burned at the stake and stabbed when the fire did not consume him. His last recorded words were a prayer of thanksgiving.",
    "patronage": "Smyrna, martyrs, and publishers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_polycarp.jpg"
  },
  {
    "name": "Saint Constantine the Great",
    "birthYear": 272,
    "deathYear": 337,
    "feastDay": "--05-21",
    "biography": "Saint Constantine the Great (c. 272–337 AD) was the Roman Emperor who fundamentally transformed the course of Christianity and Western history. Born in Naissus (modern-day Niš, Serbia), Constantine rose through the military and political ranks to become emperor in 306 AD. He is most famous for being the first Roman emperor to convert to Christianity. His reign marked a pivotal shift from persecution of Christians to the establishment of Christianity as a legally recognized and favored religion within the Roman Empire.\n\nIn 313 AD, Constantine and his co-emperor Licinius issued the Edict of Milan, granting religious tolerance to Christians and restoring confiscated church property. Constantine also convened the First Council of Nicaea in 325 AD, which sought to unify Christian doctrine and address heresies, resulting in the Nicene Creed — a foundational statement of Christian faith.\n\nConstantine founded the city of Constantinople (modern-day Istanbul), which became a new center of the Roman Empire and later the Byzantine Empire. His reign blended Christian ideals with imperial authority, reshaping religious and political life in Europe.\n\nThough not formally canonized by the Catholic Church, Constantine is venerated as a saint in the Eastern Orthodox, Oriental Orthodox, and some Eastern Catholic Churches for his role in defending and advancing the Christian faith. His feast day is celebrated on May 21 in the Eastern tradition.",
    "patronage": "Converts, architects, and Roman emperors",
    "canonizationYear": null,
    "imageUrl": "/images/saint_constantine.jpg"
  },
  {
    "name": "Saint Clement",
    "birthYear": 45,
    "deathYear": 101,
    "feastDay": "--11-23",
    "biography": "Saint Clement was the fourth Pope of the Church, succeeding Saint Peter, Linus, and Cletus. He served as Bishop of Rome near the end of the 1st century, during a time of growing tension between the Roman authorities and the Christian community.\n\nHe is best known for his letter to the Corinthians (1 Clement), written to address a dispute within the Corinthian Church regarding leadership. This epistle, written with pastoral care and theological depth, is one of the earliest extant Christian writings outside of the New Testament and provides a profound insight into the structure and authority of the early Church. It upholds the importance of apostolic succession and unity, themes that would shape ecclesiology for centuries.\n\nAccording to later tradition, Clement was exiled by Emperor Trajan and forced to work in quarries. While imprisoned, he is said to have miraculously provided water for fellow prisoners. He was eventually martyred—tied to an anchor and thrown into the sea. His symbol is the anchor, and he is remembered for his leadership, humility, and the clarity of his faith.",
    "patronage": "Mariners, stonecutters, and the papacy",
    "canonizationYear": null,
    "imageUrl": "/images/saint_clement.jpg"
  },
  {
    "name": "Saint Catherine of Sweden",
    "birthYear": 1303,
    "deathYear": 1373,
    "feastDay": "--07-23",
    "biography": "Born into Swedish nobility, Catherine was widowed at a young age before dedicating her life to God. She founded the Bridgettine Order, blending contemplative and active charity life. A mystic and visionary, she experienced profound spiritual revelations, which she dictated as Revelations of Saint Bridget—deeply influencing European spirituality. Catherine traveled extensively, advocated for church reform and peace during tumultuous times, and offered counsel to popes and monarchs. She was canonized in 1391 and later declared a Patron Saint of Europe.",
    "patronage": "Sweden, broadcasters, Europe, brides, childbirth, visions",
    "canonizationYear": 1391,
    "imageUrl": "/images/saint_catherine_sweden.jpg"
  },
  {
    "name": "Saint Timothy",
    "birthYear": null,
    "deathYear": 97,
    "feastDay": "--01-26",
    "biography": "Saint Timothy was a trusted companion and disciple of the Apostle Paul, mentioned several times in the New Testament. Born in Lystra (modern-day Turkey), he was the son of a Jewish mother and a Greek father. Paul met Timothy during his second missionary journey and soon took him under his wing, ordaining him to assist in ministry. Timothy accompanied Paul on several missions and was entrusted with overseeing churches, including those in Ephesus. He is traditionally credited as the recipient of two New Testament epistles—1 and 2 Timothy—which contain guidance on church leadership, doctrine, and Christian living. Timothy is believed to have been martyred in Ephesus around the end of the 1st century. His feast day is celebrated on January 26 in the Western Church.",
    "patronage": "Deacons, expectant mothers, stomach disorders, synods",
    "canonizationYear": null,
    "imageUrl": "/images/saint_timothy.jpg"
  },
  {
    "name": "Saint John Chrysostom",
    "birthYear": 347,
    "deathYear": 407,
    "feastDay": "--11-13",
    "biography": "Saint John Chrysostom (c. 349–407) was an early Church Father and Archbishop of Constantinople renowned for his eloquence in preaching and public speaking—his surname means “golden-mouthed.” Born in Antioch in modern-day Syria, he received a thorough classical education before choosing the ascetic and monastic life. As a priest, he became famous for his powerful sermons condemning abuses in the church and society, emphasizing charity and moral integrity. Elevated to Archbishop of Constantinople, he faced opposition from political and religious figures due to his bold reforms and criticism of imperial corruption. Exiled twice before dying in exile, his writings, including homilies and commentaries on the Bible, greatly influenced Christian theology and liturgy. He was declared a Doctor of the Church, and his feast day is celebrated on September 13 in the Western tradition and January 27 in the Eastern Orthodox Church.",
    "patronage": "Preachers, Orthodox Church, Constantinople, homilists",
    "canonizationYear": null,
    "imageUrl": "/images/saint_john_crysostom.jpg"
  },
  {
    "name": "Saint Philip",
    "birthYear": null,
    "deathYear": 80,
    "feastDay": "--05-03",
    "biography": "Saint Philip was one of the twelve apostles chosen by Jesus Christ. He is often identified as Philip the Apostle, a native of Bethsaida, the same town as Andrew and Peter. Philip is first mentioned in the Gospel of John, where he is called by Jesus to follow Him. He is known for bringing others to Christ, including Nathanael (Bartholomew). Philip took part in various events during Jesus' ministry, including the feeding of the 5,000 and the Last Supper. After Pentecost, tradition holds that Philip preached the Gospel in areas such as Greece, Phrygia, and Syria, often facing persecution for his faith. Some accounts say he was martyred by crucifixion. Saint Philip’s feast day is celebrated on May 3 in the Western Church and November 14 in the Eastern Church.",
    "patronage": "Linemen, hatters, pastry chefs, Spain",
    "canonizationYear": null,
    "imageUrl": "/images/saint_philip.jpg"
  },
  {
    "name": "Saint Cornelius",
    "birthYear": null,
    "deathYear": 253,
    "feastDay": "--09-16",
    "biography": "Cornelius was a Roman centurion who converted to Christianity and served as Pope from 251 to 253. Leading during a time of severe persecution, he affirmed the unity of the Church and maintained Church disciplinal integrity amidst controversy over lapsi (those who denied faith under persecution). His episcopate reinforced pastoral care, showed compassion, and upheld Church structure. He is remembered for strengthening early papal authority.",
    "patronage": "The Roman Church, political prisoners, war victims",
    "canonizationYear": null,
    "imageUrl": "/images/saint_cornelius.jpg"
  },
  {
    "name": "Saint John Paul II",
    "birthYear": 1920,
    "deathYear": 2005,
    "feastDay": "--10-22",
    "biography": "Saint John Paul II, born Karol Józef Wojtyła in 1920 in Wadowice, Poland, was one of the most influential leaders of the Catholic Church in the 20th century. He grew up during a turbulent era marked by World War II and the rise of communism in Eastern Europe. Ordained a priest in 1946, he became a bishop and then cardinal, gaining a reputation for his intellectual rigor and pastoral sensitivity. Elected pope in 1978, he was the first non-Italian pope in over 450 years. His pontificate lasted 27 years, during which he traveled extensively, reaching out to people of all faiths and advocating for human rights, peace, and the dignity of the human person. He played a pivotal role in the fall of communism in Eastern Europe, promoted the new evangelization, and canonized numerous saints. Known for his deep spirituality, writings, and efforts to improve interfaith dialogue, John Paul II was canonized in 2014. His feast day is celebrated on October 22.",
    "patronage": "World Youth Day, Poland, families, athletes",
    "canonizationYear": 2014,
    "imageUrl": "/images/saint_john_paul_ii.jpg"
  }
]