[
  {
    "name": "Saint Francis of Assisi",
    "birthYear": 1181,
    "deathYear": 1226,
    "feastDay": "--10-04",
    "biography": "Saint Francis of Assisi, born in 1181 or 1182 in the town of Assisi, Italy, was the son of a wealthy cloth merchant. As a young man, he enjoyed a life of comfort, parties, and ambition. He dreamed of becoming a knight and gaining glory in battle. However, a series of events — including imprisonment, illness, and a growing sense of spiritual emptiness — led him to rethink his life’s purpose.\n\nAround the age of 25, Francis underwent a profound spiritual conversion. He began to live in radical poverty, renouncing his inheritance and embracing a life of simplicity, prayer, and service. He dedicated himself to following Christ literally, caring for the poor and lepers, and preaching repentance.\n\nOne of the most defining moments in his journey occurred when he heard the voice of Christ from the crucifix in the church of San Damiano, telling him: \"Rebuild my Church.\" Francis first took this literally, repairing broken chapels, but he soon understood his mission was spiritual renewal within the broader Church.\n\nIn 1209, he founded the Order of Friars Minor, better known as the Franciscans, who embraced poverty, humility, and preaching. He later founded the Poor Clares with Saint Clare, and the Third Order of Saint Francis for laypeople. His joyful love of creation, deep humility, and commitment to peace and compassion earned him admiration across all walks of life.\n\nFrancis is also remembered for his mystical connection with nature. He called animals his \"brothers and sisters\" and composed the famous \"Canticle of the Sun\", a hymn praising God for creation. Legend holds that he received the stigmata — the wounds of Christ — two years before his death, a rare and profound sign of union with Jesus’ suffering.\n\nFrancis was not only a mystic but also a man of action. During the Fifth Crusade in 1219, he traveled to Egypt and, with extraordinary courage, crossed the battle lines to meet Sultan al-Kamil. Instead of hostility, their encounter became a moment of dialogue and mutual respect, showing Francis’s vision of peace through humility and faith rather than violence. This episode has remained a powerful symbol of interreligious understanding.\n\nAs the Franciscan movement grew, Francis wrestled with the responsibility of guiding his followers. Though many wished to formalize the order with strict rules and structures, Francis continually urged simplicity and dependence on God, insisting that his brothers should live as \"lesser ones\" among the people. His refusal to compromise on poverty became the defining spirit of the Franciscans.\n\nIn his final years, Francis endured illness and near blindness. Despite his suffering, he continued to radiate gratitude and joy, composing songs of praise and reminding his followers to rejoice in God’s goodness. His final days were marked by humility; he asked to be placed upon the bare ground at the moment of his passing, remaining faithful to the poverty he had lived.\n\nHe died in 1226 at the age of 44, surrounded by his companions, singing praises to God. Just two years later, in 1228, he was canonized by Pope Gregory IX. His tomb in Assisi became a place of pilgrimage, and his life has inspired countless people to embrace peace, simplicity, and reverence for creation. In 1979, he was proclaimed the patron saint of ecology and animals, a recognition of his timeless message that all creation reflects the love of the Creator.",
    "patronage": "Animals, environment, merchants",
    "canonizationYear": 1228,
    "imageUrl": "/images/saint_francis.jpg",
    "imageSource": "Royal Museum of Fine Arts Antwerp / Wikimedia Commons",
    "imageAuthor": "Philip Fruytiers (1610–1666), photographic reproduction by KMSKA",
    "imageLicence": "Public Domain – faithful photographic reproduction of a two-dimensional public domain artwork (PD-Art, Wikimedia Commons)"
  },
  {
    "name": "Saint Thérèse of Lisieux",
    "birthYear": 1873,
    "deathYear": 1897,
    "feastDay": "--10-01",
    "biography": "Saint Thérèse of Lisieux, also known as \"The Little Flower of Jesus,\" was born on January 2, 1873, in Alençon, France, the youngest of nine children born to Louis and Zélie Martin, both of whom were later canonized as saints. Of the Martin children, only five daughters survived to adulthood, and each of them eventually entered religious life.\n\nThérèse’s childhood was marked by both tenderness and suffering. When she was only four, her mother died of breast cancer, a loss that deeply affected her sensitive soul. The family moved to Lisieux, where her older sisters helped raise her. Thérèse was affectionate, intelligent, and spiritually inclined, but she also struggled with scruples and fragile health.\n\nHer greatest desire was to give her life entirely to Christ. At the age of 15, she requested permission to enter the Carmelite convent in Lisieux. Because of her young age, she had to appeal to the local bishop and even spoke directly to Pope Leo XIII during a pilgrimage to Rome. Eventually, her persistence was rewarded, and in 1888 she entered Carmel as a novice.\n\nLife in the cloister was hidden, quiet, and filled with both joys and trials. Thérèse embraced the smallest tasks with love, from doing chores to offering up her physical and spiritual sufferings. She described her spiritual path as \"the Little Way,\" a way of holiness based on trust in God’s mercy and performing ordinary acts with extraordinary love. Her spirituality was deeply rooted in childlike trust, humility, and confidence in God.\n\nIn her final years, she suffered from tuberculosis, enduring physical weakness, fevers, and spiritual darkness. Yet she remained faithful and even joyful, uniting her pain with Christ’s suffering for the salvation of souls. At the request of her prioress, she wrote her autobiography, \"Story of a Soul,\" which has since become a spiritual classic read around the world. In it, she expressed her conviction that her vocation was love itself, and that holiness is accessible to all who trust God in the little things of daily life.\n\nThérèse died on September 30, 1897, at the age of 24, whispering, \"My God, I love You.\" Her hidden life quickly became known through her writings, and miracles were attributed to her intercession. She was canonized in 1925, less than 30 years after her death, and in 1997 Pope John Paul II declared her a Doctor of the Church. Today she is honored as the patron saint of missionaries, despite never leaving her convent, because of her fervent prayers for the spread of the Gospel.",
    "patronage": "Missionaries, florists, AIDS sufferers",
    "canonizationYear": 1925,
    "imageUrl": "/images/saint_therese_de_lisieux.jpg",
    "imageSource": "Archives du Carmel de Lisieux / Wikimedia Commons",
    "imageAuthor": "Photograph by Céline Martin (1869–1959)",
    "imageLicence": "CC0 1.0 Universal (Public Domain Dedication)"
  },
  {
    "name": "Saint Augustine of Hippo",
    "birthYear": 354,
    "deathYear": 430,
    "feastDay": "--08-28",
    "biography": "Saint Augustine of Hippo was born in 354 in Tagaste (modern-day Algeria), in North Africa. He was raised by his devout Christian mother, Saint Monica, and a pagan father, Patricius. Augustine’s early years were marked by intelligence and ambition, but also by restlessness and indulgence. As a student of rhetoric in Carthage, he sought worldly success, fame, and pleasure, but struggled to find lasting peace.\n\nFor many years, Augustine searched for truth in philosophies and religions outside Christianity. He joined the sect of the Manicheans, who offered a dualistic view of the world, but he later found their teachings unsatisfying. He was also drawn to the writings of philosophers such as Cicero and Plotinus, which awakened in him a longing for wisdom. Despite his intellectual brilliance, Augustine confessed to being enslaved by passions and unable to master his desires.\n\nHis conversion journey took a decisive turn when he moved to Milan, where he encountered the eloquent preaching of Saint Ambrose. At the same time, the constant prayers and tears of his mother Monica continued to surround him with grace. In 386, after an intense inner struggle, Augustine experienced a powerful moment of surrender. He opened the Scriptures and read a passage from Saint Paul’s letter to the Romans urging him to put aside sin and live in Christ. This became the moment of his conversion. The following year, at the Easter Vigil of 387, Augustine was baptized by Ambrose in Milan.\n\nAfter his baptism, Augustine returned to North Africa. He gave up his worldly ambitions, sold his possessions, and established a small monastic community devoted to prayer and study. In 395, he was ordained bishop of Hippo, a role he held for over thirty years. As bishop, Augustine cared for his people pastorally while also defending the faith against heresies such as Donatism and Pelagianism. He became one of the most influential voices in the early Church, renowned for his clarity of thought and depth of faith.\n\nAugustine’s writings have had a profound impact on Christianity and Western philosophy. His \"Confessions\" is one of the first spiritual autobiographies in history, blending personal narrative with theological reflection. His monumental work \"The City of God,\" written after the sack of Rome in 410, offered a vision of human history under God’s providence and remains a cornerstone of Christian thought. His insights into grace, free will, and the nature of the Church shaped theology for centuries.\n\nAugustine died in 430, during the Vandal siege of Hippo. His mother Monica, who had lived to see his conversion, had died years earlier, her prayers answered. Though canonization was not yet a formal process in his time, Augustine has long been venerated as a saint and was later declared a Doctor of the Church. His life stands as a testimony that even the most restless heart can find peace when it rests in God.\n\nHe is honored as the patron saint of theologians, brewers, and those seeking conversion, remembered for the famous words from his \"Confessions\": \"You have made us for yourself, O Lord, and our hearts are restless until they rest in you.\"",
    "patronage": "Theologians, brewers, printers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_augustine.jpg",
    "imageSource": "Los Angeles County Museum of Art / Wikimedia Commons",
    "imageAuthor": "Philippe de Champaigne (1602–1674), photographic reproduction",
    "imageLicence": "Public Domain – faithful photographic reproduction of a two-dimensional public domain artwork (PD-Art, Wikimedia Commons)"
  },
  {
    "name": "Saint Joan of Arc",
    "birthYear": 1412,
    "deathYear": 1431,
    "feastDay": "--05-30",
    "biography": "Saint Joan of Arc, known as the Maid of Orléans, was born in 1412 in Domrémy, a small village in northeastern France. She grew up as the daughter of a humble farming family, learning faith and hard work from an early age. At around thirteen, Joan began to experience mystical visions and hear the voices of saints — especially Saint Michael, Saint Catherine, and Saint Margaret — who urged her to remain pure and to dedicate her life to the mission of saving France during the turmoil of the Hundred Years’ War.\n\nBy the time she was seventeen, Joan felt compelled to act. She sought out Charles, the Dauphin of France, and through her conviction and honesty persuaded him that she had been sent by God to aid his cause. Granted armor, a banner, and command alongside experienced soldiers, Joan quickly became a source of courage for the French army. In 1429, she led troops to a decisive victory at Orléans, breaking the English siege and altering the course of the war. Soon after, she accompanied Charles to Reims, where he was crowned King Charles VII — a moment she had foretold.\n\nDespite her victories, Joan’s mission was short-lived. In 1430, while defending the town of Compiègne, she was captured by Burgundian forces allied with the English. Betrayed into enemy hands, she faced a long, hostile trial in Rouen, accused of heresy, witchcraft, and cross-dressing for wearing soldiers’ clothing. The proceedings were politically driven, aiming to discredit both Joan and the legitimacy of Charles VII. At just nineteen years old, Joan was condemned and burned at the stake on May 30, 1431, praying and calling upon Jesus with her final breath.\n\nHer death shocked France, but her reputation only grew stronger. In 1456, a papal retrial cleared her of all charges, declaring her a martyr and victim of injustice. Nearly five centuries later, in 1920, Joan was officially canonized a saint by Pope Benedict XV. Today, she stands as one of the most beloved and inspiring figures of the Catholic Church, remembered as the patron saint of France, soldiers, and those who remain steadfast under persecution. Joan’s brief but extraordinary life continues to symbolize courage, purity of faith, and unshakable conviction in the face of overwhelming opposition.",
    "patronage": "France, soldiers, martyrs",
    "canonizationYear": 1920,
    "imageUrl": "/images/saint_joan_of_arc.jpg",
    "imageSource": "Musée Dobrée / Wikimedia Commons",
    "imageAuthor": "Jean Pichore (fl. 1502–1520), photographic reproduction",
    "imageLicence": "Public Domain – faithful photographic reproduction of a two-dimensional public domain artwork (PD-Art, Wikimedia Commons)"
  },
  {
    "name": "Saint Teresa of Ávila",
    "birthYear": 1515,
    "deathYear": 1582,
    "feastDay": "--10-15",
    "biography": "Saint Teresa of Ávila, also called Saint Teresa of Jesus, was born in 1515 in Gotarrendura near Ávila, Spain. As a lively and intelligent child, she loved both prayer and stories of heroic saints. At age twenty she entered the Carmelite Convent of the Incarnation, but soon found herself discouraged by its lax discipline and worldly distractions.\n\nHer life changed dramatically after a period of serious illness and recovery in her late twenties. During these years, she began to experience mystical visions, deep contemplative prayer, and a renewed sense of mission. Teresa became convinced that God was calling her to reform the Carmelite order, returning it to greater simplicity, poverty, and devotion. Despite criticism and strong resistance, she persevered, founding over a dozen convents and inspiring many to follow her path of radical trust in God.\n\nTeresa was also an exceptional writer. Her works, such as 'The Way of Perfection' and 'The Interior Castle', combine practical advice on prayer with profound spiritual insights. She described the soul’s journey toward God as moving through interior rooms of a great castle until reaching the union of love at its center.\n\nKnown for her wit, determination, and deep humanity, Teresa balanced mystical experiences with practical leadership. She suffered illness and opposition, yet remained steadfast in her mission. She died in 1582 at the age of 67. Canonized in 1622, she was declared a Doctor of the Church in 1970 — one of the first women to be given this honor.\n\nToday, Saint Teresa of Ávila is remembered as a master of prayer and a fearless reformer whose teachings continue to inspire those seeking deeper friendship with God.",
    "patronage": "Headache sufferers, Spanish Catholic writers",
    "canonizationYear": 1622,
    "imageUrl": "/images/saint_theresa.jpg",
    "imageSource": "The Metropolitan Museum of Art / Wikimedia Commons",
    "imageAuthor": "Peter Paul Rubens (1577–1640), faithful photographic reproduction (The Met Open Access)",
    "imageLicence": "CC0 1.0 Universal (Public Domain Dedication)"
  },
  {
    "name": "Saint Anthony of Padua",
    "birthYear": 1195,
    "deathYear": 1231,
    "feastDay": "--06-13",
    "biography": "Saint Anthony of Padua, born Fernando Martins in Lisbon in 1195, was raised in a noble but devout family. At a young age he entered the Augustinian Canons, dedicating himself to study and prayer. Inspired by the martyrdom of five Franciscan friars in Morocco, he joined the Franciscans and took the name Anthony, longing to share their spirit of sacrifice.\n\nThough he first desired to become a missionary, poor health kept him in Europe. There, his extraordinary gift for preaching soon became known. Anthony spoke with such clarity, wisdom, and passion that he drew crowds of thousands across Italy and France. His sermons were filled with love for the poor and practical teaching from Scripture, earning him the title 'Doctor of the Gospel.'\n\nAnthony was also known for his tender devotion to Christ and the Blessed Virgin. Legends tell of his intimate union with God — the most famous story depicts him cradling the Christ Child in a vision. Many miracles of healing and conversion were attributed to him both in life and after his death.\n\nHe died in Padua in 1231 at just 36 years old. So great was his reputation for holiness that he was canonized less than a year later, one of the fastest canonizations in Church history. In 1946, he was named a Doctor of the Church for his theological brilliance.\n\nSaint Anthony is beloved worldwide as the patron saint of lost items, travelers, the poor, and expectant mothers. His legacy endures as a preacher of truth and a friend to all who seek God’s help in daily struggles.",
    "patronage": "Lost items, the poor, travelers, pregnant women, the elderly, fishermen",
    "canonizationYear": 1232,
    "imageUrl": "/images/saint_anthony_of_padua.jpg",
    "imageSource": "Museum of Fine Arts, Budapest / Wikimedia Commons",
    "imageAuthor": "Antonio de Pereda (1611–1678), faithful photographic reproduction of 2D artwork",
    "imageLicence": "Public Domain – faithful photographic reproduction of a two-dimensional public domain artwork (PD-Art, Wikimedia Commons)"
  },
  {
    "name": "Saint Thomas Aquinas",
    "birthYear": 1225,
    "deathYear": 1274,
    "feastDay": "--01-28",
    "biography": "Saint Thomas Aquinas, born around 1225 in Roccasecca, Italy, was one of the most influential theologians and philosophers in the history of the Catholic Church. The youngest son of a noble family, Thomas initially faced strong opposition when he chose to join the Dominican Order, a path far removed from the life of wealth and prestige his parents had envisioned. Despite this, he committed himself fully to the life of study, prayer, and teaching, demonstrating remarkable intellectual rigor and spiritual depth.\n\nThomas studied under Albertus Magnus, one of the leading thinkers of his day, and quickly distinguished himself for his brilliant grasp of philosophy, theology, and the liberal arts. He taught at the universities of Paris and Naples, attracting students and scholars eager to learn from his insights. Aquinas is best known for his masterful integration of Aristotelian philosophy with Christian theology, showing that faith and reason complement rather than contradict each other.\n\nAmong his monumental works are the 'Summa Theologiae' and 'Summa Contra Gentiles', where he explored profound questions about God, morality, the soul, and the natural order. His arguments for the existence of God, famously known as the 'Five Ways', remain foundational in philosophy and theology. Thomas emphasized the importance of natural law, the dignity of the human person, and the ultimate pursuit of God as the highest good.\n\nIn 1273, shortly before his death, he experienced a mystical vision during Mass that left him humbled, famously saying: “All I have written seems like straw.” He died in 1274 while traveling to participate in the Second Council of Lyon. Canonized in 1323 by Pope John XXII, Thomas Aquinas was later declared a Doctor of the Church, recognized for his unparalleled contributions to Christian thought.\n\nToday, he is venerated as the patron saint of scholars, students, philosophers, and Catholic educational institutions. His life is a testament to disciplined study, humility, and the harmonious pursuit of faith and reason, inspiring countless generations to seek truth and wisdom.",
    "patronage": "Scholars, students, philosophers, Catholic schools, universities, academics",
    "canonizationYear": 1323,
    "imageUrl": "/images/saint_thomas_aquinas.jpg",
    "imageSource": "National Gallery, London / Wikimedia Commons",
    "imageAuthor": "Carlo Crivelli (c. 1435–c. 1495), faithful photographic reproduction",
    "imageLicence": "Public Domain – faithful photographic reproduction of a two-dimensional public domain artwork (PD-Art, Wikimedia Commons)"
  },
  {
    "name": "Saint Joseph",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--03-19",
    "biography": "Saint Joseph, spouse of the Blessed Virgin Mary and earthly father of Jesus Christ, is one of the most venerated figures in Christian tradition. Though the Gospels provide few details about his life, his role in salvation history is monumental. A humble carpenter from Nazareth, Joseph was a man of unwavering faith, integrity, and quiet courage.\n\nWhen Joseph learned of Mary's miraculous pregnancy, he initially intended to separate from her quietly to protect her from public shame. However, an angel appeared to him in a dream, assuring him of the divine origin of her child. Joseph obeyed without hesitation, taking Mary as his wife and becoming the devoted guardian of the Holy Family.\n\nThroughout the early life of Jesus, Joseph displayed remarkable discernment and courage. He led Mary and the infant Jesus to Egypt to escape King Herod's persecution, returned them safely to Nazareth, and provided for them through diligent work as a carpenter. His life exemplified humility, obedience, and faithful action, guided by divine instruction and an attentive heart.\n\nThough silent in Scripture, Joseph's example speaks volumes: a man who models trust in God, protection of the vulnerable, and steadfast devotion to family. The Church has long recognized him as the patron of fathers, workers, carpenters, families, immigrants, travelers, and those seeking a happy death. In 1870, Pope Pius IX declared him Patron of the Universal Church, and in 2021, Pope Francis dedicated an entire year to honor his virtues and inspire Christian life.\n\nSaint Joseph’s life remains a timeless model of quiet strength, loving service, and deep faith. His example calls believers to embrace responsibility with humility, care for others with dedication, and trust God even in uncertainty.",
    "patronage": "Universal Church, workers, carpenters, fathers, families, a happy death, immigrants, travelers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_joseph.jpg",
    "imageSource": "Museum of Fine Arts, Houston / Wikimedia Commons",
    "imageAuthor": "Guido Reni (1575–1642), faithful photographic reproduction",
    "imageLicence": "Public Domain – faithful photographic reproduction of a two-dimensional public domain artwork (PD-Art, Wikimedia Commons)"
  },
  {
    "name": "Saint Joseph the Worker",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--05-01",
    "biography": "Saint Joseph the Worker is a title that honors Saint Joseph’s vocation as a laborer and emphasizes the sacredness of ordinary work. This feast, celebrated on May 1st, was instituted by Pope Pius XII in 1955 to highlight the dignity of human labor, affirming that work is not only a necessity but also a participation in God’s creative plan. It serves as a Christian response to the secular emphasis on labor prevalent in the modern world, presenting Saint Joseph as the ultimate model of fidelity, humility, and perseverance.\n\nAs a carpenter, Joseph’s life was marked by practical skill, discipline, and steadfast devotion. He worked quietly and diligently, not for personal glory, but to provide for the Holy Family with integrity and love. Every nail he hammered and every plank he shaped were acts of service, transforming the ordinary labor of daily life into a vocation of holiness. In doing so, Joseph sanctified the work of the hands and showed that even the simplest tasks can be offered to God with care and devotion.\n\nSaint Joseph the Worker exemplifies patience and responsibility in the face of life’s challenges. He taught by example the virtues of diligence, honesty, and fidelity—principles that remain vital for workers, parents, and all who labor to support others. His example also reminds us that spiritual life is not separate from daily duties; work, when done with love and integrity, becomes a form of prayer and a contribution to the common good.\n\nThrough this feast, the Church invites the faithful to reflect on the value of their own labor, whether physical, intellectual, or creative. Saint Joseph the Worker stands as a patron and protector of workers worldwide, inspiring them to perform their duties with purpose, dedication, and a spirit of service. His life teaches that work, offered to God, sanctifies both the worker and the world around them, showing that holiness can be found in the ordinary rhythms of daily life.",
    "patronage": "Workers, laborers, fathers, families, craftsmen",
    "canonizationYear": null,
    "imageUrl": "/images/saint_joseph.jpg",
    "imageSource": "Museum of Fine Arts, Houston / Wikimedia Commons",
    "imageAuthor": "Guido Reni (1575–1642), faithful photographic reproduction",
    "imageLicence": "Public Domain – faithful photographic reproduction of a two-dimensional public domain artwork (PD-Art, Wikimedia Commons)"
  },
  {
    "name": "Saint Catherine of Siena",
    "birthYear": 1347,
    "deathYear": 1380,
    "feastDay": "--04-30",
    "biography": "Saint Catherine of Siena, born in 1347 in Siena, Italy, was a woman of extraordinary spiritual insight, courage, and influence. As the 25th child in her family, she grew up during the Black Death, a time of profound suffering and social upheaval. From childhood, Catherine experienced intense mystical visions and felt a deep calling to a life of holiness. Rejecting her family’s wishes for her to marry, she committed herself to consecrated virginity and joined the Third Order of Saint Dominic, embracing a life of prayer, penance, and service.\n\nHer days were marked by rigorous austerity, meditation, and care for the sick and poor. Catherine’s mystical experiences, including her famed ‘mystical marriage’ to Christ, reflected a profound union with God and inspired those around her. Despite living in relative obscurity in Siena, her reputation for holiness grew rapidly, drawing the attention of Church leaders and rulers alike.\n\nCatherine’s influence extended far beyond spiritual counsel. She corresponded with popes, cardinals, and political leaders, advocating for reform within the Church and urging peace among warring factions. Most notably, she played a key role in persuading Pope Gregory XI to return the papacy from Avignon to Rome, a decisive moment for the Catholic Church.\n\nHer writings, especially *The Dialogue of Divine Providence*, reflect deep theological insight and spiritual guidance, despite her lack of formal education. Through these works, she taught the importance of living in love, virtue, and obedience to God’s will.\n\nCatherine died in 1380 at the young age of 33, worn out by her ceaseless dedication to prayer, service, and Church reform. Canonized in 1461 and declared a Doctor of the Church in 1970, she is remembered as a patron of Italy, nurses, Europe, and those persecuted for their faith. Her life exemplifies courage, wisdom, and unwavering devotion, serving as a timeless model of holiness and fearless service.",
    "patronage": "Italy, nurses, people ridiculed for their faith, fire prevention, miscarriages, bodily ills, and Europe",
    "canonizationYear": 1461,
    "imageUrl": "/images/saint_catherine_of_siena.jpg",
    "imageSource": "Santa Maria del Rosario in Prati / Wikimedia Commons",
    "imageAuthor": "Anonymous (faithful photographic reproduction of 2D artwork)",
    "imageLicence": "Public Domain – faithful photographic reproduction of a two-dimensional public domain artwork (PD-Art, Wikimedia Commons)"
  },
  {
    "name": "Saint Patrick",
    "birthYear": 385,
    "deathYear": 461,
    "feastDay": "--03-17",
    "biography": "Saint Patrick, born around 385 in Roman Britain—likely in modern-day Wales or Scotland—is celebrated as the 'Apostle of Ireland' for his extraordinary role in bringing Christianity to the island. Born into a Christian family, he was the son of a deacon and grandson of a priest. Despite this heritage, he did not fully embrace the faith in his youth.\n\nAt sixteen, Patrick was kidnapped by Irish raiders and enslaved in Ireland. He spent six years tending sheep in harsh conditions, during which he experienced a profound spiritual awakening. Turning to prayer and reflection, he developed an intense personal relationship with God. Guided by visions, he eventually escaped captivity and returned to his family.\n\nAfter resuming his religious studies, Patrick was ordained a priest and later consecrated as a bishop. He received a divine calling to return to Ireland and evangelize its people. Around 432 AD, he began his mission, traveling extensively to preach, baptize, and establish Christian communities. His efforts converted both common people and Irish chieftains, laying the foundation for Ireland’s transformation into a Christian society.\n\nPatrick is credited with founding churches, schools, and monasteries, while also using familiar symbols, such as the three-leafed shamrock, to explain the Holy Trinity. Though many legends surround his life—like driving snakes from Ireland—his genuine writings, the *Confessio* and the *Letter to the Soldiers of Coroticus*, reveal a man of humility, courage, and deep missionary zeal.\n\nSaint Patrick died around 461 in Saul, County Down, where he had built his first church. His legacy endures both as a spiritual beacon and a symbol of Irish identity. March 17th, his feast day, is observed globally as a day of religious devotion and cultural celebration.",
    "patronage": "Ireland, engineers, Nigeria, and against snakes",
    "canonizationYear": null,
    "imageUrl": "/images/saint_patrick.jpg",
    "imageSource": "Flickr / Internet Archive Book Images",
    "imageAuthor": "Frank J. Ryan / P. F. Holden (1904, faithful reproduction of 2D illustration)",
    "imageLicence": "Public Domain – pre-1925 publication, no known copyright restrictions"
  },
  {
    "name": "Saint Peter the Apostle",
    "birthYear": null,
    "deathYear": 64,
    "feastDay": "--06-29",
    "biography": "Saint Peter the Apostle, born Simon in Bethsaida of Galilee, was a fisherman by trade and a man of simple origins. Along with his brother Andrew, he earned his living on the waters of Lake Gennesaret until his life changed forever when Jesus called him to leave his nets and follow Him. Christ gave Simon a new name—Peter, meaning 'rock'—and entrusted him with a special mission, declaring, 'You are Peter, and upon this rock I will build my Church.'\n\nThroughout the Gospels, Peter stands out as passionate, outspoken, and deeply human. He was the first to profess Jesus as the Messiah and also the one who faltered when walking on water. His threefold denial of Christ during the Passion reveals his weakness, yet his tearful repentance and subsequent restoration after the Resurrection display his great humility and love. After Pentecost, filled with the Holy Spirit, Peter became the fearless leader of the early Christian community. He preached with power, performed miracles, and led the Apostles in spreading the Gospel despite persecution.\n\nPeter’s leadership extended to crucial moments in early Church history, including the Council of Jerusalem, where he helped unite Jewish and Gentile believers. His missionary work eventually brought him to Rome, where he shepherded the growing Christian flock. Under Emperor Nero’s brutal persecution, Peter was arrested and sentenced to death. Tradition holds that he requested to be crucified upside down, feeling unworthy to die in the same manner as his Lord.\n\nSaint Peter’s tomb beneath St. Peter’s Basilica in Vatican City stands as a witness to his enduring faith and sacrifice. Venerated as the first Pope and the visible head of Christ’s Church on earth, he remains a symbol of steadfast faith, repentance, and leadership rooted in love. His story reminds Christians that even the weakest hearts can become strong when built upon the foundation of Christ.",
    "patronage": "Popes, fishermen, net makers, shipbuilders, and Rome",
    "canonizationYear": null,
    "imageUrl": "/images/saint_peter.jpg",
    "imageSource": "Museo del Prado / Wikimedia Commons",
    "imageAuthor": "Peter Paul Rubens (1577–1640)",
    "imageLicence": "Public Domain – faithful photographic reproduction of a two-dimensional public domain artwork (PD-Art, Wikimedia Commons)"
  },
  {
    "name": "Saint Nicholas of Myra",
    "birthYear": 270,
    "deathYear": 343,
    "feastDay": "--12-06",
    "biography": "Saint Nicholas of Myra, also known as Nicholas of Bari, was a 4th-century bishop renowned for his generosity, miracles, and unwavering faith. Born in Patara, in the region of Lycia (modern-day Turkey), he was raised by devout Christian parents who died during his youth, leaving him a substantial inheritance. Choosing to dedicate his life to God, Nicholas used his wealth to aid the poor, protect the vulnerable, and defend the innocent.\n\nOne of the most beloved accounts of his charity tells how he secretly provided dowries for three impoverished daughters by tossing bags of gold through their window at night—an act that inspired centuries of gift-giving traditions. As Bishop of Myra, Nicholas became known for his pastoral care, compassion, and defense of Christian orthodoxy during the turbulent years of Roman persecution. He was imprisoned under Emperor Diocletian but released after Constantine’s rise to power.\n\nNicholas also reportedly attended the First Council of Nicaea in 325, where he defended the divinity of Christ against Arianism. His reputation for miraculous intercessions spread throughout the Christian world—saving sailors at sea, protecting children, and aiding the unjustly accused. After his death in 343, devotion to Saint Nicholas grew rapidly, and his relics were later translated to Bari, Italy, making him one of the most venerated saints in Christendom.\n\nIn Western culture, his memory evolved into the figure of Santa Claus, yet behind the legend stands the real Bishop Nicholas—a man of profound holiness, courage, and mercy, whose life remains a testament to the power of Christian charity.",
    "patronage": "Children, sailors, merchants, pawnbrokers, and students",
    "canonizationYear": null,
    "imageUrl": "/images/saint_nicholas.jpg",
    "imageSource": "Saint Catherine's Monastery, Sinai / Wikimedia Commons",
    "imageAuthor": "Unknown (Byzantine icon, first half of the 13th century)",
    "imageLicence": "Public Domain – faithful photographic reproduction of a two-dimensional public domain artwork (PD-Art, Wikimedia Commons)"
  },
  {
    "name": "Saint Padre Pio",
    "birthYear": 1887,
    "deathYear": 1968,
    "feastDay": "--09-23",
    "biography": "Saint Padre Pio of Pietrelcina, born Francesco Forgione on May 25, 1887, in the small town of Pietrelcina, Italy, was a Capuchin friar whose life became one of the most extraordinary examples of faith, suffering, and mystical grace in the 20th century. Raised in a devout peasant family, Francesco showed signs of deep spirituality from an early age—seeing visions of Jesus and Mary, engaging in long hours of prayer, and aspiring to a life of total dedication to God. He entered the Capuchin Franciscan order at the age of fifteen, taking the name Pio in honor of Pope Pius I.\n\nOrdained a priest in 1910, Padre Pio soon became renowned for his intense piety, humility, and ascetic lifestyle. In 1918, while praying before a crucifix in the church of San Giovanni Rotondo, he received the visible stigmata—the wounds of Christ—on his hands, feet, and side. These marks of the Passion, which remained until his death fifty years later, drew pilgrims from across the world. Despite physical suffering, Padre Pio accepted these wounds as a share in Christ’s redemptive suffering, offering his pain for the conversion of sinners and the salvation of souls.\n\nPadre Pio was known for his miraculous gifts: bilocation, prophecy, reading of hearts, and healing through prayer. Yet, his greatest ministry was in the confessional, where he spent up to sixteen hours a day guiding penitents to reconciliation with God. He famously urged all to 'Pray, hope, and don’t worry,' emphasizing that prayer and trust were the keys to peace.\n\nDespite skepticism and multiple investigations by Church authorities, his sanctity and obedience remained steadfast. In 1956, he founded the *Casa Sollievo della Sofferenza* ('Home for the Relief of Suffering'), a world-class hospital that continues his mission of healing body and soul.\n\nPadre Pio died on September 23, 1968, after receiving the sacraments, his last words being 'Gesù, Maria' ('Jesus, Mary'). Canonized by Pope John Paul II in 2002, he stands as a modern witness to the reality of divine grace working through human weakness. His life remains a testament to the transforming power of prayer, sacrifice, and total trust in God.",
    "patronage": "Civil defense volunteers, adolescents, stress relief, and the sick",
    "canonizationYear": 2002,
    "imageUrl": "/images/saint_padre_pio.jpg",
    "imageSource": "Wikimedia Commons / Saint Catherine's Monastery Archive",
    "imageAuthor": "Elia Stelluto (1935– )",
    "imageLicence": "Public Domain – Italy, EU, and U.S."
  },
  {
    "name": "Saints Joachim and Anne",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--07-26",
    "biography": "Saints Joachim and Anne are venerated as the parents of the Blessed Virgin Mary and the grandparents of Jesus Christ, honored for their faith, patience, and devotion to God’s plan of salvation. While their story does not appear in the canonical Gospels, early Christian tradition, especially the *Protevangelium of James* (2nd century), provides a portrait of their steadfast trust in divine providence.\n\nAccording to tradition, Joachim and Anne were a devout and righteous couple living in Jerusalem who longed for a child but suffered the pain of barrenness for many years. Their prayers were heard when an angel appeared, announcing that Anne would conceive a daughter who would be blessed among women. In gratitude, they dedicated their child, Mary, to the service of God—a promise that prepared her for her singular vocation as the Mother of the Savior.\n\nSaints Joachim and Anne are revered not only as ancestors of Christ but also as exemplars of faithful parenthood and perseverance. Their story reflects the hope of all who wait patiently on the Lord and the beauty of family life rooted in faith. Their union, marked by love and prayer, laid the foundation for the Incarnation itself, as their daughter Mary became the vessel through whom God entered the world.\n\nThroughout the centuries, devotion to Joachim and Anne has been a source of comfort for parents, grandparents, and married couples. They are invoked as intercessors for fertility, family unity, and the nurturing of children in the faith. The Church celebrates their feast together on July 26, recognizing in them the sanctity of family life and the hidden yet powerful role of those who quietly prepare the way for God’s work in the world.",
    "patronage": "Fathers, grandfathers, grandparents, married couples, and infertile couples",
    "canonizationYear": null,
    "imageUrl": "/images/saints_joachim_anne.jpg",
    "imageSource": "The Metropolitan Museum of Art, Open Access Collection",
    "imageAuthor": "Unknown artist (British, 15th century)",
    "imageLicence": "CC0 1.0 Universal (Public Domain Dedication)"
  },
  {
    "name": "Saint Monica",
    "birthYear": 331,
    "deathYear": 387,
    "feastDay": "--08-27",
    "biography": "Saint Monica, born around 331 AD in Tagaste (modern-day Algeria), is venerated as the devoted mother of Saint Augustine and a model of patient, persevering faith. Raised in a Christian family of Berber heritage, Monica was given in marriage to Patricius, a pagan official known for his difficult temper. Despite the trials of her domestic life, she lived her faith with humility, kindness, and steadfast prayer, eventually converting both her husband and mother-in-law to Christianity before their deaths.\n\nHer greatest spiritual struggle and triumph came through her son, Augustine, who in his youth lived far from the Christian virtues she cherished. Monica’s tears and prayers for his conversion became legendary; Saint Ambrose of Milan, who befriended her in her later years, famously told her, 'The child of so many tears shall never perish.' After years of anguish, her prayers were answered when Augustine embraced the faith, was baptized by Ambrose in 387, and began the path that would make him one of the greatest Doctors of the Church.\n\nMonica died later that same year in Ostia, Italy, shortly before she was to return to North Africa. Her final words to Augustine expressed her peace and hope in God’s promises: 'Nothing in this world now gives me pleasure. All my hope was in seeing you a Catholic Christian before I die.'\n\nSaint Monica’s life stands as a powerful witness to the transformative strength of prayer, perseverance, and maternal love. She is venerated as the patron saint of mothers, wives, and all those who pray for the conversion of loved ones.",
    "patronage": "Married women, mothers, difficult marriages, disappointing children, and conversion of relatives",
    "canonizationYear": null,
    "imageUrl": "/images/saint_monica.jpg",
    "imageSource": "National Gallery, London / Wikimedia Commons",
    "imageAuthor": "Ary Scheffer (1795–1858)",
    "imageLicence": "Public Domain – faithful photographic reproduction of a two-dimensional public domain artwork (PD-Art, Wikimedia Commons)"
  },
  {
    "name": "Saint Paul the Apostle",
    "birthYear": 5,
    "deathYear": 64,
    "feastDay": "--06-29",
    "biography": "Saint Paul the Apostle, also known as Saul of Tarsus, was born around the year 5 AD in Tarsus, a city in present-day Turkey. A Roman citizen and a devout Jew of the Pharisaic tradition, he was highly educated and zealous in his adherence to the Law. Initially, Paul was a fierce persecutor of the early Christians, believing their movement to be a dangerous heresy. But on the road to Damascus, he experienced a dramatic conversion when the risen Christ appeared to him, calling out, 'Saul, Saul, why are you persecuting me?' (Acts 9:4). This encounter transformed his life completely.\n\nAfter his baptism, Paul dedicated himself entirely to preaching the Gospel. His missionary journeys took him throughout the Roman Empire—from Jerusalem and Antioch to Greece, Asia Minor, and finally Rome—founding and nurturing Christian communities wherever he went. His letters (Epistles) to these early churches form a significant portion of the New Testament and remain central to Christian theology. Through them, Paul articulated key doctrines of the faith: justification by grace through faith, the universality of salvation, and the life of the Church as the Body of Christ.\n\nPaul endured immense hardship—imprisonments, shipwrecks, beatings, and rejection—yet his zeal never diminished. His love for Christ and the Church shone through his words: 'I have fought the good fight, I have finished the race, I have kept the faith' (2 Timothy 4:7). Tradition holds that he was martyred by beheading in Rome around 67 AD during the reign of Emperor Nero.\n\nSaint Paul is venerated as the Apostle to the Gentiles, a brilliant theologian, and a tireless missionary who transformed Christianity from a small Jewish sect into a universal faith. His legacy endures as a powerful witness to conversion, courage, and the boundless mercy of God.",
    "patronage": "Missionaries, theologians, evangelists, writers, and Malta",
    "canonizationYear": null,
    "imageUrl": "/images/saint_paul.jpg",
    "imageSource": "The Metropolitan Museum of Art, New York / Wikimedia Commons",
    "imageAuthor": "Lippo Memmi (1291–1356)",
    "imageLicence": "CC0 1.0 Universal (Public Domain Dedication)"
  },
  {
    "name": "Saint Valentine",
    "birthYear": 225,
    "deathYear": 269,
    "feastDay": "--02-14",
    "biography": "Saint Valentine was a Christian priest or bishop in the Roman Empire during the 3rd century who became renowned for his courage, compassion, and dedication to the young couples of his time. Amidst persecution under Emperor Claudius II, who allegedly forbade marriages to ensure a steady supply of soldiers, Valentine secretly performed weddings and ministered to Christians at risk of execution. \n\nArrested for his defiance and steadfast faith, Valentine endured imprisonment and ultimately martyrdom around 269 AD. His acts of kindness, love, and courage gradually became legendary, inspiring devotion among Christians. Over the centuries, he evolved into a symbol of romantic love, generosity, and selfless commitment. Today, Saint Valentine is remembered not only for his ministry and martyrdom but also as the patron saint of lovers, young people, happy marriages, beekeepers, and those affected by epilepsy.",
    "patronage": "Lovers, young people, happy marriages, epilepsy, and beekeepers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_valentine.jpg",
    "imageSource": "National Gallery of Art",
    "imageAuthor": "Tyrolean 16th Century (anonymous)",
    "imageLicence": "Public Domain – faithful photographic reproduction of a two-dimensional public domain artwork (PD-Art, NGA)"
  },
  {
    "name": "Saint Jude Thaddeus",
    "birthYear": 10,
    "deathYear": 65,
    "feastDay": "--10-28",
    "biography": "Saint Jude Thaddeus, one of the twelve apostles of Jesus Christ, is revered for his unwavering faith and his willingness to bring hope to those in seemingly impossible circumstances. Traditionally identified as a brother of Saint James the Less and a relative of Jesus, Jude preached the Gospel in regions such as Syria and Persia, fearlessly spreading Christian teachings despite great danger.\n\nHe was martyred around 65 AD, remaining steadfast to his mission. Saint Jude is best known as the patron saint of hopeless causes and desperate situations, offering comfort and hope to those facing adversity. He is frequently depicted with a flame above his head symbolizing his zeal for Christ, or holding the Image of Edessa, a miraculous depiction of Jesus. His life continues to inspire faith, courage, and persistence in the face of adversity.",
    "patronage": "Lost causes, desperate situations, hospitals, and desperate cases",
    "canonizationYear": null,
    "imageUrl": "/images/saint_jude_thaddeus.jpg",
    "imageSource": "https://www.johnsanidopoulos.com/2017/06/holy-apostle-jude-of-twelve.html",
    "imageAuthor": "Unknown",
    "imageLicence": "Public domain"
  },
  {
    "name": "Saint Sebastian",
    "birthYear": 255,
    "deathYear": 288,
    "feastDay": "--01-20",
    "biography": "Saint Sebastian was a Roman soldier and Christian martyr of the late 3rd century, renowned for his courage and steadfast faith under persecution. Born around 255 AD, he grew up during a period of intense Christian persecution in the Roman Empire. He eventually joined the Praetorian Guard, the elite bodyguard of the Emperor, but secretly ministered to fellow Christians, providing spiritual support and encouragement despite the risks.\n\nSebastian’s Christian faith was eventually discovered by Emperor Diocletian, and he was sentenced to death by being tied to a tree and shot with arrows. Remarkably, he survived this execution, only to be nursed back to health by Saint Irene. Refusing to hide his beliefs, he continued his ministry and eventually confronted the emperor, which led to his final martyrdom by brutal beating.\n\nSaint Sebastian is venerated as a protector against plagues and illnesses and as a patron of soldiers, athletes, and archers. His iconic depiction—pierced with arrows—symbolizes both his suffering and his unwavering devotion to God. Over the centuries, his story has inspired countless works of art, literature, and devotion. Feast day: January 20th.",
    "patronage": "Soldiers, athletes, archers, plague victims, and those suffering from illness",
    "canonizationYear": null,
    "imageUrl": "/images/saint_sebastian.jpg",
    "imageSource": "Google Arts & Culture",
    "imageAuthor": "Antonello da Messina (1430–1479)",
    "imageLicence": "Public Domain – faithful photographic reproduction of a two-dimensional public domain artwork (PD-Art)"
  },
  {
    "name": "Saint Philomena",
    "birthYear": 291,
    "deathYear": 304,
    "feastDay": "--08-11",
    "biography": "Saint Philomena is celebrated as a virgin martyr whose devotion became widely known after the rediscovery of her tomb in the Catacombs of Priscilla, Rome, in 1802. Though historical documentation is scarce, Christian tradition depicts her as a noble-born girl who dedicated herself to God and vowed to live a life of chastity. During the reign of Emperor Diocletian, when Christians faced severe persecution, Philomena was arrested and subjected to multiple tortures. Legends recount miraculous events that protected her from harm, such as arrows that failed to pierce her and chains that fell off miraculously. Ultimately, she was martyred by beheading at around the age of 13.\n\nFollowing the discovery of her tomb, reports of miraculous healings, answered prayers, and divine protection were attributed to her intercession. Devotion to Saint Philomena spread rapidly, particularly among parents praying for sick children, young people, and those in desperate circumstances. She became a symbol of purity, courage, hope, and divine protection. Iconography often depicts her with arrows and an anchor, representing her martyrdom and steadfast faith. Her feast day is celebrated on August 11th.",
    "patronage": "Infants, babies, youth, babies with illnesses, and treasure hunters",
    "canonizationYear": null,
    "imageUrl": "/images/saint_philomena.jpg",
    "imageSource": "Wikimedia Commons – anonymous 19th-century devotional painting of Saint Philomena",
    "imageAuthor": "Unknown artist (19th century)",
    "imageLicence": "Public Domain – author unknown; image free of known copyright restrictions (PD-Art, Wikimedia Commons)"
  },
  {
    "name": "Mary the Blessed Virgin",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--01-01",
    "biography": "Mary, the Blessed Virgin and Theotokos (Greek for 'God-bearer'), holds the most exalted place among all the saints as the mother of Jesus Christ, the Son of God. Chosen before all ages and prepared by divine grace, Mary was born into a humble Jewish family and lived a life of purity and devotion. Her 'fiat'—her humble acceptance of the angel Gabriel’s message at the Annunciation—opened the way for the Incarnation, when the Word became flesh and dwelt among us. Her obedience, courage, and faith became the model for all disciples.\n\nThroughout her earthly life, Mary accompanied her Son in His mission, from His birth in Bethlehem to His death on Calvary, where she stood beneath the Cross as the compassionate Mother of Sorrows. Her heart, pierced by grief, remained steadfast in trust and love. After Christ’s Resurrection and Ascension, Mary was present among the early Christians at Pentecost, praying with the apostles and nurturing the infant Church with her maternal care.\n\nVenerated with countless titles—Queen of Heaven, Mother of Mercy, Our Lady, and Star of the Sea—Mary has inspired devotion across centuries and cultures. Her Assumption into Heaven and her perpetual intercession for the faithful continue to reveal her as the loving mother of all humanity. The feast of Mary, the Mother of God, celebrated on January 1, honors her divine motherhood and her unique role in salvation history, reminding believers to entrust their lives to her maternal protection and example of perfect faith.",
    "patronage": "All humanity, mothers, women, sailors, and many nations and cities worldwide",
    "canonizationYear": null,
    "imageUrl": "/images/saint_mary.jpg",
    "imageSource": "Metropolitan Museum of Art, New York – Open Access Collection, Object ID 435644",
    "imageAuthor": "Giovanni Bellini (c.1430–1516)",
    "imageLicence": "CC0 1.0 Universal (Public Domain Dedication) – courtesy of The Metropolitan Museum of Art"
  },
  {
    "name": "Our Lady of Lourdes",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--02-11",
    "biography": "Our Lady of Lourdes refers to the series of Marian apparitions experienced by Saint Bernadette Soubirous in 1858 in the small town of Lourdes, France. Between February 11 and July 16, the Blessed Virgin appeared eighteen times to Bernadette, a humble peasant girl, in the grotto of Massabielle. Mary identified herself as 'the Immaculate Conception,' affirming the recently defined dogma and calling all to prayer, penance, and conversion of heart.\n\nDuring these apparitions, Mary requested that a chapel be built at the site and that people come in procession. She pointed Bernadette to a hidden spring of water, which soon became known for miraculous healings. Since then, Lourdes has become one of the most beloved pilgrimage sites in the world, visited by millions seeking physical and spiritual renewal. The spring’s waters, faith, and the message of repentance form the heart of the devotion.\n\nOur Lady of Lourdes represents the tender mercy of God and Mary’s compassion for the sick and suffering. Her presence continues to inspire faith, healing, and hope to this day. The feast on February 11 reminds the faithful of her intercession, her maternal care, and the healing power of divine grace made visible through her love.",
    "patronage": "Lourdes, sickness, healing, pilgrims, the sick",
    "canonizationYear": null,
    "imageUrl": "/images/lady_of_lourdes.jpg",
    "imageSource": "Wikimedia Commons – Virgilio Tojetti: Our Lady of Lourdes (1877)",
    "imageAuthor": "Virgilio Tojetti (1851–1901)",
    "imageLicence": "Public Domain – author died in 1901; faithful photographic reproduction of a two-dimensional public domain artwork (PD-Art, Wikimedia Commons)"
  },
  {
    "name": "Our Lady of Fatima",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--05-13",
    "biography": "Our Lady of Fatima is the title given to the Blessed Virgin Mary following her appearances to three shepherd children—Lucia dos Santos and her cousins Francisco and Jacinta Marto—in Fatima, Portugal, in 1917. Over six months, from May to October, Mary appeared clothed in radiant light, urging humanity to prayer, repentance, and consecration to her Immaculate Heart. Her central message was one of conversion, peace, and trust in God amidst the trials of the modern world.\n\nMary’s apparitions at Fatima included prophetic visions concerning the future of the Church and the world, the spread of atheism, and the call to pray the Rosary daily for the salvation of souls. The final apparition on October 13 was marked by the Miracle of the Sun, witnessed by tens of thousands, a sign of divine confirmation of her message.\n\nThe devotion to Our Lady of Fatima has since spread globally, inspiring countless conversions and renewals of faith. Her requests for prayer and penance continue to echo through the ages as a call to holiness and peace. Celebrated on May 13, the feast honors Mary’s maternal concern for humanity and her enduring call to return to God through prayer and trust in her Immaculate Heart.",
    "patronage": "Peace, the sick, pilgrims, the Catholic Church",
    "canonizationYear": null,
    "imageUrl": "/images/lady_of_fatima.jpg",
    "imageSource": "Wikimedia Commons – José Ferreira Thedim: Sculpture of Our Lady of Fátima (1919–1920)",
    "imageAuthor": "José Ferreira Thedim (1892–1971)",
    "imageLicence": "Public Domain – author died in 1971; image free of known copyright restrictions (PD-Art, Wikimedia Commons)"
  },
  {
    "name": "Our Lady of Guadalupe",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--12-12",
    "biography": "Our Lady of Guadalupe is the title given to the Blessed Virgin Mary following her miraculous appearance to Saint Juan Diego, an indigenous Mexican convert, in December 1531 on the hill of Tepeyac near Mexico City. Mary appeared as a radiant young woman clothed in a mantle of stars and speaking in Juan Diego’s native Nahuatl language. She revealed her desire for a church to be built at the site as a place of compassion and refuge for her children.\n\nAs proof of her appearance, Mary caused roses to bloom miraculously in winter and imprinted her image upon Juan Diego’s tilma (cloak), which remains intact and venerated today in the Basilica of Our Lady of Guadalupe. Her image—filled with profound symbolism blending Christian and indigenous iconography—became a powerful sign of God’s love and the dignity of all peoples.\n\nOur Lady of Guadalupe sparked the conversion of millions across the Americas and became a symbol of unity, hope, and justice for the oppressed. Declared Patroness of the Americas, she continues to be a source of inspiration for devotion and social renewal. Her feast on December 12 celebrates her enduring message of love, reconciliation, and maternal care for all humanity.",
    "patronage": "The Americas, indigenous peoples, Mexico, mothers, unborn children",
    "canonizationYear": null,
    "imageUrl": "/images/our_lady_of_guadalupe.jpg",
    "imageSource": "Wikimedia Commons – Image of Our Lady of Guadalupe on the tilma of Saint Juan Diego, Basilica of Our Lady of Guadalupe, Mexico City",
    "imageAuthor": "Anonymous (16th century)",
    "imageLicence": "Public Domain – artwork created in 1531; faithful photographic reproduction of a two-dimensional public domain artwork (PD-Art, Wikimedia Commons)"
  },
  {
    "name": "The Assumption of Mary",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--08-15",
    "biography": "The Assumption of Mary celebrates the belief that the Blessed Virgin, at the end of her earthly life, was taken body and soul into heavenly glory. This mystery reflects her intimate union with her Son and her freedom from sin and corruption. Though the Scriptures are silent about the manner of her departure, ancient Christian tradition affirmed her glorious assumption as a sign of God’s triumph in her and the destiny awaiting all who remain faithful.\n\nFormally defined as dogma by Pope Pius XII in 1950, the Assumption has been celebrated in both the Eastern and Western Churches for centuries. It marks the culmination of Mary’s earthly journey and her sharing in her Son’s resurrection. In art and devotion, the Assumption is depicted as a moment of radiant joy and divine grace, where Mary is received into the company of angels and saints.\n\nThe feast, observed on August 15, reminds believers of the hope of eternal life and the dignity of the human body redeemed by Christ. Mary’s Assumption proclaims that God’s promises are fulfilled and that love and fidelity are rewarded with glory in His presence.",
    "patronage": "The sick, happy death, the Christian faithful",
    "canonizationYear": null,
    "imageUrl": "/images/assumption_of_mary.jpg",
    "imageSource": "Web Gallery of Art / Wikimedia Commons – Annibale Carracci: Assumption of the Virgin (1600–1602)",
    "imageAuthor": "Annibale Carracci (1560–1609)",
    "imageLicence": "Public Domain – artist died over 400 years ago; faithful photographic reproduction of a two-dimensional public domain artwork (PD-Art, Wikimedia Commons)"
  },
  {
    "name": "The Immaculate Conception",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--12-08",
    "biography": "The Immaculate Conception refers to the unique grace granted to the Virgin Mary, by which she was preserved free from original sin from the very moment of her conception. This singular privilege prepared her to become the pure and worthy Mother of God. Though long held in Christian belief, the doctrine was solemnly defined as dogma by Pope Pius IX in 1854 in the papal bull 'Ineffabilis Deus.'\n\nThis mystery highlights the boundless mercy and foresight of God, who redeemed Mary in anticipation of Christ’s saving work. Her immaculate state is not of her own merit but the fruit of divine grace, making her a model of holiness and obedience. The Immaculate Conception expresses God’s plan of salvation and His victory over sin, prefiguring the redemption offered to all humanity through Christ.\n\nThe feast, celebrated on December 8, invites the faithful to rejoice in Mary’s purity and to seek renewal of heart through God’s grace. The Immaculate Virgin stands as a sign of hope and a reminder that through God’s power, sanctity and love can overcome all darkness.",
    "patronage": "The United States, the Catholic Church, seafarers, and purity",
    "canonizationYear": null,
    "imageUrl": "/images/immaculate_conception.jpg",
    "imageSource": "Museo del Prado, Madrid (https://www.museodelprado.es/coleccion/obra/immaculate-of-soult/P02809)",
    "imageAuthor": "Bartolomé Esteban Murillo (1617–1682)",
    "imageLicence": "Public domain"
  },
  {
    "name": "Saint Bernadette",
    "birthYear": 1844,
    "deathYear": 1879,
    "feastDay": "--02-18",
    "biography": "Saint Bernadette Soubirous was born in 1844 in Lourdes, France, to a poor and devout family. At the age of 14, she experienced a series of Marian apparitions at the Grotto of Massabielle, where the Virgin Mary appeared to her eighteen times, revealing herself as the Immaculate Conception and urging prayer and penance. Bernadette uncovered a spring at the grotto, which became renowned for its healing properties. Known for her humility, simplicity, and obedience, she later joined the Sisters of Charity at Nevers, living a life of service and suffering from illness with quiet devotion. She died in 1879 and was canonized in 1933. Saint Bernadette is venerated as a symbol of faith, perseverance, and hope, particularly for the sick and marginalized.",
    "patronage": "Lourdes, shepherds, bodily illness, and the poor",
    "canonizationYear": 1933,
    "imageUrl": "/images/saint_bernadette.jpg",
    "imageSource": "Wikimedia Commons – photograph of Saint Bernadette Soubirous, circa 1858",
    "imageAuthor": "Unknown photographer (19th century)",
    "imageLicence": "Public Domain – photograph taken before 1900; free of known copyright restrictions (PD-Old, Wikimedia Commons)"
  },
  {
    "name": "Saint Dominic",
    "birthYear": 1170,
    "deathYear": 1221,
    "feastDay": "--08-08",
    "biography": "Saint Dominic, born in 1170 in Caleruega, Spain, was a devoted priest and founder of the Order of Preachers, commonly known as the Dominicans. Deeply concerned by the spread of heresy in southern France, he committed himself to preaching orthodox Christian teaching with clarity, simplicity, and compassion. Dominic emphasized study, prayer, and communal life, creating a mendicant order that engaged actively with the world rather than remaining cloistered. He promoted devotion to the Rosary and fostered education for clergy and laity alike. Saint Dominic died in 1221 and was canonized in 1234. His legacy endures through the Dominican Order, known for scholarship, preaching, and missionary work.",
    "patronage": "Astronomers, natural sciences, Dominican Republic, Santo Domingo",
    "canonizationYear": 1234,
    "imageUrl": "/images/saint_dominic.jpg",
    "imageSource": "Galleria Borghese, Rome – Open Access Collection (Wikimedia Commons)",
    "imageAuthor": "Titian (Tiziano Vecellio, 1490–1576)",
    "imageLicence": "Public Domain – artist died in 1576; faithful photographic reproduction of a two-dimensional public domain artwork (PD-Art, Wikimedia Commons)"
  },
  {
    "name": "Saint Benedict of Nursia",
    "birthYear": 480,
    "deathYear": 547,
    "feastDay": "--07-11",
    "biography": "Saint Benedict of Nursia, born around 480 AD in Italy, is regarded as the father of Western monasticism. Seeking a life of solitude and prayer during a turbulent era, he first lived as a hermit at Subiaco before founding the monastery at Monte Cassino. There he wrote the 'Rule of Saint Benedict,' a practical guide emphasizing balance between prayer, work, and community life. His teachings shaped monasticism across Europe and promoted spiritual, intellectual, and social stability. Benedict's monasteries became centers of learning, hospitality, and cultural preservation. He died in 547 and is venerated as the patron saint of Europe and a model for disciplined, prayerful living.",
    "patronage": "Europe, monasticism, against poison",
    "canonizationYear": null,
    "imageUrl": "/images/saint_benedict.jpg",
    "imageSource": "Metropolitan Museum of Art, New York – Open Access Collection, Object ID 437970",
    "imageAuthor": "Francisco de Zurbarán (1598–1664)",
    "imageLicence": "CC0 1.0 Universal (Public Domain Dedication) – courtesy of The Metropolitan Museum of Art"
  },
  {
    "name": "Saint Luke the Evangelist",
    "birthYear": null,
    "deathYear": 100,
    "feastDay": "--10-18",
    "biography": "Saint Luke the Evangelist, traditionally believed to be a physician and a Gentile from Antioch, is credited with writing the Gospel of Luke and the Acts of the Apostles. He traveled with Saint Paul, documenting the early Church and the spread of Christianity with attention to detail and compassion. Luke's Gospel emphasizes mercy, care for the poor, and the universality of salvation, highlighting Christ’s interactions with marginalized individuals. He is also thought to have painted portraits of the Virgin Mary, making him the patron saint of artists and physicians. Saint Luke’s work continues to inform Christian theology and inspire devotion to the life of Jesus and the early Church.",
    "patronage": "Physicians, artists, notaries, brewers, butchers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_luke.jpg",
    "imageSource": "National Gallery of Art, Washington, D.C. – Open Access Policy",
    "imageAuthor": "Giorgio Vasari (1511–1574)",
    "imageLicence": "Public Domain – artist died in 1574; image released under the National Gallery of Art Open Access Policy (PD-Art)"
  },
  {
    "name": "Saint John Bosco",
    "birthYear": 1815,
    "deathYear": 1888,
    "feastDay": "--01-31",
    "biography": "Saint John Bosco, affectionately known as Don Bosco, was born on August 16, 1815, in the small village of Becchi near Turin, Italy. Orphaned at the age of two, he was raised by his devout mother, Margaret, who instilled in him deep faith and compassion for others. From an early age, John felt called to serve God and help his peers, often organizing games and prayer gatherings for local children while teaching them catechism.\n\nOrdained a priest in 1841, Don Bosco dedicated his ministry to the spiritual and physical well-being of young people, especially those abandoned by society amid the upheavals of industrial Turin. He opened the Oratory of St. Francis de Sales, a refuge that offered food, shelter, education, and vocational training to working-class boys. Believing that love, not fear, transformed hearts, Don Bosco developed his 'Preventive System' of education—based on reason, religion, and loving-kindness—rejecting harsh discipline in favor of personal guidance and encouragement.\n\nTo sustain his mission, he founded the Salesians of Don Bosco in 1859, and later, with Saint Mary Mazzarello, the Daughters of Mary Help of Christians. Together, these religious communities carried his educational and evangelical vision around the world. A man of deep prayer and practical charity, Don Bosco also had mystical experiences, including prophetic dreams guiding his apostolic work. He died in Turin on January 31, 1888, leaving behind a vast legacy of mercy, innovation, and love for youth. Canonized in 1934, Saint John Bosco is venerated as the patron of young people, educators, and all who seek to form hearts with gentleness and joy.",
    "patronage": "Youth, apprentices, editors, publishers, magicians, juvenile delinquents",
    "canonizationYear": 1934,
    "imageUrl": "/images/saint_john_bosco.jpg",
    "imageSource": "Wikimedia Commons – Photograph of Saint John Bosco in Turin, 1880",
    "imageAuthor": "Attributed to Carlo Felice Deasti (d. 1949)",
    "imageLicence": "Public Domain – photograph taken in 1880; copyright expired under Italian Law 633/1941 (Art. 92) and U.S. law (published before 1930)"
  },
  {
    "name": "Saint Matthew",
    "birthYear": 1,
    "deathYear": 74,
    "feastDay": "--09-21",
    "biography": "Saint Matthew the Apostle, also known as Levi, was a tax collector in Capernaum before he was called by Jesus to follow Him. As a publican serving the Roman authorities, Matthew’s profession made him an outcast among his own people, viewed as a sinner and collaborator. Yet when Christ said, 'Follow me,' Matthew immediately rose and left everything behind, embodying the transforming power of divine mercy.\n\nAfter his conversion, Matthew hosted a banquet for Jesus and other tax collectors, prompting criticism from the Pharisees. The Lord’s response—'I have not come to call the righteous but sinners'—forever linked Matthew’s vocation with the Gospel of redemption. Traditionally credited as the author of the first Gospel, Matthew wrote primarily for a Jewish audience, presenting Jesus as the long-awaited Messiah who fulfills the Law and the Prophets. His Gospel reveals Christ as both teacher and savior, emphasizing the Beatitudes, the Kingdom of Heaven, and the call to discipleship.\n\nAfter Pentecost, Saint Matthew is believed to have preached the Gospel in Ethiopia, Persia, or Parthia, enduring trials and persecution before his martyrdom. His unwavering faith and willingness to abandon worldly gain for spiritual truth make him a model for conversion and courage. The Church honors him as a saint who bridges faith and reason, mercy and justice, reminding all believers that no one is beyond the reach of grace.",
    "patronage": "Accountants, bankers, tax collectors, civil servants, perfumers, Salerno, Italy",
    "canonizationYear": null,
    "imageUrl": "/images/saint_matthew.jpg",
    "imageSource": "https://www.ibiblio.org/wm/paint/auth/caravaggio/matthew.jpg",
    "imageAuthor": "Michelangelo Merisi da Caravaggio (1571–1610)",
    "imageLicence": "Public Domain – artist died in 1610; faithful photographic reproduction of a two-dimensional public domain artwork (PD-Art, Wikimedia Commons)"
  },
  {
    "name": "Saint John the Apostle",
    "birthYear": 6,
    "deathYear": 100,
    "feastDay": "--12-27",
    "biography": "Saint John the Apostle, son of Zebedee and Salome and brother of Saint James the Greater, was one of Jesus’ first disciples and among the most beloved. Called from his work as a fisherman on the Sea of Galilee, John followed Christ with total devotion and remained near Him throughout His ministry. With Peter and James, he witnessed the raising of Jairus’ daughter, the Transfiguration, and the agony in the Garden of Gethsemane. At the Cross, John alone of the apostles remained, standing beside the Virgin Mary as Jesus entrusted her to his care, saying, 'Behold your mother.'\n\nTradition holds that John later cared for Mary in Ephesus and played a vital role in the early Church. He is credited with writing the Gospel of John—a profound theological masterpiece emphasizing love, light, and the divine nature of Christ—as well as three Epistles and the Book of Revelation, written during his exile on the island of Patmos. His Gospel’s contemplative depth and spiritual symbolism have earned him the title 'The Theologian.'\n\nJohn’s life reflects purity, spiritual insight, and fidelity. Unlike the other apostles, he is believed to have died peacefully in old age, around the year 100, after decades of preaching and teaching. He is honored as the patron of love, friendship, and writers, representing the mystical heart of Christian revelation. His message—'God is love'—continues to illuminate the faith of countless believers throughout the ages.",
    "patronage": "Love, loyalty, friendships, authors, booksellers, editors, publishers, scholars, theologians, poison-victims, art-dealers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_john.jpg",
    "imageSource": "National Gallery of Art, Washington, D.C.",
    "imageAuthor": "Giorgio Vasari (1511–1574)",
    "imageLicence": "Public Domain – This image is released under the National Gallery of Art Open Access Policy (CC0 1.0)."
  },
  {
    "name": "Saint Thomas the Apostle",
    "birthYear": null,
    "deathYear": 72,
    "feastDay": "--07-03",
    "biography": "Saint Thomas, one of the twelve apostles chosen by Jesus, is widely remembered as 'Doubting Thomas' due to his initial skepticism about the Resurrection. Born in Galilee and sometimes called Didymus, meaning 'twin,' Thomas was deeply loyal, courageous, and passionate, though prone to doubt. His defining moment came after the Crucifixion, when he refused to believe in the risen Christ without seeing and touching His wounds. Upon encountering Jesus, Thomas fell to his knees and proclaimed, 'My Lord and my God,' a confession that became a cornerstone of Christian faith. After Pentecost, Thomas is traditionally believed to have traveled as far as India, establishing Christian communities, baptizing converts, and ordaining priests. He was martyred around 72 AD in Mylapore, near modern-day Chennai, India. His legacy endures through the Saint Thomas Christians of India, symbolizing a journey from doubt to conviction and the courage to spread the Gospel.",
    "patronage": "Architects, builders, India, Sri Lanka, those struggling with doubt",
    "canonizationYear": null,
    "imageUrl": "/images/saint_thomas.jpg",
    "imageSource": "Sanssouci Picture Gallery / Wikimedia Commons",
    "imageAuthor": "Caravaggio (1571–1610)",
    "imageLicence": "Public Domain (faithful photographic reproduction of a two-dimensional work of art; PD-Art tag applicable in the United States)"
  },
  {
    "name": "Saints Perpetua and Felicity",
    "birthYear": null,
    "deathYear": 203,
    "feastDay": "--03-07",
    "biography": "Saint Perpetua, a young noblewoman, and Saint Felicity, her enslaved companion, were early Christian martyrs who died in Carthage around 203 AD during Roman persecutions. Arrested for their faith, Perpetua maintained a diary in prison, documenting her visions, spiritual reflections, and courage, providing one of the earliest first-person accounts of Christian martyrdom. Felicity, pregnant at the time, gave birth while imprisoned and faced execution alongside Perpetua. Both women refused to renounce their faith, enduring imprisonment and the arena with steadfast devotion. They were ultimately martyred by wild beasts and the sword. Their witness has inspired generations, particularly mothers and those facing persecution, as models of courage, devotion, and maternal love.",
    "patronage": "Mothers, expectant mothers, Carthage",
    "canonizationYear": null,
    "imageUrl": "/images/saint_perpetua_felicity.jpg",
    "imageSource": "National Museum in Warsaw / Wikimedia Commons",
    "imageAuthor": "Anonymous",
    "imageLicence": "Public Domain (faithful photographic reproduction of a two-dimensional work of art; PD-Art tag applicable in the United States)"
  },
  {
    "name": "Saint Catherine of Bologna",
    "birthYear": 1413,
    "deathYear": 1463,
    "feastDay": "--03-09",
    "biography": "Saint Catherine of Bologna, born in 1413 in Bologna, Italy, was a Poor Clare nun renowned for her deep spirituality, humility, and artistic talent. From an early age, she was drawn to prayer, ascetic discipline, and service. Catherine devoted her life to contemplation and charity while also creating religious art, including illuminated manuscripts and devotional paintings, which reflected her mystical experiences and love for God. She founded a convent in Bologna focused on strict observance and compassionate ministry, mentoring novices and fellow sisters. Catherine wrote extensively on mystical theology, offering guidance on prayer, humility, and resisting temptation. Renowned for her holiness and miracles, she was canonized in 1712. She is venerated as the patron saint of artists, miniaturists, and those seeking strength against temptation, and her legacy continues to inspire religious communities and artists worldwide.",
    "patronage": "Artists, miniaturists, those resisting temptation",
    "canonizationYear": 1712,
    "imageUrl": "/images/saint_catherine_of_bologna.jpg",
    "imageSource": "The Courtauld Gallery / Art UK",
    "imageAuthor": "Master of the Baroncelli Portraits (c.1470–1480)",
    "imageLicence": "Public Domain (faithful photographic reproduction of a two-dimensional work of art; PD-Art tag applicable in the United States)"
  },
  {
    "name": "Saint Martha",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--07-29",
    "biography": "Saint Martha, sister of Mary and Lazarus, is a prominent figure in the New Testament, celebrated for her devotion to Jesus and her practical service. She is most notably remembered in the Gospel accounts for welcoming Jesus into her home and attending to the needs of her household, balancing active service with faith. In the episode where she contrasts with her sister Mary, who chose to sit and listen to Jesus, Martha embodies the principle that faith and action are complementary. Beyond her role in Scripture, tradition holds that she traveled and preached in various regions, spreading the message of Christ. Over the centuries, Martha’s example has inspired Christians to combine hospitality, diligent service, and spiritual attentiveness in daily life. She is honored for her steadfast faith, her willingness to serve others, and her dedication to the work of loving action.",
    "patronage": "Cooks, homemakers, servants, hospitality workers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_martha.jpg",
    "imageSource": "Metropolitan Museum of Art / Art UK",
    "imageAuthor": "Sano di Pietro (c.1460–1470)",
    "imageLicence": "CC0 1.0 Universal Public Domain Dedication"
  },
  {
    "name": "Saint James the Greater",
    "birthYear": null,
    "deathYear": 44,
    "feastDay": "--07-25",
    "biography": "Saint James the Greater, son of Zebedee and brother of John the Evangelist, was one of Jesus' twelve apostles and part of His inner circle. He witnessed pivotal events such as the Transfiguration and the Agony in the Garden of Gethsemane. Tradition holds that after Christ’s Resurrection and Ascension, James traveled to the Iberian Peninsula to preach the Gospel, establishing early Christian communities in what is now Spain. His missionary efforts and leadership made him one of the first apostles to be martyred, executed by King Herod Agrippa I around 44 AD. Over time, Saint James became the patron saint of pilgrims and travelers, and the Camino de Santiago pilgrimage in Spain remains one of the most enduring symbols of his spiritual legacy. His life exemplifies courage, missionary zeal, and unwavering dedication to spreading the Christian faith.",
    "patronage": "Pilgrims, Spain, laborers, surgeons",
    "canonizationYear": null,
    "imageUrl": "/images/james_greater.jpg",
    "imageSource": "Museum of Fine Arts, Houston / Google Arts & Culture",
    "imageAuthor": "Guido Reni (c.1636–1638)",
    "imageLicence": "Public Domain (faithful photographic reproduction of a two-dimensional work of art; PD-Art tag applicable in the United States)"
  },
  {
    "name": "Saint Jerome",
    "birthYear": 347,
    "deathYear": 420,
    "feastDay": "--09-30",
    "biography": "Saint Jerome, born in 347 in Stridon in the Roman province of Dalmatia, is widely recognized as one of the greatest Christian scholars of the early Church. Devoted to the study of Scripture, Jerome spent years in rigorous scholarship, linguistic study, and ascetic living, often as a hermit in the Syrian desert. He is best known for translating the Bible into Latin, producing the Vulgate, which became the standard Bible for the Western Church for centuries. Jerome’s writings, commentaries, and letters reveal a deep understanding of theology, biblical languages, and Christian doctrine. He was known for his fiery temperament, passionate defense of orthodoxy, and commitment to spiritual discipline. Legends surrounding Jerome, such as his care for a lion he rescued from a thorn, illustrate his compassionate and pious character. Saint Jerome’s work left an enduring legacy on biblical scholarship, Christian thought, and monastic education.",
    "patronage": "Librarians, translators, scholars, students, archaeologists",
    "canonizationYear": null,
    "imageUrl": "/images/saint_jerome.jpg",
    "imageSource": "Galleria Borghese / Wikimedia Commons",
    "imageAuthor": "Caravaggio (c.1605–1606)",
    "imageLicence": "Public Domain (faithful photographic reproduction of a two-dimensional work of art; PD-Art tag applicable in the United States)"
  },
  {
    "name": "Saint Barbara",
    "birthYear": null,
    "deathYear": 290,
    "feastDay": "--12-04",
    "biography": "Saint Barbara, a legendary early Christian martyr, is remembered for her unwavering faith in the face of persecution during the Roman Empire. According to tradition, she was confined in a tower by her pagan father to protect her from the outside world. During her imprisonment, she secretly converted to Christianity, embracing the faith despite imminent danger. When her father discovered her conversion, he handed her over to Roman authorities, and Barbara endured torture before being executed by beheading at his own hand. Following this, legend tells that her father was struck by lightning and killed, solidifying Barbara’s association with protection against sudden death and natural disasters, especially fire and lightning. Over the centuries, she became a revered figure among artillerymen, miners, and workers who handle explosives, symbolizing courage, steadfast faith, and divine protection under hazardous circumstances.",
    "patronage": "Artillerymen, miners, architects, and others who work with explosives",
    "canonizationYear": null,
    "imageUrl": "/images/saint_barbara.jpg",
    "imageSource": "Museo del Prado / Fundación Goya en Aragón",
    "imageAuthor": "Francisco Goya (c.1772)",
    "imageLicence": "Public Domain (faithful photographic reproduction of a two-dimensional work of art; PD-Art tag applicable in the United States)"
  },
  {
    "name": "Saint Helena",
    "birthYear": 246,
    "deathYear": 330,
    "feastDay": "--08-18",
    "biography": "Saint Helena, born in 246, rose from humble beginnings to become the mother of Constantine the Great, the first Christian Roman Emperor. She is celebrated for her devout Christian faith, charitable works, and influence on the spread of Christianity within the Roman Empire. Helena undertook a pilgrimage to the Holy Land, where she is traditionally credited with discovering the True Cross—the cross upon which Jesus was crucified. She also commissioned the construction of churches at key Christian sites, including the Church of the Nativity in Bethlehem and the Church of the Holy Sepulchre in Jerusalem. Her legacy encompasses religious devotion, the preservation of Christian relics, and the architectural shaping of early Christian sacred spaces.",
    "patronage": "Empresses, converts, archaeologists, and difficult marriages",
    "canonizationYear": null,
    "imageUrl": "/images/saint_helena.jpg",
    "imageSource": "Künzil Brothers, Switzerland",
    "imageAuthor": "Fridolin Leiber",
    "imageLicence": "Creative Commons CC0 1.0 Universal Public Domain Dedication"
  },
  {
    "name": "Saint Bridget of Sweden",
    "birthYear": 1303,
    "deathYear": 1373,
    "feastDay": "--07-23",
    "biography": "Saint Bridget of Sweden was a noblewoman, mystic, and visionary who founded the Bridgettine Order, one of the first monastic orders for women. Born into Swedish nobility in 1303, she married and had children before dedicating her life to God following the death of her husband. Bridget experienced profound spiritual visions and undertook pilgrimages to Rome and the Holy Land, advocating for Church reform and peace. She dictated the 'Revelations of St. Bridget,' which had a lasting influence on Christian spirituality. Canonized in 1391, she was later named one of the six patron saints of Europe. Her legacy lives on in the Bridgettine monastic communities and her spiritual writings that continue to inspire devotion.",
    "patronage": "Sweden, Europe, widows, childbirth, and against famine",
    "canonizationYear": 1391,
    "imageUrl": "/images/saint_brigitte.jpg",
    "imageSource": "Cook collection / York Art Gallery",
    "imageAuthor": "Maso da San Friano (c.1540s)",
    "imageLicence": "Public Domain (faithful photographic reproduction of a two-dimensional work of art; PD-Art tag applicable in the United States)"
  },
  {
    "name": "Saint Anne",
    "birthYear": null,
    "deathYear": 4,
    "feastDay": "--07-26",
    "biography": "Saint Anne is venerated as the mother of the Virgin Mary and grandmother of Jesus Christ. Though not mentioned in the canonical Bible, her story is preserved in apocryphal texts, including the Protoevangelium of James. Tradition holds that Anne and her husband Joachim were long childless before the miraculous conception of Mary. Saint Anne is honored as a model of pious motherhood, faith, and patience, particularly by women seeking children. She has inspired countless works of art and devotion throughout history, and numerous churches are dedicated in her honor. She is revered as a powerful intercessor and protector of families within Catholic and Orthodox traditions.",
    "patronage": "Mothers, women in labor, miners, and cabinetmakers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_anne.jpg",
    "imageSource": "Various historical sources",
    "imageAuthor": "Anonymous (author died 1457)",
    "imageLicence": "Public Domain (faithful photographic reproduction of a two-dimensional work of art; PD-Art tag applicable in the United States)"
  },
  {
    "name": "Saint Lawrence",
    "birthYear": 225,
    "deathYear": 258,
    "feastDay": "--08-10",
    "biography": "Saint Lawrence, born in 225, served as a deacon of the early Church in Rome and is remembered for his charitable works and heroic martyrdom. During the persecution under Emperor Valerian, Lawrence was entrusted with the Church's wealth and distributed it to the poor and needy. When ordered to surrender the treasures, he famously presented the poor as the true riches of the Church. As punishment, he was martyred by being roasted alive on a gridiron, demonstrating courage, faith, and wit throughout his torture. Saint Lawrence is one of the most venerated early Christian martyrs, frequently depicted with a gridiron and honored as the patron saint of cooks, librarians, comedians, and the poor.",
    "patronage": "Archivists, librarians, cooks, comedians, and the poor",
    "canonizationYear": null,
    "imageUrl": "/images/saint_lawrence.jpg",
    "imageSource": "Metropolitan Museum of Art / The Met collection",
    "imageAuthor": "Filippo Lippi (1406–1469)",
    "imageLicence": "Public Domain (Creative Commons CC0 1.0 Universal Public Domain Dedication; faithful photographic reproduction of a two-dimensional work of art)"
  },
  {
    "name": "Saint James the Lesser",
    "birthYear": null,
    "deathYear": 62,
    "feastDay": "--05-03",
    "biography": "Saint James the Lesser, also known as James the Just, was one of the twelve apostles of Jesus and traditionally regarded as the first bishop of Jerusalem. He played a central role in the early Church, particularly in mediating debates about the observance of Jewish law among Gentile converts. He presided over the Council of Jerusalem, guiding the early Christian community through critical decisions. Tradition holds that he was martyred by being thrown from the pinnacle of the Temple and then beaten to death. Revered for his wisdom and leadership, James earned the title 'the Just' and is especially venerated in both the Eastern Orthodox and Catholic Churches for his steadfast faith and guidance.",
    "patronage": "Pharmacists, dying people, and Jews",
    "canonizationYear": null,
    "imageUrl": "/images/saint_james_lesser.jpg",
    "imageSource": "Toledo Cathedral / Apostolado Toledo Cathedral",
    "imageAuthor": "El Greco (1541–1614)",
    "imageLicence": "Public Domain (faithful photographic reproduction of a two-dimensional work of art; PD-Art tag applicable in the United States)"
  },
  {
    "name": "Saint Athanasius",
    "birthYear": 296,
    "deathYear": 373,
    "feastDay": "--05-02",
    "biography": "Saint Athanasius, born in Alexandria, Egypt, in 296, rose to become one of the most influential Church Fathers and the Bishop of Alexandria. He is renowned for his unwavering defense of Trinitarian Christianity against Arianism, a heresy that denied the divinity of Christ. Athanasius authored numerous theological works, with his seminal treatise 'On the Incarnation' remaining foundational to Christian thought. Throughout his life, he endured multiple exiles, opposition, and political intrigue due to his steadfast commitment to orthodox doctrine. His leadership was critical in shaping the Nicene Creed and affirming the full divinity of Jesus Christ. Beyond his theological writings, Athanasius was also a pastoral leader, committed to the care of his flock and the preservation of the Christian faith. His enduring legacy as a Doctor of the Church highlights his role in defining the intellectual and spiritual contours of early Christianity.",
    "patronage": "Theologians and against desecration of the Eucharist",
    "canonizationYear": null,
    "imageUrl": "/images/saint_athanasius.jpg",
    "imageSource": "Varna Archaeological Museum, Varna, Bulgaria",
    "imageAuthor": "Unknown author",
    "imageLicence": "Public Domain (faithful photographic reproduction of a two-dimensional work of art; PD-Art tag applicable in the United States)"
  },
  {
    "name": "Saint Longinus",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--10-16",
    "biography": "Saint Longinus, traditionally identified as the Roman centurion who pierced the side of Jesus during the crucifixion, is remembered as a symbol of conversion and redemption. According to Christian tradition, Longinus was blind or had impaired vision until the moment Christ’s blood touched him, healing him and inspiring his immediate conversion. He embraced the Christian faith with fervor and became a missionary, spreading the message of Christ, though historical details of his life and death are largely lost to legend. Longinus is venerated as a martyr and is often depicted in Christian art holding the Holy Lance, also known as the Spear of Destiny. His story emphasizes the transformative power of faith, the victory of spiritual insight over doubt, and the courage to proclaim one’s belief despite danger.",
    "patronage": "Blind people, soldiers, and lance-men",
    "canonizationYear": null,
    "imageUrl": "/images/saint_longinus.jpg",
    "imageSource": "http://www.agiograf.globalfolio.net/gallery/longinus/03long.htm",
    "imageAuthor": "Fyodor Zubov (Фёдор Зубов, ? — 1689)",
    "imageLicence": "Public Domain (faithful photographic reproduction of a two-dimensional work of art; PD-Art tag applicable in the United States)"
  },
  {
    "name": "Saint Bonaventure",
    "birthYear": 1221,
    "deathYear": 1274,
    "feastDay": "--07-15",
    "biography": "Saint Bonaventure, born Giovanni di Fidanza in Bagnoregio, Italy, in 1221, was a Franciscan friar, theologian, and philosopher who became known as the 'Seraphic Doctor' due to his deep mystical spirituality and intellectual rigor. Educated at the University of Paris, he merged Aristotelian thought with Christian theology, producing influential works on philosophy, theology, and mystical contemplation. As Minister General of the Franciscan Order, he guided the community through challenges while emphasizing poverty, humility, and service. His writings, including the celebrated 'Journey of the Mind to God,' explore the soul’s ascent to divine union and remain central to Christian mysticism. Bonaventure’s influence extended beyond scholarship, shaping pastoral care, the education of friars, and the spiritual life of the Church. He was canonized in 1482 and is venerated as a Doctor of the Church for his integration of intellect, faith, and devotion.",
    "patronage": "Theologians and philosophers",
    "canonizationYear": 1482,
    "imageUrl": "/images/saint_bonaventure.jpg",
    "imageSource": "National Gallery of Canada",
    "imageAuthor": "Claude François (1614–1685)",
    "imageLicence": "Public Domain (faithful photographic reproduction of a two-dimensional work of art; PD-Art tag applicable in the United States)"
  },
  {
    "name": "Saint Bartholomew",
    "birthYear": null,
    "deathYear": 69,
    "feastDay": "--08-24",
    "biography": "Saint Bartholomew, traditionally identified with Nathanael from the Gospel of John, was one of the Twelve Apostles of Jesus Christ and a prominent early Christian missionary. According to tradition, he preached the Gospel in distant regions including India, Mesopotamia, and Armenia, boldly confronting persecution while converting many to Christianity. Bartholomew is most famously remembered for his martyrdom, which accounts often describe as being flayed alive and subsequently beheaded, a testament to his unwavering faith. Throughout history, he has inspired countless believers with his courage, missionary zeal, and steadfast commitment to spreading the teachings of Christ. His veneration spans multiple countries and cultures, with patronage including leatherworkers, tanners, and those suffering from skin disorders, reflecting both his martyrdom and the trades historically associated with his devotion.",
    "patronage": "Armenia, leatherworkers, tanners, butchers, plasterers, bookbinders, shoemakers, neurological and skin diseases, salt merchants, and others",
    "canonizationYear": null,
    "imageUrl": "/images/saint_bartholomew.jpg",
    "imageSource": "Timken Museum of Art",
    "imageAuthor": "Rembrandt (1606–1669)",
    "imageLicence": "Public Domain (faithful photographic reproduction of a two-dimensional work of art; PD-Art tag applicable in the United States)"
  },
  {
    "name": "Saint Matthias",
    "birthYear": null,
    "deathYear": 80,
    "feastDay": "--05-14",
    "biography": "Saint Matthias, chosen by lot to replace Judas Iscariot as one of the Twelve Apostles, was a faithful follower of Jesus from the time of His baptism until His Ascension. Selected for his steadfast devotion and proven commitment, Matthias became an apostolic witness to the early Christian community. Tradition places his missionary activity in Judea, Cappadocia, and Colchis (modern-day Georgia), where he spread the Gospel and endured persecution. Accounts suggest that he suffered martyrdom either by beheading after stoning or crucifixion, although details vary. Matthias’s story underscores fidelity, perseverance, and the importance of discernment within the early Church. He is remembered as a patron for those seeking hope, strength, and steadfastness in the face of trials.",
    "patronage": "Carpenters, tailors, those suffering from alcoholism, smallpox sufferers, the Diocese of Gary (Indiana), the Diocese of Great Falls‑Billings (Montana), hope, perseverance",
    "canonizationYear": null,
    "imageUrl": "/images/saint_matthias.jpg",
    "imageSource": "Musée Toulouse-Lautrec",
    "imageAuthor": "After Georges de La Tour (1593–1652)",
    "imageLicence": "Public Domain (faithful photographic reproduction of a two-dimensional work of art; PD-Art tag applicable in the United States)"
  },
  {
    "name": "Saint John Henry Newman",
    "birthYear": 1801,
    "deathYear": 1890,
    "feastDay": "--10-09",
    "biography": "Saint John Henry Newman was an English theologian, priest, and cardinal who played a pivotal role in 19th-century religious thought. Born on February 21, 1801, in London, Newman was initially ordained in the Anglican Church and became a leading figure of the Oxford Movement, which sought to reintroduce Catholic traditions within Anglicanism. Through deep study and spiritual discernment, he converted to Catholicism in 1845, a decision that profoundly influenced religious discourse in England. After his conversion, Newman was ordained a Catholic priest and established the Oratory of Saint Philip Neri in Birmingham, providing a center for spiritual formation and pastoral work. He authored numerous theological and philosophical works, including the influential 'Apologia Pro Vita Sua,' defending his faith and explaining his spiritual journey, and 'The Idea of a University,' exploring the relationship between faith and education. In 1879, he was elevated to cardinal by Pope Leo XIII. Newman’s thought emphasized the development of doctrine, the role of conscience, and the spiritual formation of the laity, making him one of the most important Catholic intellectuals of the 19th century. He was canonized by Pope Francis in 2019 and remains a model of intellectual rigor, faithfulness, and pastoral concern.",
    "patronage": "Seekers of truth, educators, converts",
    "canonizationYear": 2019,
    "imageUrl": "/images/saint_newman.jpg",
    "imageSource": "Photo taken of John Henry Newman at the end of his life",
    "imageAuthor": "Babouba",
    "imageLicence": "Public domain (author deceased more than 100 years ago; free of known restrictions under copyright law)"
  },
  {
    "name": "Saint Agatha",
    "birthYear": 231,
    "deathYear": 251,
    "feastDay": "--02-05",
    "biography": "Saint Agatha was a Christian martyr from Catania, Sicily, whose courage and faith continue to inspire the faithful. Born around 231, she dedicated herself to God and took a vow of chastity, resisting the advances of a Roman official named Decius or Quintianus. Her refusal provoked severe persecution, and she endured brutal torture, including the mutilation of her breasts, yet remained steadfast in her devotion. Agatha’s faith and courage made her an enduring symbol of resilience and purity. She is particularly invoked for protection against fire, volcanic eruptions—especially Mount Etna—and breast cancer. Her steadfastness under persecution and her role as a protector of those suffering injustice have ensured her veneration across centuries, and she remains a beloved saint in Sicily and throughout the Christian world.",
    "patronage": "Breast cancer patients, rape survivors, nurses, Catania, Sicily, volcanic eruptions, fire, wet nurses",
    "canonizationYear": null,
    "imageUrl": "/images/saint_agatha.jpg",
    "imageSource": "Various historical sources",
    "imageAuthor": "Anonymous",
    "imageLicence": "Public Domain (faithful photographic reproduction of a two-dimensional work of art; PD-Art tag applicable in the United States)"
  },
  {
    "name": "Saint Maximilian Kolbe",
    "birthYear": 1894,
    "deathYear": 1941,
    "feastDay": "--08-14",
    "biography": "Saint Maximilian Maria Kolbe was a Polish Franciscan friar, priest, and missionary born in 1894 in Zduńska Wola, Poland. Known for his deep devotion to the Virgin Mary, he founded the Militia Immaculatae movement, aiming to spread Marian devotion and promote spiritual renewal. Kolbe was also a prolific publisher, producing religious periodicals that encouraged faith and piety. During World War II, he was arrested by the Nazis for aiding Jews and resistance fighters and sent to Auschwitz. When a prisoner was selected to die by starvation as punishment for an escape, Kolbe voluntarily took his place, offering his life in an extraordinary act of self-sacrifice. He endured two weeks in the starvation cell before being executed with an injection of carbolic acid on August 14, 1941. Beatified in 1971 and canonized in 1982, Maximilian Kolbe is venerated as a martyr of charity, exemplifying ultimate love, courage, and compassion for others even unto death.",
    "patronage": "Drug addicts, prisoners, families, journalists, the pro‑life movement, survivors of concentration camps",
    "canonizationYear": 1982,
    "imageUrl": "/images/saint_kolbe.jpg",
    "imageSource": "http://santuarioeucaristico.blogspot.hu/2010/08/sao-maximiliano-kolbe-14-de-agosto.html",
    "imageAuthor": "Unknown author",
    "imageLicence": "Public Domain"
  },
  {
    "name": "Saint Teresa of Calcutta",
    "birthYear": 1910,
    "deathYear": 1997,
    "feastDay": "--09-05",
    "biography": "Saint Teresa of Calcutta, born Anjezë Gonxhe Bojaxhiu on August 26, 1910, in Skopje (then part of the Ottoman Empire), devoted her life to serving the poorest of the poor. She joined the Sisters of Loreto in Ireland and later moved to India, where she founded the Missionaries of Charity in Kolkata. Through her work with the destitute, sick, and dying, she became a worldwide symbol of compassion, humility, and selfless service. Her efforts earned her the Nobel Peace Prize in 1979, and she continued her ministry until her death on September 5, 1997. Canonized by Pope Francis in 2016, Mother Teresa is remembered as a living testament to mercy, love, and tireless dedication to humanity, inspiring generations to serve those in need.",
    "patronage": "World Youth Day, Missionaries of Charity, Archdiocese of Calcutta",
    "canonizationYear": 2016,
    "imageUrl": "/images/saint_mother_theresa.jpg",
    "imageSource": "Own work (Wikimedia Commons upload)",
    "imageAuthor": "Ariesk88",
    "imageLicence": "Creative Commons CC0 1.0 Universal Public Domain Dedication"
  },
  {
    "name": "Saint Michael the Archangel",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--09-29",
    "biography": "Saint Michael the Archangel is one of the principal angels in Christian theology, revered as the leader of the heavenly armies against the forces of evil. Mentioned in biblical texts including the Book of Daniel, Revelation, and Jude, Michael is seen as the protector of God’s people, a defender of the Church, and a guide for souls at the hour of death. Christians invoke him for protection, spiritual strength, and courage in facing moral and physical dangers. Celebrated on the feast of Michaelmas on September 29, he is depicted in art as a warrior angel, often wielding a sword and triumphing over Satan. His role as a guardian and spiritual warrior has made him one of the most venerated and universally recognized archangels in the Christian tradition.",
    "patronage": "Military, police, bankers, grocers, the Church, dying people, poor souls",
    "canonizationYear": null,
    "imageUrl": "/images/archangel_michael.jpg",
    "imageSource": "Metropolitan Museum of Art, European Paintings",
    "imageAuthor": "Ignacio de Ries",
    "imageLicence": "Creative Commons CC0 1.0 Universal Public Domain Dedication"
  },
  {
    "name": "Saint Raphael the Archangel",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--09-29",
    "biography": "Saint Raphael the Archangel is one of the three archangels named in Scripture and is most prominently featured in the Old Testament Book of Tobit. Disguised under the name Azarias, Raphael journeys with the young Tobias, guiding him safely through dangerous lands, protecting him from demons, and ultimately instructing him in the healing of his father Tobit’s blindness through the use of a fish’s gall. Because of these actions, Raphael is regarded throughout Christian tradition as a divine healer and protector. Beyond the Book of Tobit, Christian tradition understands Raphael as one of the seven archangels who stand before the throne of God. His name means “God heals,” reflecting his role in offering both physical and spiritual restoration. Over the centuries, Raphael has been embraced by travelers, medical workers, young people, and those seeking discernment or protection. In Christian iconography, Raphael is often depicted holding a staff and a fish—symbols recalling his guidance of Tobias and the means by which healing was accomplished. Although no specific canonization year exists, the Church honors Raphael alongside Michael and Gabriel on September 29. His presence embodies God’s providence, healing, and guidance for all who journey through life.",
    "patronage": "Travelers, young people, the sick, nurses, shepherds, pharmacists, healing, finding one's spouse",
    "canonizationYear": null,
    "imageUrl": "/images/archangel_raphael.jpg",
    "imageSource": "Pushkin Museum of Fine Arts; original source page: http://www.arts-museum.ru/",
    "imageAuthor": "Bartolomé Esteban Murillo; photographic reproduction transferred from English Wikipedia",
    "imageLicence": "Public domain (faithful reproduction of a 2D public-domain artwork; uploader released into the public domain; PD-Art)"
  },
  {
    "name": "Saint Elizabeth of Hungary",
    "birthYear": 1207,
    "deathYear": 1231,
    "feastDay": "--11-17",
    "biography": "Saint Elizabeth of Hungary was born a princess, the daughter of King Andrew II of Hungary and Queen Gertrude of Merania. Sent at a young age to the court of Thuringia, she grew up amid political complexity yet developed a deep interior life marked by compassion and devotion. Elizabeth married Ludwig IV, Landgrave of Thuringia, and their union is remembered as one of mutual tenderness, virtue, and shared piety. Despite her noble status, Elizabeth consistently engaged in acts of charity, distributing bread to the hungry, building hospitals, and caring personally for the sick and the poor. A famous legend recounts that when she was confronted by suspicious courtiers and ordered to reveal what she carried beneath her cloak, the bread she hid miraculously transformed into roses—symbolizing divine approval of her charity. In 1227, Ludwig died while en route to the Crusades, leaving Elizabeth widowed at age 20. Rejecting the comforts of nobility, she embraced an austere life inspired by the emerging Franciscan movement. She used her dowry to build a hospital dedicated to the poor in Marburg, where she personally served the ill and destitute until her death at only 24 years old. Her heroic charity and unwavering dedication to the poor led to her rapid canonization in 1235. She remains one of the most beloved saints in Europe and a model of Christian compassion exercised through both spiritual devotion and concrete acts of mercy.",
    "patronage": "Hospitals, nurses, widows, brides, bakers, homeless people, exiles, dying children, falsely accused people, lace‑makers, Teutonic Order, Third Order of St. Francis",
    "canonizationYear": 1235,
    "imageUrl": "/images/saint_elizabeth_hungary.jpg",
    "imageSource": "Detroit Institute of Arts; DIA object page: https://www.dia.org/art/collection/object/saint-elizabeth-hungary-54513",
    "imageAuthor": "Hugues Merle; photographic reproduction via Detroit Institute of Arts / Wikimedia Commons",
    "imageLicence": "Public domain (faithful photographic reproduction of a 2D public-domain artwork; PD-Art)"
  },
  {
    "name": "Saint Gabriel the Archangel",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--09-29",
    "biography": "Saint Gabriel the Archangel is one of the foremost messengers of God in Judeo-Christian tradition and plays a pivotal role in salvation history. His name means “God is my strength,” reflecting the power and clarity he brings to divine communication. Gabriel appears primarily in the Book of Daniel and the Gospel of Luke, though he is present in a wide range of apocryphal and early Christian writings. In Daniel, Gabriel interprets visions concerning the fate of Israel, revealing mysteries that would shape Jewish understanding of prophecy. In the New Testament, Gabriel’s most renowned moment comes during the Annunciation: he appears to the Virgin Mary to proclaim that she has been chosen to bear the Son of God. His message initiates the Incarnation, making him central to Christian belief in God's entrance into human history. Tradition also attributes to Gabriel the announcement of the births of John the Baptist and Jesus, highlighting his identity as a divine herald. Throughout Christian art, Gabriel is portrayed as radiant, often holding a lily or a scroll bearing the words of the Annunciation. Celebrated with Michael and Raphael on September 29, he remains the patron of messengers, broadcasters, writers, and all who seek to communicate truth.",
    "patronage": "Messengers, communication workers, postal and telecommunications workers",
    "canonizationYear": null,
    "imageUrl": "/images/archangel_gabriel.jpg",
    "imageSource": "Derived from: Annunciation by El Greco (1570–1575, Prado).jpg",
    "imageAuthor": "Unknown photographer (Wikimedia Commons derivative file)",
    "imageLicence": "Public Domain (PD-Art)"
  },
  {
    "name": "Saint Mary Magdalene",
    "birthYear": 8,
    "deathYear": null,
    "feastDay": "--07-22",
    "biography": "Saint Mary Magdalene is one of the most influential and faithfully portrayed women in the New Testament. Described in the Gospels as a woman healed by Jesus from seven demons, she responded to this transformation with wholehearted discipleship. She traveled with Jesus, supported his ministry, and remained steadfast even when many others fled during his Passion. Mary Magdalene was present at the Crucifixion, witnessed Jesus’ burial, and—most importantly—was the first to encounter the Risen Christ on Easter morning in the garden near the empty tomb. Jesus entrusted her with the mission of announcing his Resurrection to the Apostles, leading the early Church to honor her as “Apostle to the Apostles.” Over centuries, interpretations of her life blended with legends and misidentifications with other biblical women. However, modern scholarship and Church teaching emphasize her authentic biblical identity: a faithful disciple, a witness of the Resurrection, and a model of profound love and renewed life in Christ. Her feast day, July 22, celebrates her pivotal role in Christian history. Mary Magdalene remains a powerful symbol of redemption, spiritual courage, and the dignity of women in the early Church.",
    "patronage": "Penitents, women, converts, contemplative life",
    "canonizationYear": null,
    "imageUrl": "/images/saint_mary_magdalene.jpg",
    "imageSource": "Art UK (National Gallery) – saint-mary-magdalene-115207",
    "imageAuthor": "Art UK / National Gallery (photographic reproduction)",
    "imageLicence": "Public Domain (PD-Art)"
  },
  {
    "name": "Saint Brigid of Ireland",
    "birthYear": 451,
    "deathYear": 525,
    "feastDay": "--02-01",
    "biography": "Saint Brigid of Ireland, also known as Brigid of Kildare or Mary of the Gael, is one of Ireland’s most beloved saints and a central figure in the country’s Christian heritage. Born into a noble family during Ireland’s transition from paganism to Christianity, Brigid was known from childhood for her extraordinary generosity, often giving away her family's possessions to those in need. Choosing a religious life, she founded a community of women religious and established the monastery of Kildare, which became a center of learning, hospitality, craftsmanship, and spiritual life. Unique in early Christian Europe, Kildare housed both monks and nuns, with Brigid serving as abbess and demonstrating remarkable leadership and administrative talent. Numerous legends surround Brigid, reflecting both her sanctity and the blending of Christian and Celtic traditions. She is said to have performed miracles of healing, multiplied food during times of scarcity, and shown compassion even to animals. Her feast day, February 1, marks the beginning of spring and aligns with the ancient festival of Imbolc, symbolizing renewal and hope. Today, Brigid remains a patron of dairy workers, blacksmiths, poets, and Ireland itself, representing generosity, creativity, and spiritual strength.",
    "patronage": "Ireland, dairy workers, blacksmiths, poets",
    "canonizationYear": null,
    "imageUrl": "/images/saint_brigid.jpg",
    "imageSource": "https://hughlane.ie",
    "imageAuthor": "Hugh Lane Gallery (photographic reproduction)",
    "imageLicence": "Public Domain (PD-Art)"
  },
  {
    "name": "Saint Andrew the Apostle",
    "birthYear": 5,
    "deathYear": 60,
    "feastDay": "--11-30",
    "biography": "Saint Andrew the Apostle, the brother of Saint Peter, was a fisherman from Galilee and one of Jesus Christ’s first disciples, known as the 'First-Called.' He played a key role in spreading Christianity across regions around the Black Sea, including Greece, where he preached and baptized many. Tradition holds that he was martyred on an X-shaped cross in Patras. Saint Andrew is venerated for his unwavering faith and courage, and he is the patron saint of Scotland, Russia, and Greece, inspiring generations of believers with his apostolic zeal.",
    "patronage": "Scotland, Russia, fishermen, singers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_andrew.jpg",
    "imageSource": "National Gallery, London",
    "imageAuthor": "Carlo Crivelli",
    "imageLicence": "Public domain – faithful photographic reproduction of a two-dimensional public domain work of art"
  },
  {
    "name": "Saint George",
    "birthYear": 275,
    "deathYear": 303,
    "feastDay": "--04-23",
    "biography": "Saint George was a Roman soldier renowned for his courage and devotion to his Christian faith during the Diocletian persecution. According to legend, he slew a dragon that terrorized a town and saved a princess, a story symbolizing the triumph of good over evil. Martyred for refusing to renounce his faith, he became one of the most venerated saints in Christianity. Saint George is honored as the patron saint of England, Georgia, and Catalonia, and his legacy has inspired countless works of art, literature, and devotion.",
    "patronage": "Soldiers, scouts, England, Georgia",
    "canonizationYear": null,
    "imageUrl": "/images/saint_george.jpg",
    "imageSource": "Byzantine and Christian Museum, Athens",
    "imageAuthor": "Georgios Klontzas",
    "imageLicence": "Public domain – image of a work in the public domain by a deceased artist (over 70 years)"
  },
  {
    "name": "Saint Stephen",
    "birthYear": 5,
    "deathYear": 34,
    "feastDay": "--12-26",
    "biography": "Saint Stephen, the first Christian martyr, is remembered as the Protomartyr of the Church. He was chosen as one of the first seven deacons to assist in charitable work and was known for his wisdom, courage, and dedication to spreading the Gospel. His bold preaching and miracles brought him before the Sanhedrin, where he was accused of blasphemy and stoned to death while praying for his executioners. Saint Stephen’s feast day is celebrated on December 26, honoring his witness to Christ and his example of forgiveness and steadfast faith.",
    "patronage": "Deacons, stonemasons, headache sufferers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_stephen.jpg",
    "imageSource": "Prato Cathedral, Italy",
    "imageAuthor": "Paolo Uccello",
    "imageLicence": "Public domain – faithful photographic reproduction of a two-dimensional public domain work of art"
  },
  {
    "name": "Saint Leo the Great",
    "birthYear": 391,
    "deathYear": 461,
    "feastDay": "--11-10",
    "biography": "Saint Leo the Great served as Pope from 440 to 461 and is celebrated for his theological insight and strong leadership during challenging times. He defended the Church against heresies, clarified the doctrine of the Incarnation, and famously persuaded Attila the Hun to spare Rome. His writings, letters, and sermons greatly influenced Christian thought and the authority of the papacy. Declared a Doctor of the Church, Saint Leo is honored for his wisdom, courage, and pastoral care, and his feast day is celebrated on November 10.",
    "patronage": "Popes, teachers, diplomats",
    "canonizationYear": null,
    "imageUrl": "/images/saint_leo_great.jpg",
    "imageSource": "Museo del Prado, Madrid",
    "imageAuthor": "Francisco Herrera the Younger",
    "imageLicence": "Public domain – faithful photographic reproduction of a two-dimensional public domain work of art"
  },
  {
    "name": "Saint John the Baptist",
    "birthYear": null,
    "deathYear": 30,
    "feastDay": "--06-24",
    "biography": "Saint John the Baptist is a central prophetic figure who prepared the way for Jesus Christ. He preached repentance, baptized followers in the Jordan River, and called for moral renewal. John fearlessly confronted rulers and was imprisoned and ultimately beheaded by King Herod. He is honored as the forerunner of Christ, symbolizing purification, renewal, and the courage to speak truth to power. His feast day is celebrated on June 24, recognizing his vital role in salvation history.",
    "patronage": "Baptists, converts, journalists, tailors",
    "canonizationYear": null,
    "imageUrl": "/images/saint_john_baptist.jpg",
    "imageSource": "Nelson-Atkins Museum of Art",
    "imageAuthor": "Caravaggio",
    "imageLicence": "Public domain – faithful photographic reproduction of a two-dimensional public domain work of art"
  },
  {
    "name": "Saint Margaret of Scotland",
    "birthYear": 1045,
    "deathYear": 1093,
    "feastDay": "--11-16",
    "biography": "Saint Margaret of Scotland was born around 1045 in exile in Hungary, the daughter of Edward the Exile and granddaughter of King Edmund Ironside of England. After the Norman Conquest, she fled to Scotland and married King Malcolm III around 1070. As queen, Margaret was known for her devout faith, humility, and charity. She worked tirelessly to reform the Scottish Church, promoting Roman Catholic practices, encouraging monastic life, and supporting education for clergy and nobility alike. Margaret personally ministered to the poor and sick, demonstrating exceptional compassion and devotion. She bore eight children, including three future kings, raising them with piety and a sense of responsibility. Margaret died shortly after the death of her husband and eldest son in 1093. Canonized in 1250 by Pope Innocent IV, she remains one of Scotland’s most revered saints, remembered for her deep spiritual influence and charitable works.",
    "patronage": "Scotland, widows, charity, education",
    "canonizationYear": 1250,
    "imageUrl": "/images/saint_margaret.jpg",
    "imageSource": "Art UK",
    "imageAuthor": "Nicolas de Largillière (1656–1746)",
    "imageLicence": "Public domain. The author died in 1746, so this work is in the public domain in its country of origin and other countries where copyright term is life plus 100 years or fewer. Public domain in the United States because it was published or registered before January 1, 1930."
  },
  {
    "name": "Saint Juan Diego",
    "birthYear": 1474,
    "deathYear": 1548,
    "feastDay": "--12-09",
    "biography": "Saint Juan Diego Cuauhtlatoatzin was born in 1474 near present-day Mexico City, in what was then the Aztec Empire. A humble indigenous farmer and weaver, he lived a simple life devoted to his family and community. At the age of 57, he converted to Christianity following the arrival of Franciscan missionaries. On December 9, 1531, the Virgin Mary appeared to him on Tepeyac Hill as Our Lady of Guadalupe, requesting that a shrine be built in her honor. To prove the authenticity of his visions, Juan Diego presented his tilma, which miraculously bore her image. This tilma remains a treasured relic and object of veneration. He spent the remainder of his life in quiet devotion and service, helping the poor and practicing humility. Canonized by Pope John Paul II in 2002, he is celebrated as the first indigenous saint of the Americas, symbolizing faith, obedience, and cultural bridging.",
    "patronage": "Indigenous peoples of the Americas",
    "canonizationYear": 2002,
    "imageUrl": "/images/saint_juan_diego.jpg",
    "imageSource": "http://www.vatican.va/news_services/liturgy/saints/ns_lit_doc_20020731_juan-diego_en.html",
    "imageAuthor": "Miguel Cabrera (1695–1768)",
    "imageLicence": "Public domain. The author died in 1768, so this work is in the public domain in its country of origin and other countries where copyright term is life plus 100 years or fewer. Public domain in the United States because it was published or registered before January 1, 1930."
  },
  {
    "name": "Saint Ambrose",
    "birthYear": 339,
    "deathYear": 397,
    "feastDay": "--12-07",
    "biography": "Saint Ambrose, born around 339 AD in Trier, Germany, was from a wealthy Roman Christian family. Trained in law and rhetoric, he initially pursued a career in public service and became governor of Milan. In 374, he was unexpectedly chosen as Bishop of Milan by popular acclaim, even before his baptism, demonstrating the deep trust the community placed in him. Ambrose became a prominent Church Father, defending orthodoxy against Arianism, advocating for Church independence from secular powers, and guiding spiritual leaders including Saint Augustine, whom he baptized in 387. He authored hymns, treatises, and letters that shaped Christian theology and liturgy. Revered as a Doctor of the Church, Ambrose’s influence on the development of Western Christianity and ecclesiastical governance remains profound. He died in 397, leaving a legacy of learning, piety, and courage in leadership.",
    "patronage": "Milan, beekeepers, bishops, theologians",
    "canonizationYear": null,
    "imageUrl": "/images/saint_ambrose.jpg",
    "imageSource": "https://clevelandart.org/art/1969.23",
    "imageAuthor": "Francisco de Goya (1746–1828)",
    "imageLicence": "Creative Commons CC0 1.0 Universal Public Domain Dedication. The work has been dedicated to the public domain, allowing copying, modification, distribution, and performance without permission, including for commercial purposes."
  },
  {
    "name": "Saint Mark the Evangelist",
    "birthYear": 7,
    "deathYear": 68,
    "feastDay": "--04-25",
    "biography": "Saint Mark the Evangelist is traditionally recognized as the author of the Gospel of Mark, which is among the four canonical gospels of the New Testament. He was believed to be a close companion of the Apostle Peter, receiving guidance and teachings that influenced the content of his gospel. Mark is associated with founding the early Christian community in Alexandria, Egypt, where he served as the first bishop. Celebrated for his role in spreading Christianity through Egypt and North Africa, he is symbolized by the winged lion, representing courage and royal dignity. His relics were eventually enshrined in Venice, making him the city’s patron saint. Mark’s life demonstrates devotion, evangelistic zeal, and steadfast leadership, and his feast day is celebrated on April 25.",
    "patronage": "Venice, notaries, lawyers, glaziers, scribes",
    "canonizationYear": null,
    "imageUrl": "/images/saint_mark.jpg",
    "imageSource": "Bibliothèque nationale de France",
    "imageAuthor": "Jean Bourdichon (1457–1521), upload and restoration by Jebulon",
    "imageLicence": "Public domain. Faithful photographic reproduction of a two-dimensional public domain work of art. The original work is in the public domain in its country of origin and in the United States because it was published before January 1, 1930."
  },
  {
    "name": "Saint Gregory the Great",
    "birthYear": 540,
    "deathYear": 604,
    "feastDay": "--09-03",
    "biography": "Saint Gregory the Great, born circa 540 AD in Rome, came from a wealthy and influential Roman family. Initially serving as Prefect of Rome, he later embraced monastic life, founding monasteries and dedicating himself to prayer, study, and charitable works. In 590, he was elected pope during a period of political turmoil and famine. Gregory is renowned for reforming Church liturgy, codifying canonical procedures, and promoting missionary work, including sending Augustine of Canterbury to evangelize England. He authored numerous theological works, letters, and the 'Dialogues,' shaping medieval Christianity and pastoral care. He is also credited with laying the groundwork for Gregorian Chant. Canonized and recognized as a Doctor of the Church, Saint Gregory’s feast day is celebrated on September 3, honoring his lasting spiritual, intellectual, and administrative contributions to the Church.",
    "patronage": "Musicians, singers, students, teachers",
    "canonizationYear": 604,
    "imageUrl": "/images/saint_gregory_great.jpg",
    "imageSource": "_QGADvU2Iz2-ug at Google Cultural Institute, maximum zoom",
    "imageAuthor": "Francisco Goya (1746–1828)",
    "imageLicence": "Public domain. The author died in 1828, so this work is in the public domain in its country of origin and other countries where copyright term is life plus 100 years or fewer. Public domain in the United States because it was published or registered before January 1, 1930."
  },
  {
    "name": "Saint Anastasia of Sirmium",
    "birthYear": 281,
    "deathYear": 304,
    "feastDay": "--12-25",
    "biography": "Saint Anastasia of Sirmium was a noble Roman woman who became renowned for her extraordinary courage and unwavering faith during the Diocletian persecution. Born in the late 3rd century, she dedicated her life to the care of imprisoned Christians, providing them with comfort, healing, and spiritual support, often at great personal risk. Known for her compassion and devotion, Anastasia also tended to the sick and the poor, earning her the title 'Deliverer from Poison.' Arrested for her Christian faith, she endured severe torture and ultimately faced martyrdom around 304 AD in Sirmium (modern-day Serbia). Celebrated as a healer and protector against evil, her feast is commemorated on December 22 in the Western Church and December 25 in the Eastern Orthodox Church.",
    "patronage": "Pharmacists, doctors, apothecaries, healers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_anastasia.jpg",
    "imageSource": "https://www.h-r-z.hr/en/index.php/djelatnosti/konzerviranje-restauriranje/staf2/2150-st-martin-s-polyptych-by-vittore-carpaccio",
    "imageAuthor": "Vittore Carpaccio (1465–1526)",
    "imageLicence": "Public domain – The author died in 1526, so this work is in the public domain in its country of origin and other countries where copyright lasts the author's life plus 100 years or fewer. Also in the United States because it was published before January 1, 1930. This photographic reproduction is public domain."
  },
  {
    "name": "Saint Cyprian",
    "birthYear": 210,
    "deathYear": 258,
    "feastDay": "--09-16",
    "biography": "Saint Cyprian, originally a pagan and respected lawyer, converted to Christianity in his thirties and quickly rose to prominence as a bishop of Carthage. His tenure coincided with a period of intense persecution under Roman emperors Decius and Valerian, during which he provided courageous leadership and pastoral guidance to the Christian community. Cyprian emphasized the importance of unity, discipline, and charity within the Church, writing influential works such as 'On the Unity of the Church' and numerous letters addressing theological and practical matters. His boldness in defending the faith ultimately led to his arrest and execution in 258 AD, marking him as one of North Africa’s most revered martyrs. His feast day is celebrated on September 16.",
    "patronage": "North Africa, Berbers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_cyprian.jpg",
    "imageSource": "https://www.johnsanidopoulos.com/2019/09/holy-hieromartyr-cyprian-bishop-of.html",
    "imageAuthor": "Unknown author",
    "imageLicence": "Public domain – The work is in the public domain in its country of origin and other countries where copyright term is the author's life plus 70 years or fewer. Also in the United States. Note: some countries have longer terms."
  },
  {
    "name": "Saint Ignatius of Loyola",
    "birthYear": 1491,
    "deathYear": 1556,
    "feastDay": "--07-31",
    "biography": "Saint Ignatius of Loyola, born into a Spanish noble family, began his life as a soldier but underwent a profound spiritual conversion after being wounded in battle. This experience led him to devote himself entirely to God and to found the Society of Jesus (Jesuits) in 1534, a religious order focused on education, missionary work, and spiritual guidance. Ignatius developed the Spiritual Exercises, a structured program of meditations and prayers that remain central to Jesuit spirituality. Throughout his life, he traveled widely, advising rulers and inspiring countless followers, while fostering the growth of Catholic education and global missionary efforts. He died in Rome in 1556 and was canonized in 1622. His feast day is celebrated on July 31.",
    "patronage": "Society of Jesus, spiritual retreats, soldiers, Gipuzkoa, education",
    "canonizationYear": 1622,
    "imageUrl": "/images/saint_ignatius_loyola.jpg",
    "imageSource": "https://www.nortonsimon.org/art/detail/M.1975.03.P/",
    "imageAuthor": "Peter Paul Rubens (1577–1640)",
    "imageLicence": "Public domain – The author died in 1640, so this work is in the public domain in its country of origin and other countries with life+100 years copyright term. Also public domain in the United States as it was published before 1930."
  },
  {
    "name": "Saint Martin of Tours",
    "birthYear": 316,
    "deathYear": 397,
    "feastDay": "--11-11",
    "biography": "Saint Martin of Tours, born in Pannonia (modern-day Hungary), is celebrated for his extraordinary acts of charity and deep faith. Initially a soldier in the Roman army, he famously shared his cloak with a beggar during a harsh winter, a defining act of compassion that led him to leave military service and pursue a monastic life. He founded monasteries, preached extensively across Gaul, and helped establish early monastic traditions in Western Europe. As Bishop of Tours, Martin was a tireless missionary and spiritual guide, revered for his humility, generosity, and devotion to the poor. He passed away in 397 AD, and his feast day is observed on November 11.",
    "patronage": "Soldiers, France, conscientious objectors, beggars",
    "canonizationYear": null,
    "imageUrl": "/images/saint_martin_tours.jpg",
    "imageSource": "https://www.sammlung.pinakothek.de/en/artwork/gR4k37N4Ee",
    "imageAuthor": "Jacopo Bassano (1510–1592)",
    "imageLicence": "Public domain – The author died in 1592, so this work is in the public domain in its country of origin and other countries with life+100 years copyright term. Also public domain in the United States because it was published before January 1, 1930. This photographic reproduction is public domain."
  },
  {
    "name": "Saint John Vianney",
    "birthYear": 1786,
    "deathYear": 1859,
    "feastDay": "--08-04",
    "biography": "Saint John Vianney, known as the Curé of Ars, was a French priest whose life exemplified humility, holiness, and devotion to the pastoral care of souls. Born in 1786 in Dardilly, France, he overcame early educational difficulties to become a deeply spiritual parish priest. In his small rural parish of Ars, he transformed the community through his dedication to the sacraments, especially the sacrament of confession, spending hours guiding the faithful. Renowned for his ascetic lifestyle, prayer, and spiritual counsel, John Vianney inspired clergy and laity alike. He was canonized in 1925 and is recognized as the patron saint of parish priests. His feast day is celebrated on August 4.",
    "patronage": "Parish priests, confession, priests",
    "canonizationYear": 1925,
    "imageUrl": "/images/saint_john_vianney.jpg",
    "imageSource": "https://en.namu.wiki/w/%ED%8C%8C%EC%9D%BC:%EB%B9%84%EC%95%88%EB%84%A4.png",
    "imageAuthor": "George Desvallières (1874–1950)",
    "imageLicence": "Public domain – This work is in the public domain in the United States because it was published before January 1, 1930. It is also public domain in the source country (France) as copyright term is life+70 years or fewer."
  },
  {
    "name": "Saint John of the Cross",
    "birthYear": 1542,
    "deathYear": 1591,
    "feastDay": "--12-14",
    "biography": "Saint John of the Cross was born in 1542 in Fontiveros, Spain, into a humble family. He joined the Carmelite Order and became a close collaborator of Saint Teresa of Ávila, playing a central role in reforming the Carmelite order to emphasize austerity, contemplative prayer, and spiritual discipline. John is celebrated for his mystical writings and poetry, most notably 'Dark Night of the Soul' and 'Ascent of Mount Carmel', which describe the soul's journey through purification toward union with God. Enduring imprisonment and harsh treatment for his reformist zeal, he remained steadfast in faith, leaving a legacy that deeply influenced Christian mysticism and spiritual theology. He was canonized in 1726 by Pope Benedict XIII and declared a Doctor of the Church in 1926. His feast day is December 14, and he is the patron saint of mystics, contemplatives, and Spanish poets.",
    "patronage": "Mystics, contemplatives, Spanish poets",
    "canonizationYear": 1726,
    "imageUrl": "/images/saint_john_of_cross.jpg",
    "imageSource": "www.muzeum.archidiecezja.katowice.pl",
    "imageAuthor": "Unknown author",
    "imageLicence": "Public domain. This is a faithful photographic reproduction of a two-dimensional public domain work of art. The original painting is in the public domain in its country of origin and other countries where copyright lasts the author's life plus 100 years or fewer. United States public domain tag applies."
  },
  {
    "name": "Saint Isabel of France",
    "birthYear": 1225,
    "deathYear": 1270,
    "feastDay": "--02-26",
    "biography": "Saint Isabel of France, born in 1225, was the daughter of King Louis VIII of France and Blanche of Castile. She married King Louis IX, later canonized as Saint Louis, and dedicated herself to piety, charitable works, and caring for the sick and poor. Isabel founded hospitals, supported religious communities, and influenced the spiritual life of the French court. After the death of her husband during the Eighth Crusade, she continued a devout life of prayer and service, offering guidance to her children and continuing her charitable activities. Canonized in 1696, Isabel is remembered for her humility, devotion, and commitment to justice and peace. Her feast day is February 26, and she is the patron saint of the sick, peace, brides, and easing jealousy.",
    "patronage": "The sick, peace, brides, easing jealousy",
    "canonizationYear": 1696,
    "imageUrl": "/images/saint_isabel_france.jpg",
    "imageSource": "http://visualiseur.bnf.fr/ConsulterElementNum?Destination=Daguerre&O=7884418&E=JPEG&Param=A",
    "imageAuthor": "Roger de Gaignières",
    "imageLicence": "Public domain. The work is in the public domain in its country of origin and other countries where copyright lasts the author's life plus 70 years or fewer. United States public domain tag applies."
  },
  {
    "name": "Saint Louis IX",
    "birthYear": 1214,
    "deathYear": 1270,
    "feastDay": "--08-25",
    "biography": "Saint Louis IX, born in 1214, became King of France in 1226 and reigned until his death in 1270. Renowned for his deep Christian faith, justice, and charity, he reformed the legal system, founded hospitals, and supported education and the arts. Louis led the Seventh and Eighth Crusades to reclaim the Holy Land, showing his dedication to Christian ideals despite military setbacks. He maintained personal piety, fasting, and humility, and mediated disputes to promote peace. Canonized in 1297, he is the only French king to have been declared a saint. His feast day is August 25, and he is the patron saint of France, kings, Christian monarchy, university students, and prisoners.",
    "patronage": "France, kings, Christian monarchy, university students, prisoners",
    "canonizationYear": 1297,
    "imageUrl": "/images/saint_luis_ix.jpg",
    "imageSource": "http://www.themorgan.org/collections/collections.asp?id=81",
    "imageAuthor": "Anonymous",
    "imageLicence": "Public domain. The work is in the public domain in its country of origin and other countries where copyright lasts the author's life plus 100 years or fewer. United States public domain tag applies."
  },
  {
    "name": "Saint Simon the Zealot",
    "birthYear": 5,
    "deathYear": 65,
    "feastDay": "--10-28",
    "biography": "Saint Simon the Zealot was one of the twelve apostles of Jesus Christ. Very little is definitively known about his life, but he is remembered as a devoted disciple and preacher of the Gospel. The title 'Zealot' may refer to his fervent commitment to Judaism or possible association with the Zealot movement opposing Roman rule. Tradition suggests he spread Christianity to regions such as Egypt, Persia, and possibly Britain, often facing persecution. He is venerated as a martyr, though the circumstances of his death are uncertain. His feast day, October 28, is often celebrated alongside Saint Jude Thaddeus. Simon is the patron saint of curriers, sawyers, and tanners.",
    "patronage": "Curriers, sawyers, tanners",
    "canonizationYear": null,
    "imageUrl": "/images/saint_simon_zealot.jpg",
    "imageSource": "http://www.museodelprado.es/uploads/tx_gbobras/P01091.jpg",
    "imageAuthor": "Jusepe de Ribera",
    "imageLicence": "Public domain. This is a faithful photographic reproduction of a two-dimensional public domain work of art. The original painting is in the public domain in its country of origin and other countries where copyright lasts the author's life plus 100 years or fewer. United States public domain tag applies."
  },
  {
    "name": "Saint Charbel Makhlouf",
    "birthYear": 1828,
    "deathYear": 1898,
    "feastDay": "--07-24",
    "biography": "Saint Charbel Makhlouf, born Youssef Antoun Makhlouf in 1828 in Bekaa Kafra, Lebanon, joined the Maronite monastic order at Annaya and took the name Charbel. He lived an austere life of solitude, prayer, and spiritual discipline. Despite his quiet monastic existence, he became known for miraculous healings attributed to him during his life and after death. Charbel's holiness and mystical life drew pilgrims seeking physical and spiritual healing. Canonized by Pope Paul VI in 1977, he is venerated primarily in Lebanon and among Maronite Christians worldwide. His feast day is July 24, and he is the patron saint of Lebanon.",
    "patronage": "Lebanon",
    "canonizationYear": 1977,
    "imageUrl": "/images/saint_charbel.jpg",
    "imageSource": "www.st-charbel.fr",
    "imageAuthor": "Unknown (Old Photo)",
    "imageLicence": "Public domain. The work is over 100 years old and is considered in the public domain. United States public domain tag applies."
  },
  {
    "name": "Saints Cosmas and Damian",
    "birthYear": null,
    "deathYear": 303,
    "feastDay": "--09-26",
    "biography": "Cosmas and Damian were twin brothers and early Christian martyrs who lived in the Roman province of Syria during the 3rd century. They were physicians who offered healing without charge, earning the title 'Unmercenary Physicians.' Known for their compassion, miraculous cures, and dedication to the poor, they combined medical care with spreading the Christian faith. They were eventually arrested and executed under Roman persecution around 303 AD. Throughout history, their example of charity and service made them widely venerated, particularly among medical professionals. Their feast day is September 26, and they are the patron saints of physicians, surgeons, pharmacists, twins, and the sick.",
    "patronage": "Physicians, surgeons, pharmacists, twins, and those suffering from illness",
    "canonizationYear": null,
    "imageUrl": "/images/saint_cosmas_damian.jpg",
    "imageSource": "Art UK",
    "imageAuthor": "Master of Liesborn",
    "imageLicence": "Public domain. This is a faithful photographic reproduction of a two-dimensional public domain work of art. The original painting is in the public domain in its country of origin and other countries where copyright lasts the author's life plus 100 years or fewer. United States public domain tag applies."
  },
  {
    "name": "Saint Daniel",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "--07-21",
    "biography": "Saint Daniel is remembered as one of the most faithful prophets of the Old Testament. Taken captive to Babylon during the exile of the Israelites, he served in the royal courts of Babylonian and Persian kings, demonstrating wisdom and integrity despite living in a foreign land. Daniel remained steadfast in his devotion to God, refusing to compromise his faith even under threat of death. He is best known for interpreting dreams and visions that foretold future events, and for his miraculous survival in the lions’ den, which exemplifies divine protection and unwavering trust in God. His life encourages believers to remain faithful, courageous, and prayerful in the midst of trials and uncertainty.",
    "patronage": "Protection from danger, against demonic possession, and apocalyptic prophecy",
    "canonizationYear": null,
    "imageUrl": "/images/saint_daniel.jpg",
    "imageSource": "Web Gallery of Art",
    "imageAuthor": "Michelangelo (1475–1564)",
    "imageLicence": "Public domain. This is a faithful photographic reproduction of a two-dimensional public domain work of art. The work of art itself is in the public domain because the author died in 1564, so copyright has expired in most countries, including the United States."
  },
  {
    "name": "Saint Dorothy",
    "birthYear": 285,
    "deathYear": 311,
    "feastDay": "--02-06",
    "biography": "Saint Dorothy was a young Christian martyr of the early 4th century, celebrated for her purity, courage, and unwavering faith. Living during the persecutions under Emperor Diocletian, she remained firm in her belief in Christ and was sentenced to death for refusing to renounce her faith. According to tradition, before her execution, Dorothy sent a miraculous basket of roses and fruits to a judge who had mocked her, leading to his conversion and recognition of God’s power. She is often depicted holding roses and a basket, symbolizing heavenly reward and steadfastness in faith. Saint Dorothy's story has inspired generations to remain courageous and trust in divine providence even in the face of suffering.",
    "patronage": "Gardeners, florists, brides, and those seeking a happy marriage",
    "canonizationYear": null,
    "imageUrl": "/images/saint_dorothy.jpg",
    "imageSource": "Art UK",
    "imageAuthor": "Master of Liesborn",
    "imageLicence": "Public domain. This is a faithful photographic reproduction of a two-dimensional public domain work of art. The work of art itself is in the public domain because the author died in 1495, so copyright has expired in most countries, including the United States."
  },
  {
    "name": "Saint Barnabas",
    "birthYear": null,
    "deathYear": 61,
    "feastDay": "--06-11",
    "biography": "Saint Barnabas was an early Christian apostle, missionary, and companion of Saint Paul. Renowned for his generosity and encouragement, he played a crucial role in nurturing early Christian communities and spreading the Gospel to Gentiles. He introduced Paul to the apostles in Jerusalem and traveled extensively on missionary journeys to strengthen and guide fledgling Christian congregations. Barnabas was often called the 'son of encouragement' for his ability to uplift believers and foster unity. His life demonstrates the power of faith, mentorship, and selfless service in the growth of the early Church.",
    "patronage": "Cyprus, Cyprus missionaries, and the island’s Christian community",
    "canonizationYear": null,
    "imageUrl": "/images/saint_barnabas.jpg",
    "imageSource": "santiebeati.it",
    "imageAuthor": "Anonimo Lombardo",
    "imageLicence": "Public domain. The copyright holder has released this work into the public domain, applying worldwide."
  },
  {
    "name": "Saint Camilla Battista da Varano",
    "birthYear": 1458,
    "deathYear": 1524,
    "feastDay": "--05-31",
    "biography": "Saint Camilla Battista da Varano was an Italian noblewoman who chose a life of deep spiritual devotion as a Poor Clare nun and mystic. Born into a ruling family, she resisted the societal expectation of a political marriage and pursued a path of prayer, contemplation, and service to God. She experienced profound mystical visions and authored spiritual writings focused on the Passion of Christ, humility, and the contemplative life. Saint Camilla’s life is a testament to the transformative power of faith and the courage to follow God’s will over worldly expectations. Her dedication inspired many to seek a life of prayer and simplicity.",
    "patronage": "Poor Clares, contemplative life, Italy",
    "canonizationYear": 2010,
    "imageUrl": "/images/saint_camilla.jpg",
    "imageSource": "Unknown source",
    "imageAuthor": "Unknown author",
    "imageLicence": "Public domain. This work is in the public domain in its country of origin and other countries where the copyright term is the author's life plus 70 years or fewer. This work is also in the public domain in the United States."
  },
  {
    "name": "Saint Basil the Great",
    "birthYear": 329,
    "deathYear": 379,
    "feastDay": "--01-02",
    "biography": "Saint Basil the Great was a bishop, theologian, and monastic reformer of the 4th century who profoundly influenced Christian life and doctrine. Born into a wealthy and religious family, he devoted his life to defending the Nicene Creed against heresies while caring for the poor and sick. Basil wrote extensively on theology and established guidelines for monastic life emphasizing community, prayer, and service. His work laid the foundation for Eastern monasticism and inspired countless believers to integrate faith with action. Celebrated as a Doctor of the Church, his legacy continues to guide theologians, clergy, and lay Christians in devotion, scholarship, and charity.",
    "patronage": "Monks, theologians, Russia, and Greece",
    "canonizationYear": null,
    "imageUrl": "/images/saint_basil.jpg",
    "imageSource": "Sedmitza.ru",
    "imageAuthor": "Unknown author",
    "imageLicence": "Public domain. This is a faithful photographic reproduction of a two-dimensional public domain work of art. The work itself is in the public domain in its country of origin and in the United States."
  },
  {
    "name": "Saint Ignatius of Antioch",
    "birthYear": 35,
    "deathYear": 108,
    "feastDay": "--10-17",
    "biography": "Saint Ignatius of Antioch was the third bishop of Antioch and one of the most important Apostolic Fathers. Believed to be a disciple of Saint John the Apostle and possibly among the children Jesus blessed, Ignatius guided the early Christian community with remarkable courage and faith. Arrested during the reign of Emperor Trajan, he was transported to Rome to face execution. Along the journey, he wrote seven letters to Christian communities, offering profound insights into Church structure, the sacraments, and the role of bishops as unifying leaders. Ignatius emphasized the Eucharist, the Incarnation, and obedience to Church authority, viewing martyrdom as a path to union with Christ. He was ultimately executed in the Roman Colosseum, welcoming his death as a witness to Christ’s love and truth.",
    "patronage": "Antioch, Syria, and the Eastern Orthodox Church",
    "canonizationYear": null,
    "imageUrl": "/images/saint_ignatius_antioch.jpg",
    "imageSource": "Galleria Borghese, Rome",
    "imageAuthor": "Neapolitan School of Painting, possibly Cesare Fracanzano (1605-1651)",
    "imageLicence": "Public domain. This is a faithful photographic reproduction of a two-dimensional public domain work of art. The author died in 1651, so the work is in the public domain in its country of origin and in the United States."
  },
  {
    "name": "Saint Pius X",
    "birthYear": 1835,
    "deathYear": 1914,
    "feastDay": "--08-21",
    "biography": "Born Giuseppe Melchiorre Sarto into a humble family in northern Italy, Saint Pius X devoted his life to pastoral service and deepening the spiritual life of the faithful. He was ordained a priest in 1858 and quickly became known for his simplicity, humility, and dedication to the poor. Elected Pope in 1903, he implemented significant reforms, including promoting frequent and early reception of Holy Communion, strengthening catechesis, and encouraging active participation in the sacraments. He also addressed modernist trends in theology and streamlined Church governance by initiating the 1917 Code of Canon Law. Known as the “Pope of the Eucharist,” his papacy emphasized personal holiness, pastoral care, and liturgical renewal. Saint Pius X passed away in 1914 and was canonized in 1954 for his exemplary devotion and service to the Church.",
    "patronage": "Catechists, first communicants, pilgrims, and emigrants",
    "canonizationYear": 1954,
    "imageUrl": "/images/saint_pius_x.jpg",
    "imageSource": "Herder Verlag, Freiburg im Breisgau: Die katholischen Missionen",
    "imageAuthor": "Francesco De Federicis (1853–1908)",
    "imageLicence": "Public domain. This file is in the public domain because it is a scan or reproduction of a public domain original. The original itself is in the public domain in its country of origin and in the United States."
  },
  {
    "name": "Saint David",
    "birthYear": 500,
    "deathYear": 589,
    "feastDay": "--03-01",
    "biography": "Saint David, known as Dewi Sant in Welsh, was a 6th-century bishop and the foremost patron saint of Wales. Renowned for his devout simplicity, he founded several monastic communities that emphasized ascetic living, self-sufficiency, and communal prayer. His influence extended across Wales, where he trained monks and bishops who spread Christian teaching throughout the region. Legend holds that during a sermon at the Synod of Brefi, the ground rose beneath him so that he could be seen and heard by all, while a dove landed on his shoulder—a symbol of divine approval. Celebrated for his wisdom, humility, and pastoral leadership, Saint David became a national icon of faith and moral guidance. His feast day, March 1, remains a major celebration in Wales, honoring his legacy and enduring spiritual influence.",
    "patronage": "Wales, vegetarians, poets",
    "canonizationYear": 1123,
    "imageUrl": "/images/saint_david.jpg",
    "imageSource": "National Library of Wales, Welsh Portrait Collection",
    "imageAuthor": "Charles Head (1850–1926)",
    "imageLicence": "Public domain. This work is in the public domain in its country of origin and in the United States."
  },
  {
    "name": "Saint Alexander of Jerusalem",
    "birthYear": null,
    "deathYear": 251,
    "feastDay": "--03-18",
    "biography": "Saint Alexander of Jerusalem served as bishop during a period of severe persecution in the early 3rd century. Born in Cappadocia, he became a guiding light for the Christian community in Jerusalem, mentoring young theologians such as Origen while fostering learning and devotion. Alexander established a library and ensured that early Christian teachings were preserved and disseminated. Under Emperor Decius, he was arrested for refusing to renounce his faith and was ultimately martyred in Caesarea. His life exemplifies courage, intellectual devotion, and steadfastness in the face of oppression, leaving a lasting spiritual legacy for the Church and future generations of believers.",
    "patronage": "Bishops, Jerusalem",
    "canonizationYear": null,
    "imageUrl": "/images/saint_alexander.jpg",
    "imageSource": "Google Arts & Culture — MwG0N90qRn-e3w",
    "imageAuthor": "Girolamo Romanino (1485–1566)",
    "imageLicence": "Public domain. This is a faithful photographic reproduction of a two-dimensional public domain work of art. The work itself is in the public domain in its country of origin and in the United States."
  },
  {
    "name": "Saint Polycarp",
    "birthYear": 69,
    "deathYear": 155,
    "feastDay": "--02-23",
    "biography": "Saint Polycarp, a 2nd-century bishop of Smyrna, was a direct disciple of the Apostle John and one of the most significant links between the apostolic era and the developing Christian Church. Revered for his humility, steadfast faith, and pastoral wisdom, he guided his community through doctrinal challenges and external persecution. Polycarp played a key role in early Church councils, particularly during the Quartodeciman controversy over the date of Easter, maintaining the traditions handed down from John. His martyrdom is among the earliest well-documented accounts: at the age of 86, he refused to renounce Christ before Roman authorities, was sentenced to be burned at the stake, and was finally killed when the flames failed to consume him. His courageous final prayer of thanksgiving has inspired generations of Christians to remain faithful unto death.",
    "patronage": "Smyrna, martyrs, and publishers",
    "canonizationYear": null,
    "imageUrl": "/images/saint_polycarp.jpg",
    "imageSource": "Own work",
    "imageAuthor": "PravoslavnyChristianin",
    "imageLicence": "Creative Commons CC0 1.0 Universal Public Domain Dedication. The author has dedicated the work to the public domain by waiving all rights worldwide."
  },
  {
    "name": "Saint Constantine the Great",
    "birthYear": 272,
    "deathYear": 337,
    "feastDay": "--05-21",
    "biography": "Saint Constantine the Great was the Roman Emperor whose conversion to Christianity dramatically transformed the history of the Church and Western civilization. Born in Naissus (modern-day Niš, Serbia), he became emperor in 306 AD and soon initiated reforms that granted Christians freedom of worship. In 313 AD, he issued the Edict of Milan with Licinius, legalizing Christianity and restoring confiscated Church property. Constantine convened the First Council of Nicaea in 325 AD, producing the Nicene Creed, a central statement of Christian faith. He founded Constantinople, creating a new imperial capital that became a cultural and religious hub. Celebrated as a saint in the Eastern Orthodox and some Eastern Catholic Churches, Constantine is remembered for integrating Christian principles into imperial governance, shaping the religious and political trajectory of Europe for centuries.",
    "patronage": "Converts, architects, and Roman emperors",
    "canonizationYear": null,
    "imageUrl": "/images/saint_constantine.jpg",
    "imageSource": "https://paletaart.wordpress.com/2013/08/25/%CE%BC%CF%8C%CF%83%CF%87%CE%BF%CF%82-%CE%B7%CE%BB%CE%AF%CE%B1%CF%82-elias-moskos-d-1687/#jp-carousel-14485",
    "imageAuthor": "Elias Moskos (1629–1687)",
    "imageLicence": "Public domain. Faithful photographic reproduction of a two-dimensional public domain work of art. Original work is in the public domain in its country of origin and in the United States."
  },
  {
    "name": "Saint Clement",
    "birthYear": 45,
    "deathYear": 101,
    "feastDay": "--11-23",
    "biography": "Saint Clement, the fourth Pope of the early Church, succeeded Saint Peter, Linus, and Cletus as Bishop of Rome. Serving near the end of the 1st century, he worked to preserve unity and apostolic tradition amid growing challenges. He is most famous for his epistle to the Corinthians, 1 Clement, which addresses disputes over leadership and emphasizes humility, obedience, and apostolic succession. Tradition holds that he was exiled by Emperor Trajan, forced to labor in quarries, and provided water miraculously to fellow prisoners. Ultimately, he was martyred by being tied to an anchor and thrown into the sea. Saint Clement is remembered for his steadfast faith, leadership, and the profound guidance he offered to early Christians.",
    "patronage": "Mariners, stonecutters, and the papacy",
    "canonizationYear": null,
    "imageUrl": "/images/saint_clement.jpg",
    "imageSource": "Google Cultural Institute — xQEv8mJ3jXYLbw",
    "imageAuthor": "Unknown",
    "imageLicence": "Public domain. Faithful photographic reproduction of a two-dimensional public domain work of art. Original work is in the public domain in its country of origin and in the United States."
  },
  {
    "name": "Saint Catherine of Sweden",
    "birthYear": 1303,
    "deathYear": 1373,
    "feastDay": "--07-23",
    "biography": "Saint Catherine of Sweden, born into a noble family in 1303, was widowed at a young age, an event that prompted her to dedicate her life entirely to God. She became a devout mystic and visionary, deeply influenced by the spiritual life of her time, and went on to found the Bridgettine Order, which combined a contemplative monastic life with active charity work. Catherine experienced profound visions and spiritual revelations, many of which she dictated as the 'Revelations of Saint Bridget,' profoundly influencing the religious life of Europe. She traveled widely, offering counsel to popes and monarchs, advocating for church reform, and promoting peace during a turbulent period in European history. Her humility, wisdom, and zeal for the Church earned her canonization in 1391 and later designation as a Patron Saint of Europe.",
    "patronage": "Sweden, broadcasters, Europe, brides, childbirth, visions",
    "canonizationYear": 1391,
    "imageUrl": "/images/saint_catherine_sweden.jpg",
    "imageAuthor": "Erik Salvén",
    "imageSource": "Svenska Turistföreningens årsbok 1923",
    "imageLicence": "Public domain (Sweden; author died before 1955; PD-old-70, PD-US-expired applicable)"
  },
  {
    "name": "Saint Timothy",
    "birthYear": null,
    "deathYear": 97,
    "feastDay": "--01-26",
    "biography": "Saint Timothy, a trusted companion of the Apostle Paul, played a vital role in the early Christian Church. Born in Lystra to a Jewish mother and Greek father, he was mentored by Paul during his second missionary journey and quickly became a devoted disciple and co-worker. Timothy was ordained by Paul and entrusted with leadership over early Christian communities, particularly the church in Ephesus. He is traditionally considered the recipient of the pastoral epistles, 1 and 2 Timothy, which offer guidance on church leadership, moral conduct, and maintaining faith amidst trials. Throughout his life, Timothy dedicated himself to spreading the Gospel, nurturing believers, and confronting heresy. Tradition holds that he was martyred in Ephesus around 97 AD, solidifying his reputation as a model of loyalty, courage, and pastoral dedication.",
    "patronage": "Deacons, expectant mothers, stomach disorders, synods",
    "canonizationYear": null,
    "imageUrl": "/images/saint_timothy.jpg",
    "imageAuthor": "Anonymous",
    "imageSource": "http://days.pravoslavie.ru/Images/ii2101&3977.htm",
    "imageLicence": "Public domain (faithful photographic reproduction; original created before 1000 AD)"
  },
  {
    "name": "Saint John Chrysostom",
    "birthYear": 347,
    "deathYear": 407,
    "feastDay": "--11-13",
    "biography": "Saint John Chrysostom, born around 347 in Antioch, Syria, earned the surname 'Chrysostom,' meaning 'golden-mouthed,' for his extraordinary preaching and eloquence. From a young age, he pursued a rigorous classical education before embracing the ascetic and monastic life. His early work as a priest gained him widespread recognition for sermons that condemned corruption and social injustice while promoting moral integrity, charity, and humility. Appointed Archbishop of Constantinople, he implemented sweeping reforms, challenging both ecclesiastical and imperial abuses. His outspoken stance earned him powerful enemies, resulting in multiple exiles. Despite these trials, his writings—including homilies, biblical commentaries, and letters—left a lasting impact on Christian liturgy, theology, and pastoral practice. Saint John Chrysostom was declared a Doctor of the Church, revered for his unwavering commitment to justice, spiritual leadership, and eloquent teaching.",
    "patronage": "Preachers, Orthodox Church, Constantinople, homilists",
    "canonizationYear": null,
    "imageUrl": "/images/saint_john_crysostom.jpg",
    "imageAuthor": "Unknown",
    "imageSource": "Cathedral of Hagia Sophia, Constantinople (modern Istanbul)",
    "imageLicence": "Public domain (faithful photographic reproduction; original approximately 1,000 years old)"
  },
  {
    "name": "Saint Philip",
    "birthYear": null,
    "deathYear": 80,
    "feastDay": "--05-03",
    "biography": "Saint Philip, one of the twelve apostles of Jesus Christ, is often identified as Philip the Apostle of Bethsaida, alongside Peter and Andrew. Philip is first mentioned in the Gospel of John, where Jesus calls him to discipleship, and he is noted for bringing Nathanael (Bartholomew) to Christ. Throughout Jesus’ ministry, he participated in key events, including the feeding of the 5,000 and the Last Supper. Following Pentecost, Philip became an evangelist, preaching across regions such as Greece, Phrygia, and Syria, often enduring hardship and persecution for his unwavering faith. Various traditions hold that he was martyred by crucifixion. Philip’s ministry exemplified zeal, evangelistic spirit, and a commitment to spreading the Gospel, earning him a lasting place among the apostles celebrated in both Eastern and Western Christian traditions.",
    "patronage": "Linemen, hatters, pastry chefs, Spain",
    "canonizationYear": null,
    "imageUrl": "/images/saint_philip.jpg",
    "imageAuthor": "Pompeo Batoni",
    "imageSource": "Art UK",
    "imageLicence": "Public domain (author died 1787; faithful photographic reproduction)"
  },
  {
    "name": "Saint Cornelius",
    "birthYear": null,
    "deathYear": 253,
    "feastDay": "--09-16",
    "biography": "Saint Cornelius, originally a Roman centurion, became Pope in 251 during a tumultuous period marked by persecution and internal strife. His pontificate focused on maintaining unity within the Church, particularly regarding the treatment of the 'lapsi,' Christians who had renounced their faith under duress. Cornelius emphasized pastoral care, discipline, and adherence to Church doctrine, strengthening the authority of the papacy in the process. Though his reign was short, ending with his martyrdom in 253, Cornelius left a legacy of courage, leadership, and dedication to the early Christian community, earning veneration as a saint who preserved faith and order during adversity.",
    "patronage": "The Roman Church, political prisoners, war victims",
    "canonizationYear": null,
    "imageUrl": "/images/saint_cornelius.jpg",
    "imageAuthor": "Master of Messkirch",
    "imageSource": "Anna Moraht-Fromm und Hans Westhoff: Der Meister von Meßkirch – Forschungen zur südwestdeutschen Malerei des 16. Jahrhunderts, Ulm, 1997, S. 190",
    "imageLicence": "Public domain (author died 1543; faithful photographic reproduction)"
  },
  {
    "name": "Saint John Paul II",
    "birthYear": 1920,
    "deathYear": 2005,
    "feastDay": "--10-22",
    "biography": "Saint John Paul II, born Karol Józef Wojtyła in 1920 in Wadowice, Poland, grew up under the shadow of World War II and the oppressive regimes of Eastern Europe. Ordained a priest in 1946, he rose to become a bishop and then cardinal, known for his intellectual depth, pastoral care, and strong advocacy for human dignity. Elected pope in 1978, he became the first non-Italian pope in over four centuries and led the Catholic Church for 27 years. His pontificate was marked by extensive travel, interfaith dialogue, promotion of human rights, and outreach to youth worldwide. He played a pivotal role in challenging communism in Eastern Europe, encouraged spiritual renewal through the new evangelization, and canonized many saints. John Paul II’s teachings, writings, and personal example continue to inspire millions, highlighting his vision of faith, compassion, and global engagement.",
    "patronage": "World Youth Day, Poland, families, athletes",
    "canonizationYear": 2014,
    "imageUrl": "/images/saint_john_paul_ii.jpg",
    "imageAuthor": "Polish Railways",
    "imageSource": "File:Train Pass of Karol Wojtyla.png",
    "imageLicence": "Public domain (Polish law; faithful photographic reproduction)"
  },
  {
    "name": "Saint Carlo Acutis",
    "birthYear": ,
    "deathYear": ,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": ,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Pier Giorgio Frassati",
    "birthYear": ,
    "deathYear": ,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": ,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Moses",
    "birthYear": ,
    "deathYear": ,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": ,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Elijah",
    "birthYear": ,
    "deathYear": ,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": ,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Abraham",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Isaac",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Jacob",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Joseph (Old Testament)",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Moses",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Aaron",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Elijah",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Elisha",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Samuel",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint David",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Isaiah",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Jeremiah",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Ezekiel",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Daniel",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Hosea",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Joel",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Amos",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Jonah",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  },
  {
    "name": "Saint Micah",
    "birthYear": null,
    "deathYear": null,
    "feastDay": "",
    "biography": "",
    "patronage": "",
    "canonizationYear": null,
    "imageUrl": "",
    "imageSource": "",
    "imageAuthor": "",
    "imageLicence": ""
  }
]